{"category":"Beef","link":"baked-empanadas-de-picadillo-with-arugula-queso-fresco-pickled-onion-salad","thumb":"\/\/media.blueapron.com\/recipes\/1134\/c_main_dish_images\/20150403-2130-15273-1024\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209989_20centered_high_also_thumb.jpg","title":" Baked Empanadas de Picadillo ","subtitle":" with Arugula, Queso Fresco &amp; Pickled Onion Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1134\/c_main_dish_images\/20150403-2130-12659-8162\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209991_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Let&rsquo;s celebrate Cinco de Mayo with homemade empanadas! From the Spanish word for wrapping an ingredient in bread, the empanada is a savory turnover particularly popular in the Eastern Mexican state of Hidalgo. Our baked empanadas &ldquo;de picadillo&rdquo; are savory-sweet, stuffed with a complex filling of ground beef, tomato sauce, apricots, almonds and spices. (A reference to the filling, &ldquo;de picadillo&rdquo; means &ldquo;minced.&rdquo;) We&rsquo;re pairing them with a zesty, creamy dipping sauce and an arugula salad tossed with crumbly queso fresco and quick-pickled onion. ","ingbg":"\/\/media.blueapron.com\/recipes\/1134\/ingredient_images\/20150428-1521-758-3069\/baked-empanadas-fp-w_large_feature.png","ingredients":[" ¾  Pound Ground Beef "," 10  Empanada Wrappers "," 1  8-Ounce Can Tomato Sauce "," 4  Ounces Arugula ","  1  Red Onion   "," 2  Ounces Queso Fresco ","  1  Tablespoon Fiesta Spice Blend (Smoked Sweet Paprika, Ancho Chile Powder, Ground Cumin, Ground Coriander, Garlic Powder, Mexican Oregano, Cocoa Powder & Ground Cinnamon)   "," 1  Tablespoon Red Wine Vinegar "," 1  Tablespoon Sugar "," ¼  Cup Dried Apricots "," ¼  Cup Sliced Almonds "," ½  Cup Sour Cream "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4429\/20150403-2135-14895-1947\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209960_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 425&deg;F. Wash and dry the fresh produce. Peel and halve the onion; thinly slice one half and small dice the other. Roughly chop the apricots. Crumble the queso fresco.  "},{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4430\/20150403-2135-14557-8196\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209962_high_feature.jpg","title":" Brown the beef:  ","desc":" In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the ground beef and season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 5 minutes, or until browned. Carefully drain off and discard the drippings.  "},{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4431\/20150403-2135-13354-3491\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209963_high_feature.jpg","title":" Make the filling:  ","desc":" Add the diced onion and spice blend to the pan of browned beef; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the onion has softened slightly. Add the tomato sauce, apricots, almonds and &frac12; cup of water; cook, stirring occasionally, 1 to 2 minutes, or until slightly thickened. Season with salt and pepper and transfer to a bowl. Rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4432\/20150403-2136-14576-7342\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209967_high_feature.jpg","title":" Assemble &amp; bake the empanadas:  ","desc":" Place 1 empanada wrapper on a clean, dry work surface. Using your fingers, lightly moisten the edges of the wrapper with water. Spoon a couple tablespoons of the filling into the center of the wrapper; fold the wrapper over the filling to form a half-moon shape. Using your fingers, press down on the edges to seal the wrapper; using a fork, firmly press down on the edges to crimp and seal completely. Repeat with the remaining wrappers and filling (you may have extra wrappers). Place the assembled empanadas on a lightly oiled sheet pan. Brush or lightly drizzle the tops of the empanadas with olive oil. Bake, rotating halfway through, 16 to 20 minutes, or until golden brown and puffed up. Remove from the oven and let cool for 2 minutes. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4433\/20150403-2136-14978-3063\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209961_high_feature.jpg","title":" Pickle the onion:  ","desc":" While the empanadas bake, in the same pan used to make the filling, combine the sliced onion, vinegar, sugar and &frac14; cup of water. Cook on medium heat, occasionally stirring and swirling the pan, 2 to 4 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume. Transfer to a heatproof bowl and set aside for at least 10 minutes. Reserving the pickling liquid, drain the pickled onion.  "},{"img":"\/\/media.blueapron.com\/recipes\/1134\/recipe_steps\/4434\/20150403-2136-13784-2896\/FP_030315_2_20Baked_20Empanadas_20de_20Picadillo_20-_209968_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" In a large bowl, combine the arugula, pickled onion and queso fresco; season with salt and pepper. Add half the reserved pickling liquid and a drizzle of olive oil; toss to combine. Transfer to a serving dish. In a small bowl, combine the sour cream and remaining pickling liquid; season with salt and pepper to taste. Serve the baked empanadas and salad with the sour cream dipping sauce on the side. Enjoy!  "}]}