{"category":"Fish","link":"bbq-salmon-mashed-sweet-potatoes-with-celeriac-apple-slaw","thumb":"\/\/media.blueapron.com\/recipes\/1379\/c_main_dish_images\/20151014-2207-51-3144\/FP_091615_1_R100915_3_SearedBBQSpicedSalmon_20-_206941_high_also_thumb.jpg","title":" BBQ Salmon &amp; Mashed Sweet Potatoes ","subtitle":" with Celeriac-Apple Sauté ","headbg":"\/\/media.blueapron.com\/recipes\/1379\/c_main_dish_images\/20151014-2206-23-7119\/FP_091615_1_R100915_3_SearedBBQSpicedSalmon_20-_206940_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  540    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re celebrating the flavors of fall in this dish, which features a pair of delectable, seasonal sides: rich mashed sweet potatoes and a celeriac-apple saut&eacute;. Once peeled, celeriac&mdash;or celery root&mdash;has plenty of crisp flavor and texture to offer. (Slicing off its tough exterior to create flat sides is an easy way to prep it.) Saut&eacute;ed with tart apple, then finished with salty-sweet pecans, parsley and chives, the celeriac perfectly balances the warm flavors of the salmon&rsquo;s barbecue-style spice rub. ","ingbg":"\/\/media.blueapron.com\/recipes\/1379\/ingredient_images\/20151020-1941-22-3044\/FF-Seared-BBQ-Spiced-Salmon-F-W_large_feature.png","ingredients":[" 4  Skinless Salmon Fillets ","  1  Pound Sweet Potatoes   ","  1  Celeriac   "," 1  Granny Smith Apple "," 1  Bunch Parsley "," 1  Large Bunch Chives "," 2  Tablespoons Butter "," 2  Tablespoons Pecans "," 2  Teaspoons Red Wine Vinegar ","  1  Tablespoon Bbq Salmon Spice Blend (Smoked Sweet Paprika, Sweet Paprika, Ground Fennel Seed, Ground Coriander, Garlic Powder & Light Brown Sugar)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5886\/20151014-2208-65-5375\/FP_091615_1_R100915_3_SearedBBQSpicedSalmon_20-_206934_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and large dice the sweet potatoes. Using a sharp, sturdy knife, peel and small dice the celeriac. Roughly chop the pecans. Pick the parsley leaves off the stems; discard the stems. Cut the chives into &frac12;-inch pieces. Peel, core and small dice the apple; place in a bowl and toss with the vinegar to prevent browning.  "},{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5887\/20150924-2117-59-0836\/FP_091615_1_SearedBBQSpicedSalmon_20-_204032_high_feature.jpg","title":" Cook &amp; mash the sweet potatoes:  ","desc":" Add the sweet potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, add the butter. Using a fork, mash the mixture until you reach your desired consistency. Season with salt and pepper to taste. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5888\/20151014-2207-42-8675\/FP_091615_1_R100915_3_SearedBBQSpicedSalmon_20-_206935_high_feature.jpg","title":" Sauté the celeriac &amp; apple:   ","desc":" While the sweet potatoes cook, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the celeriac; season with salt and pepper. Cook, stirring occasionally, 9 to 11 minutes, or until lightly browned and tender. Add the apple (draining off and discarding any excess vinegar). Cook, stirring occasionally, 2 to 3 minutes, or until slightly tender. Turn off the heat. Add the pecans, parsley and chives. Stir to thoroughly combine; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5889\/20150924-2118-74-0534\/FP_091615_1_SearedBBQSpicedSalmon_20-_204031_high_feature.jpg","title":" Coat the salmon:  ","desc":" While the celeriac and apple cook, place the spice blend on a large plate. Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. Thoroughly coat the seasoned fillets in the spice blend (pressing to adhere).  "},{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5890\/20150924-2118-83-1126\/FP_091615_1_SearedBBQSpicedSalmon_20-_204033_high_feature.jpg","title":" Cook the salmon:  ","desc":" In the pan used to cook the celeriac and apple, heat 1 tablespoon of olive oil on medium-high until hot. Add the coated salmon fillets. Cook 2 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1379\/recipe_steps\/5891\/20151014-2205-18-4170\/FP_091615_1_R100915_3_SearedBBQSpicedSalmon_20-_206936_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the cooked salmon fillets and mashed sweet potatoes between 4 plates. Top with the celeriac-apple saut&eacute;. Enjoy!  "}]}