{"category":"Poultry","link":"blackened-chicken-under-a-brick-with-zucchini-corn-saute-tomato-rice","thumb":"\/\/media.blueapron.com\/recipes\/1322\/c_main_dish_images\/20150811-1913-26-2946\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick-0287-Centered_high_also_thumb.jpg","title":" Blackened Chicken Under a &quot;Brick&quot; ","subtitle":" with Zucchini-Corn Sauté &amp; Tomato Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1322\/c_main_dish_images\/20150811-1852-99-7095\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick-0287_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Cooking chicken under a heavy brick is a wonderful, traditional technique. The pressure ensures uniquely crispy-skinned and succulent results. Here, we&rsquo;re swapping out the brick for a large pot&mdash;and using the technique to blacken our chicken. The spices on the chicken&rsquo;s skin &ldquo;blacken&rdquo; (or char) up against the hot pan, deepening in delicious flavor. On the side, we&rsquo;re serving a summer vegetable saut&eacute; and tomato rice, made by simmering jasmine rice with savory tomato and aromatics. The grains plump up with vibrant flavor and color alike. ","ingbg":"\/\/media.blueapron.com\/recipes\/1322\/ingredient_images\/20150813-1709-16-8152\/FP-spiced-chicken-under-brick-F-W_large_feature.png","ingredients":[" 4  Chicken Quarters "," 1¼  Cups Jasmine Rice "," 4  Cloves Garlic "," 2  Ears Of Corn "," 2  Zucchinis "," 1  Lime "," 1  Large Bunch Cilantro ","  2  Tablespoons Tomato Paste   ","  1½  Tablespoons Tomato Rice Spice Blend (Chipotle Powder, Garlic Powder, Ground Cumin & Dried Thyme)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5680\/20150813-2042-21-5719\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick_20EDIT_20-_200275_high_feature.jpg","title":" Cook the chicken:  ","desc":" Pat the chicken dry with paper towels; season on both sides with salt, pepper and ⅔ of the spice blend. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium until hot. Add the seasoned chicken, skin sides down. Loosely cover the pan with aluminum foil. Fill a large, heavy pot halfway with water; place the pot on top of the foil to press the chicken down. Cook, occasionally pressing down on the pot, 22 to 24 minutes, or until the skins are blackened and crispy. Remove the pot. Flip the chicken and cook 5 to 7 minutes, or until cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5681\/20150813-2042-33-2459\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick-0273_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the chicken cooks, wash and dry the fresh produce. Peel and mince the garlic. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cobs; discard the cobs. Medium dice the zucchini. Quarter the lime. Pick the cilantro leaves off the stems; discard the stems.   "},{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5682\/20150813-2042-45-2381\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick_20EDIT_20-_200274_high_feature.jpg","title":" Cook the aromatics:  ","desc":" While the chicken continues to cook, in a large pot, heat 1 tablespoon of olive oil on medium-high until hot. Add half the garlic and the remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until softened and fragrant. Add the tomato paste. Cook, stirring frequently, 1 to 2 minutes, or until dark red.  "},{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5683\/20150813-2042-57-5153\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick-0277_high_feature.jpg","title":" Make the tomato rice:   ","desc":" Add the rice, a big pinch of salt and 2&frac12; cups of water to the pot of aromatics. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Fluff the tomato rice with a fork. Transfer to a serving dish; set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5684\/20150813-2043-69-7569\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick_20EDIT_20-_200276_high_feature.jpg","title":" Cook the zucchini &amp; corn:  ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond. Heat on medium-high until hot. Add the zucchini, corn and remaining garlic; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until slightly softened and fragrant. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1322\/recipe_steps\/5685\/20150813-2043-86-9252\/FP_2P_072915_4_Spiced_Chicken_Under_A_Brick-0279_high_feature.jpg","title":" Finish &amp; serve your dish:   ","desc":" Top the cooked zucchini and corn with the cooked chicken. Serve with the tomato rice on the side. Garnish with the cilantro and lime wedges. Enjoy!  "}]}