{"category":"Pork","link":"braised-pork-chops-roasted-leeks-with-cherry-gastrique-over-kasha","thumb":"\/\/media.blueapron.com\/recipes\/409\/c_main_dish_images\/20140808-2052-384-2877\/Braised_20Pork_20Chop_20Leeks_20Cherries-2_high_also_thumb.jpg","title":" Braised Pork Chops &amp; Roasted Leeks ","subtitle":" with Cherry Gastrique over Kasha  ","headbg":"\/\/media.blueapron.com\/recipes\/409\/c_main_dish_images\/20140808-2052-384-2877\/Braised_20Pork_20Chop_20Leeks_20Cherries-2_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  695    Per Serving ","time":"You’ll finish this classy dish with a gastrique. Traditionally, this seductive-sounding sauce is a simple reduction of sugar and vinegar. But we weren’t satisfied with simple. Instead of plain old sugar and vinegar, we’re using the natural sweetness of cherries and tang of balsamic to complement the pork and look good doing it. And you won’t just use it as garnish. Finishing these succulent chops directly in the sauce gives them an extra layer of elegant flavor.","desc":" You’ll finish this classy dish with a gastrique. Traditionally, this seductive-sounding sauce is a simple reduction of sugar and vinegar. But we weren’t satisfied with simple. Instead of plain old sugar and vinegar, we’re using the natural sweetness of cherries and tang of balsamic to complement the pork and look good doing it. And you won’t just use it as garnish. Finishing these succulent chops directly in the sauce gives them an extra layer of elegant flavor. ","ingbg":"\/\/media.blueapron.com\/recipes\/409\/ingredient_images\/20140807-2217-1806-5700\/braised-pork-chop-leeks-cherries-ing-WEB_large_feature.png","ingredients":[" 3  Tablespoons Pistachios "," 2  Boneless, Center-Cut Pork Chops "," 2  Leeks "," 1  Bunch Tarragon "," 1  Shallot "," ½  Cup Cherries "," ½  Cup Kasha "," 3  Tablespoons Chicken Demi-Glace "," 1  Tablespoon Balsamic Vinegar "," 1  Tablespoon Dijon Mustard "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2725\/20140723-2055-174-5395\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 500&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Remove the pork chops from the refrigerator to bring to room temperature. Roughly chop the pistachios. Trim off and discard the roots and upper, dark green leaves of the leeks; halve the leeks lengthwise and rinse thoroughly, keeping the layers intact. Pick the tarragon off the stems; discard the stems and roughly chop the tarragon. Peel and mince the shallot. Using the flat side of your knife, smash the cherries then remove and discard the pits; cut the cherries in half.   "},{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2726\/20140723-2055-144-1091\/step2_high_feature.jpg","title":" Roast the leeks:  ","desc":" Line a sheet pan with aluminum foil. Drizzle with olive oil and sprinkle with salt and pepper. Place the leeks onto the sheet pan, cut side down, in a single layer. Rub the cut side of the leeks into the oil to coat. Drizzle the tops of the leeks with olive oil and season with salt and pepper. Tightly cover the leeks with a second piece of aluminum foil and roll the edges to tightly seal. Roast in the oven 22 to 24 minutes, or until the leeks are very tender. Remove from the oven and carefully open the foil (it will release steam).  "},{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2727\/20140723-2056-237-6544\/step3_high_feature.jpg","title":" Cook the kasha:  ","desc":" While the leeks roast, add the kasha to the boiling water and cook 8 to 10 minutes, or until tender. Drain thoroughly and set aside as you continue cooking.   "},{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2728\/20140723-2056-219-0430\/step4_high_feature.jpg","title":" Toast the pistachios:  ","desc":" While the kasha cooks, heat a large, dry pan on medium-high until hot. Add the pistachios and toast, stirring frequently, 2 to 3 minutes, or until lightly browned and fragrant. Transfer the toasted pistachios to a small bowl and set aside as you continue cooking. Wipe out the pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2729\/20140723-2056-180-0767\/step5_high_feature.jpg","title":" Sear the pork chops:  ","desc":" Pat the pork chops dry with paper towels and season with salt and pepper on both sides. In the same pan used to toast the pistachios, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned pork chops and cook 3 to 4 minutes on the first side, or until browned.   "},{"img":"\/\/media.blueapron.com\/recipes\/409\/recipe_steps\/2730\/20140723-2055-276-5458\/step6_high_feature.jpg","title":" Braise the pork &amp; plate your dish:  ","desc":" Turn the pork chops over, add the shallot and cook, stirring frequently, 30 seconds to 1 minute, or until slightly softened. Stir in the chicken demi-glace, mustard, vinegar, cherries, half the tarragon (save the rest for garnish) and &frac12; cup of water. Bring the mixture to a boil, then reduce the heat to medium-low. Simmer, occasionally spooning the liquid over the pork, 3 to 5 minutes, or until the pork is cooked through. To plate your dish, divide the pork chops, roasted leeks and kasha between 2 plates. Top with a couple spoonfuls of the cherry sauce. Garnish with the toasted pistachios and remaining tarragon. Enjoy!   "}]}