{"category":"Vegetarian","link":"butternut-squash-kale-calzones-with-arugula-apple-salad","thumb":"\/\/media.blueapron.com\/recipes\/1382\/c_main_dish_images\/20150917-1535-104-2802\/FP_090915_4_CalzonesWithButternutSquash_20-_200518_high_also_thumb.jpg","title":" Butternut Squash &amp; Kale Calzones ","subtitle":" with Arugula &amp; Apple Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1382\/c_main_dish_images\/20150917-1535-95-2154\/FP_090915_4_CalzonesWithButternutSquash_20-_200517_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this crowd-pleasing meal, we&rsquo;re stuffing calzones with the wonderful, warming flavors of fall. Seasonal butternut squash pairs perfectly with Lacinato kale, an extraordinary variety from Tuscany. Saut&eacute;ed with a little nutmeg, the vegetables combine with melty Fontina cheese to make a delicious and wholesome filling. Our veggie calzones get their authentic, crackling crusts from a sprinkling of semolina flour (an essential Italian ingredient). Dip them in the savory tomato sauce served on the side for the full-flavored experience! ","ingbg":"\/\/media.blueapron.com\/recipes\/1382\/ingredient_images\/20150918-1529-209-7099\/FV-Calzones-Butternut-Squash-F-W_large_feature.png","ingredients":[" 1½  Pounds Plain Pizza Dough "," 1  15-Ounce Can Crushed Tomatoes ","  4  Ounces Fontina Cheese   "," 4  Cloves Garlic "," 3  Ounces Arugula "," 1  Apple "," 1  Lemon ","  1  Pound Butternut Squash   "," 1  Bunch Lacinato Kale "," 2  Tablespoons Semolina Flour "," ½  Cup Grated Parmesan Cheese "," 1  Teaspoon Calzone Spice Blend (Italian Seasoning & Ground Nutmeg) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5735\/20150918-1532-21-4833\/FP_090915_4_CalzonesWithButternutSquash_20-_200508_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut off and discard both ends of the squash; peel the squash, then separate the neck and bulb. Halve the bulb lengthwise; remove and discard the pulp and seeds, then medium dice. Remove and discard the kale stems; roughly chop the leaves. Peel and mince the garlic. Cut off and discard the rind of the Fontina cheese; medium dice. Quarter and deseed the lemon. Core the apple and cut into matchsticks; toss with the juice of 1 lemon wedge.     "},{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5736\/20150918-1533-27-4737\/FP_090915_4_CalzonesWithButternutSquash_20-_200509_high_feature.jpg","title":" Make the filling:   ","desc":" In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the squash; season with salt and pepper. Cook, stirring occasionally, 8 to 10 minutes, or until browned and tender. Add the kale, spice blend and half the garlic; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the kale has wilted. Add ⅓ of the tomatoes. Cook, stirring frequently, 30 seconds to 1 minute, or until well combined. Transfer to a large bowl; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5737\/20150918-1533-33-9244\/FP_090915_4_CalzonesWithButternutSquash_20-_200510_high_feature.jpg","title":" Assemble the calzones:  ","desc":" Sprinkle a big pinch of the flour onto a clean, dry work surface. Divide the dough into 4 equal-sized portions. Using your hands, stretch out each portion into a &frac14;-inch-thick round. Divide the filling (you may have extra) between the rounds. Top with the Fontina cheese and half the Parmesan cheese; season with salt and pepper. Fold each round in half over the filling. Using your fingers or a fork, press or crimp the edges of the dough to seal the calzones.  "},{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5738\/20150918-1533-39-2327\/FP_090915_4_CalzonesWithButternutSquash_20-_200512_high_feature.jpg","title":" Bake the calzones:  ","desc":" Sprinkle the remaining flour on a large sheet pan. Carefully place the calzones on the prepared sheet pan; lightly drizzle or brush the tops with olive oil. Bake 16 to 18 minutes, or until browned on top. Remove from the oven and let stand for at least 5 minutes. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5739\/20150918-1533-45-7511\/FP_090915_4_CalzonesWithButternutSquash_20-_200511_high_feature.jpg","title":" Make the tomato sauce:  ","desc":" While the calzones bake, in the pan used to make the filling, heat 2 teaspoons of olive oil on medium until hot. Add the remaining garlic. Cook, stirring frequently, 30 seconds to 1 minute, or until lightly browned and fragrant. Add the remaining tomatoes. Cook, stirring occasionally, 2 to 4 minutes, or until thoroughly combined; season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1382\/recipe_steps\/5740\/20150918-1533-57-1690\/FP_090915_4_CalzonesWithButternutSquash_20-_200513_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" To make the dressing, in a bowl, combine the remaining Parmesan cheese and the juice of the remaining lemon wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. In a large bowl, combine the arugula and apple. Add as much of the dressing as you&rsquo;d like (you may have extra). Toss to thoroughly coat; season with salt and pepper to taste. Transfer to a serving dish. Serve the baked calzones with the salad and tomato sauce on the side. Enjoy!  "}]}