{"category":"Vegetarian","link":"cajun-tofu-dirty-rice-with-crispy-okra-green-bell-pepper","thumb":"\/\/media.blueapron.com\/recipes\/1320\/c_main_dish_images\/20150806-1817-165-1506\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209776_high_also_thumb.jpg","title":" Cajun Tofu &amp; Dirty Rice ","subtitle":" with Crispy Okra &amp; Bell Pepper ","headbg":"\/\/media.blueapron.com\/recipes\/1320\/c_main_dish_images\/20150806-1817-61-9877\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209775_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  575    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Dirty rice is a hallmark of cooking in the American South. It&rsquo;s made by simmering rice with ingredients like spices and aromatics (typically onion, celery and bell pepper), which deliciously infuse it and alter its color. In our Cajun-inspired version, we&rsquo;re adding tofu and okra. Though it&rsquo;s often used as a thickener to add body to jambalayas and stews, okra is amazingly versatile. Here, we&rsquo;re tossing it with rice flour, which clings to it, creating a natural batter. Quickly pan-frying the okra toasts the flour&mdash;adding crispy texture and authentic flavor to this classic. ","ingbg":"\/\/media.blueapron.com\/recipes\/1320\/ingredient_images\/20150811-1622-127-5514\/V3-blackened-tofu-dirty-rice-2P-W_large_feature.png","ingredients":[" 1  14-Ounce Package Extra Firm Tofu "," 1  15-Ounce Can Diced Tomatoes "," ¼  Cup Rice Flour "," 1¼  Cups Long Grain White Rice "," 3  Scallions ","  2  Stalks Celery   "," 1  Green Bell Pepper "," 1  Yellow Onion ","  ¼  Pound Okra   "," 1  Tablespoon Cajun Spice Blend (Smoked Paprika, Ground Yellow Mustard, Onion Powder, Garlic Powder, Dried Oregano, Dried Thyme & Cayenne Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5570\/20150806-1936-63-3056\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209763_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Drain the tofu and pat dry with paper towels; large dice. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops. Small dice the celery. Cut out and discard the stem, ribs and seeds of the bell pepper; medium dice. Peel and small dice the onion. Trim off and discard the okra stems; cut into 1-inch pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5571\/20150806-1936-74-8647\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209764_high_feature.jpg","title":" Start the dirty rice:  ","desc":" In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the onion, celery, bell pepper, white bottoms of the scallions and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5572\/20150806-1936-85-5012\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209772_high_feature.jpg","title":" Finish the dirty rice:  ","desc":" Add the rice, diced tomatoes, 1 cup of water and a big pinch of salt to the pot of vegetables. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 14 to 16 minutes, or until the water has been absorbed and the rice is tender. Remove from heat. Fluff the finished rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5573\/20150806-1937-100-6605\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209767_high_feature.jpg","title":" Coat the tofu &amp; okra:  ","desc":" While the rice cooks, in a large bowl, combine the tofu, 2\/3 of the rice flour and 2\/3 of the remaining spice blend. Season with salt and pepper; toss to thoroughly coat. Set aside. In a medium bowl, combine the okra and remaining rice flour and spice blend. Season with salt and pepper; toss to thoroughly coat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5574\/20150806-1937-111-3896\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209769_high_feature.jpg","title":" Cook the tofu:  ","desc":" While the rice continues to cook, in a large pan (nonstick, if you have one), heat a thin layer of oil on medium until hot. Add the coated tofu and cook, stirring frequently, 9 to 11 minutes, or until browned and crispy on all sides. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1320\/recipe_steps\/5575\/20150806-1937-122-1995\/2P_071515_3_BlackenedTofuSouthernDirtyRice_20-_209771_high_feature.jpg","title":" Cook the okra &amp; plate your dish:  ","desc":" In the pan used to cook the tofu, heat 2 teaspoons of olive oil on medium-high until hot. Add the coated okra. Cook, stirring frequently, 2 to 4 minutes, or until lightly browned and crispy. Transfer to a paper towel-lined plate and season immediately with salt and pepper. Divide the finished dirty rice between 2 dishes. Top with the cooked tofu and cooked okra. Garnish with the green tops of the scallions. Enjoy!  "}]}