{"category":"Shellfish","link":"cajun-shrimp-cheesy-grits-with-collard-greens-green-tomato-chutney","thumb":"\/\/media.blueapron.com\/recipes\/1355\/c_main_dish_images\/20150908-2006-48-1929\/FP_090115_4_ShrimpAndGrits_20-_200070_high_also_thumb.jpg","title":" Cajun Shrimp &amp; Cheesy Grits  ","subtitle":" with Collard Greens &amp; Green Tomato Chutney  ","headbg":"\/\/media.blueapron.com\/recipes\/1355\/c_main_dish_images\/20150908-2005-39-1716\/FP_090115_4_ShrimpAndGrits_20-_200069_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  590    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Traditional Indian chutney is a spicy, sweet and tart condiment, whose intensity is perfect for balancing milder flavors. In the American South, chutney recipes have swapped in locally popular spices (including paprika, oregano and thyme)&mdash;and turned the sweetness up a notch. Here, we&rsquo;re serving Cajun-spiced shrimp and cheesy grits (a classic Southern pairing) with a chutney of tart green tomato, or tomato harvested early. Made with onion, raisins and brown sugar, this chutney tops off the dish with delicious complexity. ","ingbg":"\/\/media.blueapron.com\/recipes\/1355\/ingredient_images\/20150910-2014-196-8616\/FF-Shrimp-Grits-F-W_large_feature.png","ingredients":[" 1⅛  Pounds Shrimp ","  1¼  Cups Yellow Grits   "," 4  Ounces Monterey Jack Cheese "," 1  Bunch Collard Greens ","  1  Green Tomato   "," 1  Yellow Onion ","  1  Ounce Pea Shoots   "," 2  Tablespoons Butter "," 2  Tablespoons Golden Raisins "," 1  Tablespoon Light Brown Sugar "," 1  Tablespoon Cajun Spice Blend (Smoked Sweet Paprika, Mustard Powder, Onion Powder, Garlic Powder, Dried Oregano, Dried Thyme & Cayenne Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5661\/20150910-2014-205-6092\/FP_090115_4_ShrimpAndGrits_20-_200052_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. In a medium pot, combine 5 cups of water and a big pinch of salt; heat to boiling on high. Grate the cheese. Core and medium dice the tomato. Peel and small dice the onion. Remove and discard the collard green stems; slice the leaves into 1-inch-wide strips.   "},{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5662\/20150910-2014-210-7036\/FP_090115_4_ShrimpAndGrits_20-_200055_high_feature.jpg","title":" Make the cheesy grits:  ","desc":" Slowly add the grits to the pot of boiling water, whisking to break up any clumps. Reduce the heat to low. Simmer, whisking occasionally, 10 to 12 minutes, or until thickened. (If the grits seem dry, gradually add up to &frac14; cup of water to achieve your desired consistency.) Remove from heat. Add the cheese and butter. Whisk until thoroughly combined; season with salt and pepper to taste. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5663\/20150910-2014-215-7953\/FP_090115_4_ShrimpAndGrits_20-_200053_high_feature.jpg","title":" Make the chutney:  ","desc":" While the grits cook, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the tomato, half the onion and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until slightly softened. Add the raisins, brown sugar and 1 tablespoon of water. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined and the sugar has dissolved; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Carefully rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5664\/20150910-2014-224-2456\/FP_090115_4_ShrimpAndGrits_20-_200056_high_feature.jpg","title":" Cook the collard greens:  ","desc":" In the pan used to make the chutney, heat 1 tablespoon of olive oil on medium-high until hot. Add the collard greens, remaining onion and &frac14; cup of water; season with salt and pepper. Cook, stirring occasionally, 5 to 7 minutes, or until the collard greens have wilted and the onion has softened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5665\/20150910-2015-229-1972\/FP_090115_4_ShrimpAndGrits_20-_200057_high_feature.jpg","title":" Add the shrimp:  ","desc":" Add the shrimp and remaining spice blend to the pan of collard greens; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the shrimp are opaque and cooked through; Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1355\/recipe_steps\/5666\/20150910-2015-238-6439\/FP_090115_4_ShrimpAndGrits_20-_200058_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Divide the cheesy grits between 4 dishes. Top with the cooked collard greens and shrimp. Garnish with the chutney and pea shoots. Enjoy!  "}]}