{"category":"Poultry","link":"chicken-with-tomato-fennel-creamy-tarragon-sauce","thumb":"\/\/media.blueapron.com\/recipes\/254\/c_main_dish_images\/20150928-2043-74-7897\/2P_082515_2_R_092514_5_ChickenCutletsWithCaramelizedFennel_20-_204541_high_also_thumb.jpg","title":" Seared Chicken &amp; Caramelized Fennel ","subtitle":" with Jasmine Rice &amp; Roasted Cherry Tomatoes ","headbg":"\/\/media.blueapron.com\/recipes\/254\/c_main_dish_images\/20150928-2042-69-7321\/2P_082515_2_R_092514_5_ChickenCutletsWithCaramelizedFennel_20-_204539_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" To make a delicious, seasonal sauce for rice and pan-seared chicken, we&rsquo;re caramelizing fennel and onion. Both of these aromatic vegetables are naturally sweet, and when cooked slowly (with frequent stirring, to prevent burning), their sugars caramelize, or turn richly flavorful and brown. We&rsquo;re using this mixture as the base of the sauce, made with sherry vinegar and a little butter. Topped with roasted, thyme-infused cherry tomatoes and served over jasmine rice, this meal brings fine dining right into your kitchen. ","ingbg":"\/\/media.blueapron.com\/recipes\/254\/ingredient_images\/20150929-1738-14-8797\/P-Chicken-Cutlets-Caramelized-Fennel-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Cutlets "," ½  Cup Jasmine Rice "," 3  Ounces Cherry Tomatoes "," 2  Cloves Garlic "," 1  Yellow Onion ","  1  Bulb Fennel   "," 1  Bunch Thyme "," 2  Tablespoons All-Purpose Flour ","  1  Tablespoon Sherry Vinegar   "," 2  Tablespoons Butter "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2634\/20150928-2121-54-4983\/2P_082515_2_R_092514_5_ChickenCutletsWithCaramelizedFennel_20-_204534_high_feature.jpg","title":" Prepare the ingredients  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Peel and mince the garlic. Pick half the thyme leaves off the stems; discard the stems. Leave the remaining thyme sprigs whole. Cut off and discard any fennel stems; thinly slice the bulb. Peel, halve and thinly slice the onion.  "},{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2635\/20150827-2105-268-5514\/2P_082515_2_ChickenCutletsWithCaramelizedFennel_20-_203872_high_feature.jpg","title":" Coat &amp; cook the chicken  ","desc":" Place the flour on a plate. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Coat both sides of the seasoned chicken in the flour (shaking off any excess). In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the coated chicken. Cook 4 to 5 minutes per side, or until golden brown and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2637\/20150827-2105-273-2631\/2P_082515_2_ChickenCutletsWithCaramelizedFennel_20-_203874_high_feature.jpg","title":" Cook the rice:  ","desc":" While the chicken cooks, in a small pot, combine the rice, 1 cup of water and a big pinch of salt. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Fluff the cooked rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2638\/20150928-2121-63-6136\/2P_082515_2_R_092514_5_ChickenCutletsWithCaramelizedFennel_20-_204535_high_feature.jpg","title":" Roast the tomatoes:  ","desc":" While the rice cooks, place the tomatoes and whole thyme sprigs on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Roast in the oven 6 to 8 minutes, or until the tomatoes have softened. Remove from the oven. Carefully discard the thyme sprigs.  "},{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2636\/20150928-2122-77-4954\/2P_082515_2_ChickenCutletsWithCaramelizedFennel_20-_203876_high_feature.jpg","title":" Caramelize the fennel &amp; onion:  ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond; heat on medium-high until hot. Add the fennel and onion; season with salt and pepper. Cook, stirring frequently, 11 to 13 minutes, or until completely softened and browned.  "},{"img":"\/\/media.blueapron.com\/recipes\/254\/recipe_steps\/2639\/20150928-2121-72-1678\/2P_082515_2_R_092514_5_ChickenCutletsWithCaramelizedFennel_20-_204536_high_feature.jpg","title":" Finish the chicken &amp; plate your dish:  ","desc":" Reduce the heat to medium and add the garlic to the pan of caramelized fennel and onion. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Stir in the vinegar, butter and &frac14; cup of water; season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until well combined. Add the cooked chicken (and any juices from the plate) and half the chopped thyme. Cook, stirring occasionally, 1 to 2 minutes, or until well combined. (If the sauce seems dry, add 2 tablespoons of water.) Remove from heat. Divide the cooked rice and finished chicken between 2 dishes. Garnish with the roasted tomatoes and remaining chopped thyme. Enjoy!   "}]}