{"category":"Poultry","link":"chicken-tinga-tacos-with-elote-style-corn-tomatillo-salsa","thumb":"\/\/media.blueapron.com\/recipes\/1306\/c_main_dish_images\/20150824-1655-73-1751\/FP_072215_3_ChickenTingaTacos_20-_209892_20EDIT_high_also_thumb.jpg","title":" Chicken Tinga Tacos ","subtitle":" with Tomatillo Salsa &amp; Mexican-Style Corn on the Cob ","headbg":"\/\/media.blueapron.com\/recipes\/1306\/c_main_dish_images\/20150824-1655-68-8080\/FP_072215_3_ChickenTingaTacos_20-_209891_20EDIT_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  660    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In Mexican cuisine, &ldquo;tinga de pollo&rdquo; (or chicken tinga) is a popular dish of shredded chicken in a spiced sauce. Here, we&rsquo;re cooking up a savory, tomatillo-based salsa with Mexican oregano, ancho chile powder and more. And we&rsquo;re wrapping corn tortillas around our chicken tinga to make delicious tacos. Feel free to customize each taco however you&rsquo;d like&mdash;there&rsquo;s an array of tasty ingredients to choose from! On the side, we&rsquo;re serving another flavorful and traditional Mexican preparation: corn on the cob dressed with sour cream, Cotija cheese and spices. ","ingbg":"\/\/media.blueapron.com\/recipes\/1306\/ingredient_images\/20150824-1655-63-5928\/FP-chicken-tinga-tacos-F-W_large_feature.png","ingredients":[" 4  Boneless, Skinless Chicken Breasts "," 8  Corn Tortillas "," 3  Cloves Garlic ","  2  Ears Of Corn   "," 2  Limes "," 1  Red Onion ","  ½  Pound Tomatillos   "," 1  Large Bunch Cilantro "," ½  Cup Sour Cream "," ⅓  Cup Grated Cotija Cheese ","  1  Tablespoon Chicken Tinga Spice Blend (Ground Cumin, Ground Mexican Oregano, Ancho Chile Powder & Ground Coriander)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5509\/20150824-1656-88-5262\/FP_072215_3_ChickenTingaTacos_20-_209880_20EDIT_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Preheat the oven to 400&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Peel and thinly slice the garlic. Peel, halve and thinly slice the onion. Remove and discard the papery husks of the tomatillos; medium dice the tomatillos. Remove and discard the husks and silks of the corn; cut each cob into thirds. Pick the cilantro leaves off the stems; discard the stems. Quarter the limes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5510\/20150730-1935-64-9159\/FP_072215_3_ChickenTingaTacos_20-_209881_high_feature.jpg","title":" Cook &amp; shred the chicken:   ","desc":" Pat the chicken dry with paper towels; season on both sides with salt, pepper and (reserving a big pinch) as much of the spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned chicken. Cook, loosely covering the pan with aluminum foil, 4 to 6 minutes per side, or until browned and cooked through. Transfer to a cutting board, leaving any browned bits (or fond) in the pan. When cool enough to handle, using 2 forks, shred the cooked chicken into bite-sized pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5511\/20150730-1935-75-4033\/FP_072215_3_ChickenTingaTacos_20-_209882_high_feature.jpg","title":" Make the salsa:  ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond; heat on medium until hot. Add the garlic and onion; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the tomatillos and ⅔ cup of water; season with salt and pepper. Cook, occasionally smashing the tomatillos with a spoon, 11 to 13 minutes, or until thickened and saucy.   "},{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5512\/20150730-1935-86-6775\/FP_072215_3_ChickenTingaTacos_20-_209885_high_feature.jpg","title":" Warm the tortillas:   ","desc":" While the salsa cooks, stack the tortillas on a large piece of foil; tightly wrap the foil around the tortillas. Place directly on the oven rack (or on a sheet pan). Warm in the oven 8 to 10 minutes, or until heated through. Remove from the oven. Just before serving, carefully unwrap the warmed tortillas and transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5513\/20150824-1656-93-0731\/FP_072215_3_R_081915_2_ChickenTingaTacos_20-_201119_high_feature.jpg","title":" Cook &amp; dress the corn:  ","desc":" While the tortillas warm, add the corn to the pot of boiling water. Cook 2 to 3 minutes, or until tender and bright yellow. Drain thoroughly; set aside to cool slightly. Just before serving, divide half the sour cream, half the cheese and as much of the remaining spice blend as you&rsquo;d like between the cobs; season with salt and pepper to taste. Transfer to a serving dish. Garnish with &frac14; of the cilantro.  "},{"img":"\/\/media.blueapron.com\/recipes\/1306\/recipe_steps\/5514\/20150730-1936-116-5209\/FP_072215_3_ChickenTingaTacos_20-_209884_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Add the shredded chicken to the pan of salsa; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until thoroughly combined and heated through. Turn off the heat. Stir in the juice of 4 lime wedges; season with salt and pepper to taste. Transfer to a serving dish. Serve with the warmed tortillas, dressed corn and remaining sour cream, cheese, cilantro and lime wedges on the side. Enjoy!  "}]}