{"category":"Beef","link":"chinese-five-spice-meatballs-with-snow-peas-jasmine-rice","thumb":"\/\/media.blueapron.com\/recipes\/1176\/c_main_dish_images\/20150507-1534-390-6882\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203016_high_also_thumb.jpg","title":" Chinese Five-Spice Meatballs ","subtitle":" with Snow Peas &amp; Jasmine Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1176\/c_main_dish_images\/20150507-1522-160-9475\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203014_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  540    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Meatballs have been enjoyed in China for millennia. Some recipes date all the way back to the Qin Dynasty in the 3rd Century BCE. They&rsquo;re usually made with flour, which acts as a binding agent, helping the meatballs to hold their shape. We&rsquo;re swapping in crispy panko breadcrumbs instead (for added texture), and we&rsquo;re flavoring the meat with five-spice powder and traditional aromatics before coating it in a sweet and savory duet of sauces. Lastly, for an herbaceous touch and a subtle crunch, we&rsquo;re garnishing the finished meatballs with cilantro, sesame seeds and scallions. ","ingbg":"\/\/media.blueapron.com\/recipes\/1176\/ingredient_images\/20150526-1747-1531-0646\/five-spice-niu-wan-fp-w_large_feature.png","ingredients":[" 1  Pound Ground Beef "," 1  Cup Jasmine Rice "," 6  Ounces Snow Peas "," 3  Cloves Garlic "," 3  Scallions "," 1  Large Bunch Cilantro "," 2  Tablespoons Black Bean Garlic Sauce "," 2  Teaspoons Black & White Sesame Seeds "," 2  Teaspoons Chinese Five-Spice Powder "," 1  1-Inch Piece Ginger ","  ¼  Cup Panko Breadcrumbs   "," ¼  Cup Soy Glaze "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4752\/20150507-1535-409-4538\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_202999_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Snap off and discard the stem end of each snow pea; pull off and discard the tough string that runs the length of the pod. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions; thinly slice the scallions on an angle, separating the white bottoms and green tops. Pick the cilantro leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4753\/20150507-1535-420-0770\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203001_high_feature.jpg","title":" Cook the rice:  ","desc":" In a medium pot, heat the rice, a big pinch of salt and 2 cups of water to boiling on high. Once boiling, reduce the heat to low. Cover and simmer 11 to 13 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork. Transfer to a serving dish and set aside   in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4754\/20150507-1535-431-4580\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203000_high_feature.jpg","title":" Cook the aromatics:  ","desc":" While the rice cooks, in a large pan (nonstick, if you have one), heat 1 tablespoon of oil on medium-high until hot. Add the white bottoms of the scallions, half the garlic and half the ginger; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until lightly browned and fragrant. Transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4755\/20150507-1536-446-6526\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203002_high_feature.jpg","title":" Form &amp; brown the meatballs:  ","desc":" While the rice continues to cook, add the breadcrumbs, ground beef and five-spice powder to the bowl of cooked aromatics; season with salt and pepper. Mix until just combined. Using your hands, form the mixture into 16 to 18 meatballs, each slightly smaller than a golf ball. In the pan used to cook the aromatics, heat 1 tablespoon of oil on medium-high until hot. Add the meatballs. Cook, stirring occasionally, 4 to 6 minutes, or until browned on all sides and cooked through. Turn off the heat. Carefully drain off and discard the drippings.  "},{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4756\/20150507-1541-698-9647\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203003_high_feature.jpg","title":" Finish the meatballs:  ","desc":" Add the black bean garlic sauce, soy glaze and &frac14; cup of water to the pan of browned meatballs; stir to combine. Cook on medium-high, occasionally spooning the sauce over the meatballs, 3 to 5 minutes, or until the sauce is slightly reduced in volume and the meatballs are thoroughly coated. Transfer to a serving dish. Rinse and wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1176\/recipe_steps\/4757\/20150507-1536-461-7839\/FP_040215_4_20Five-Spice_20Niu_20Wan_20with_20Snow_20Peas_20__20Jasmine_20Rice_20-_203004_high_feature.jpg","title":" Cook the snow peas &amp; serve your dish:  ","desc":" In the pan used to finish the meatballs, heat 1 tablespoon of oil on medium-high until hot. Add the snow peas and remaining garlic and ginger; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the snow peas are bright green. Transfer to a serving dish. Garnish the finished meatballs and cooked rice with the green tops of the scallions. Garnish the meatballs with the cilantro and half the sesame seeds. Garnish the cooked snow peas with the remaining sesame seeds. Enjoy!  "}]}