{"category":"Vegetarian","link":"creamy-broccoli-fennel-casserole-with-mafalda-pasta-fontina-cheese","thumb":"\/\/media.blueapron.com\/recipes\/1351\/c_main_dish_images\/20150908-2100-32-1540\/2P_090215_4_Broccoli_FennelCasserole-0265_high_also_thumb.jpg","title":" Creamy Broccoli &amp; Fennel Casserole ","subtitle":" with Mafalda Pasta &amp; Fontina Cheese ","headbg":"\/\/media.blueapron.com\/recipes\/1351\/c_main_dish_images\/20150908-2059-21-4383\/2P_090215_4_Broccoli_FennelCasserole-0264_splash_feature.jpg","portions":" Makes:  3 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Mafalda pasta, with its curly, ribbon-like edges, is ideal for holding onto sauces. It&rsquo;s among a small group of pastas that were dedicated to the House of Savoy when the family became the ruling monarchs of Italy at the turn of the 20th Century. Also called reginette, or &ldquo;little queens,&rdquo; mafalda is named for Princess Mafalda&mdash;and its crinkled edges make it the perfect choice for clinging onto the rich Fontina cheese and b&eacute;chamel sauce we&rsquo;re using in this casserole. Cooked with one of our favorite fall aromatics, fennel, this dish is a warming, gourmet spin on Italian comfort food. ","ingbg":"\/\/media.blueapron.com\/recipes\/1351\/ingredient_images\/20151006-1748-54-6566\/Broccoli-Fennel-Casserole-2P-W_large_feature.png","ingredients":[" 8  Ounces Mafalda Pasta "," 4  Ounces Fontina Cheese "," ¾  Cup Low-Fat Milk "," 2  Cloves Garlic ","  1  Bulb Fennel   "," 1  Lemon "," ½  Pound Broccoli "," 3  Tablespoons All-Purpose Flour "," ½  Cup Panko Breadcrumbs "," ¼  Cup Grated Pecorino Cheese "," 1  Tablespoon Creamy Casserole Spice Blend (Ground Yellow Mustard, Ground Fennel Seeds & Ground Bay Leaves) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5705\/20150908-2144-39-5737\/2P_090215_4_Broccoli_FennelCasserole-0257_high_feature.jpg","title":" Cook the pasta  ","desc":" Preheat the oven to 450&deg;F. Heat a large pot of salted water to boiling on high. Once boiling, add the pasta. Cook 13 to 15 minutes, or until al dente (still slightly firm to the bite). Reserving 1&frac12; cups of the pasta cooking water, drain thoroughly. Rinse and dry the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5706\/20150908-2144-44-7721\/2P_090215_4_Broccoli_FennelCasserole-0256_high_feature.jpg","title":" Prepare the ingredients  ","desc":" While the pasta cooks, wash and dry the fresh produce. Peel and mince the garlic. Cut off and discard the fennel stems; small dice the bulb. Using a peeler, remove the rind of the lemon, avoiding the pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Cut the broccoli into small florets. Cut off and discard the rind of the Fontina cheese; small dice.  "},{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5707\/20150908-2144-49-7290\/2P_090215_4_Broccoli_FennelCasserole-0258_high_feature.jpg","title":" Cook the aromatics  ","desc":" In the pot used to cook the pasta, heat 2 teaspoons of olive oil on medium-high until hot. Add the garlic and fennel; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5708\/20150908-2144-54-7478\/2P_090215_4_Broccoli_FennelCasserole-0259_high_feature.jpg","title":" Make the béchamel sauce &amp; add the broccoli  ","desc":" Add the flour, spice blend and 1 tablespoon of olive oil to the pot of aromatics. Cook, stirring frequently, 1 to 2 minutes, or until the flour is golden and the spices are fragrant. Add the milk and reserved pasta cooking water; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until thoroughly combined and slightly thickened. Add the broccoli, Fontina cheese and lemon zest; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the broccoli is tender and the sauce has thickened. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5709\/20150908-2144-68-3348\/2P_090215_4_Broccoli_FennelCasserole-0260_high_feature.jpg","title":" Finish the filling &amp; assemble the casserole  ","desc":" Off the heat, stir the cooked pasta into the pot of vegetables and b&eacute;chamel sauce; season with salt and pepper to taste. Transfer the finished filling to a baking dish. In a medium bowl, combine the breadcrumbs and pecorino cheese. Stir in the juice of all 4 lemon wedges and enough olive oil to moisten the mixture; season with salt and pepper to taste. Evenly top the casserole with the breadcrumb-pecorino cheese mixture.  "},{"img":"\/\/media.blueapron.com\/recipes\/1351\/recipe_steps\/5710\/20150908-2144-73-5041\/2P_090215_4_Broccoli_FennelCasserole-0261_high_feature.jpg","title":" Bake the casserole &amp; serve your dish:  ","desc":" Place the assembled casserole in the oven and bake 10 to 12 minutes, or until golden brown and slightly crispy on top. Remove from the oven and let stand for 2 minutes before serving. Enjoy!  "}]}