{"category":"Fish","link":"crispy-cod-roasted-fingerlings-with-summer-beans-garlic-lemon-aioli","thumb":"\/\/media.blueapron.com\/recipes\/1297\/c_main_dish_images\/20150814-2110-38-5186\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209820_GreenBeansOnly_high_also_thumb.jpg","title":" Crispy Catfish &amp; Roasted Potatoes ","subtitle":" with Summer Bean Salad &amp; Garlic-Lemon Aioli ","headbg":"\/\/media.blueapron.com\/recipes\/1297\/c_main_dish_images\/20150814-2110-26-3990\/FP_071515_5_CrispyFish_RoastedPotatoes-_209819_GreenBeansOnly_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  595    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this wholesome dish, we&rsquo;re serving up crispy, pan-seared catfish with a side of specialty potatoes, lightly seasoned and roasted for equally crispy texture. And for a second side, we&rsquo;re making a salad of quick-cooked summer beans, dressed with creamy aioli (a classic condiment in seafood dishes). Kalamata olives add a deliciously briny touch to the complex, summery flavors of this dish. ","ingbg":"\/\/media.blueapron.com\/recipes\/1297\/ingredient_images\/20150824-1512-22-1305\/FF-crispy-fish-roasted-potatoes-F-W-Green_large_feature.png","ingredients":[" 4  Catfish Fillets "," 2  Cloves Garlic "," 1  Pound Prince Of Orange Potatoes "," 1  Lemon "," 6  Ounces Summer Beans "," 1  Large Bunch Parsley "," 2  Ounces Kalamata Olives "," ½  Cup Mayonnaise "," ¼  Cup All-Purpose Flour ","  1  Tablespoon Crispy Catfish Spice Blend (Onion Powder, Garlic Powder, Smoked Sweet Paprika & Dried Oregano)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5460\/20150814-2113-107-3578\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209800_GreenBeansOnly_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut the potatoes into bite-sized pieces. Trim off and discard the stem ends of the beans. Peel and mince the garlic; smash with the flat side of your knife until it resembles a paste (or use a zester). Quarter and deseed the lemon. Using the flat side of your knife, smash the olives; remove and discard the pits. Roughly chop the olives. Pick the parsley leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5461\/20150724-2014-33-8725\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209809_high_feature.jpg","title":" Roast the potatoes:   ","desc":" Place the potatoes on a sheet pan. Drizzle with olive oil; season with salt, pepper and half the spice blend. Toss to thoroughly coat. Arrange in a single, even layer, cut sides down. Roast 24 to 26 minutes, or until lightly browned and tender when pierced with a fork. Remove from the oven.   "},{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5462\/20150814-2113-118-3278\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209803_GreenBeansOnly_high_feature.jpg","title":" Blanch the beans:   ","desc":" While the potatoes roast, add the beans to the pot of boiling water. Cook 3 to 5 minutes, or until slightly tender. Drain thoroughly; rinse under cold water for 30 seconds to 1 minute to stop the cooking process. Pat the blanched beans dry with paper towels. Transfer to a medium bowl.  "},{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5463\/20150724-2013-21-2837\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209808_high_feature.jpg","title":" Coat &amp; cook the catfish:  ","desc":" While the potatoes continue to roast, place the flour and remaining spice blend on a plate; stir to combine and season with salt and pepper. Pat the catfish fillets dry with paper towels; season on both sides with salt and pepper. Coat both sides of the seasoned fillets in the flour-spice blend mixture (tapping off any excess). In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the coated fillets. Cook 2 to 3 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt.  "},{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5464\/20150814-2113-129-3088\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209804_GreenBeansOnly_high_feature.jpg","title":" Make the aioli &amp; dress the beans:  ","desc":" While the catfish cooks, in a small bowl, combine the mayonnaise, garlic paste and the juice of all 4 lemon wedges; season with salt and pepper to taste. To the bowl of blanched beans, add the olives and ⅓ of the aioli. Toss to thoroughly coat; season with salt and pepper to taste. Transfer the dressed beans and remaining aioli to 2 separate serving dishes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1297\/recipe_steps\/5465\/20150814-2113-149-9257\/FP_071515_5_CrispyFish_RoastedPotatoes_20-_209810_GreenBeansOnly_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Transfer the cooked catfish fillets and roasted potatoes to a serving dish. Garnish the catfish fillets, potatoes and dressed beans with the parsley. Serve with the remaining aioli on the side. Enjoy!  "}]}