{"category":"Fish","link":"crispy-curried-catfish-with-chana-masala-basmati-rice","thumb":"\/\/media.blueapron.com\/recipes\/1358\/c_main_dish_images\/20150917-1534-77-6704\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200642_high_also_thumb.jpg","title":" Crispy Curried Catfish ","subtitle":" with Chana Masala &amp; Brown Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1358\/c_main_dish_images\/20150917-1533-68-5828\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200641_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chana masala&mdash;a traditional Indian curry with a hint of tartness&mdash;puts the spotlight on an incredible legume. That&rsquo;s the chickpea, subtle in flavor and creamy in texture. Our take on chana masala combines chickpeas, spinach and pea shoots in a well-balanced broth of potent spices and tart tomato. What&rsquo;s more, we&rsquo;re serving our curry under pan-fried catfish fillets, spiced and dredged (for a deliciously crispy touch) in chickpea flour. Brown rice and a cilantro garnish round out this satisfying meal. ","ingbg":"\/\/media.blueapron.com\/recipes\/1358\/ingredient_images\/20150918-1526-103-8280\/FF-Curried-Catfish-Chana-Masala-F-W_large_feature.png","ingredients":[" 4  Catfish Fillets "," 1  Cup Brown Rice "," 1½  Cups Chickpeas ","  2  Ounces Pea Shoots   "," 1  Yellow Onion "," ½  Pound Spinach "," 1  Bunch Cilantro ","  2  Tablespoons Tomato Paste   "," ¼  Cup Chickpea Flour ","  1½  Tablespoons Curried Catfish Spice Blend (Madras Curry Powder, Nigella Seeds, Mustard Seeds & Ground Ginger)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5741\/20150918-1527-152-4438\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200632_high_feature.jpg","title":" Cook the rice:  ","desc":" In a medium pot, combine the rice, a big pinch of salt and 2 cups of water; heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 28 to 30 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5742\/20150918-1528-157-9278\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200630_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Peel and small dice the onion. Drain and rinse the chickpeas. Pick the cilantro leaves off the stems; discard the stems.   "},{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5743\/20150918-1528-171-8000\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200631_high_feature.jpg","title":" Cook &amp; drain the spinach:  ","desc":" While the rice continues to cook, in a large pan (nonstick, if you have one), heat 1 tablespoon of oil on medium until hot. Add the spinach; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5744\/20150918-1528-176-3413\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200636_high_feature.jpg","title":" Make the chana masala:   ","desc":" In the pan used to cook the spinach, heat 2 teaspoons of oil on medium-high until hot. Add the onion and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the tomato paste; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until dark red. Add the chickpeas, drained spinach, pea shoots and &frac12; cup of water; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until thoroughly combined and the liquid is slightly reduced in volume. Transfer to a bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5745\/20150918-1528-190-2679\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200637_high_feature.jpg","title":" Coat &amp; cook the catfish:  ","desc":" Combine the chickpea flour and remaining spice blend on a large plate. Pat the catfish fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the chickpea flour-spice blend mixture (shaking off any excess). In the pan used to make the chana masala, heat a thin layer of oil on medium-high until hot. Add the fillets, coated sides down. Cook 3 to 4 minutes per side, or until golden brown and cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1358\/recipe_steps\/5746\/20150918-1528-185-1945\/FP_091115_4_CurriedCatfishWithChanaMasala_20-_200638_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the cooked rice between 4 plates. Top with the chana masala and cooked catfish fillets. Garnish with the cilantro. Enjoy!  "}]}