{"category":"Poultry","link":"crispy-chicken-tenders-with-honey-mustard-tomato-cucumber-salad","thumb":"\/\/media.blueapron.com\/recipes\/1331\/c_main_dish_images\/20150820-2004-116-6799\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200805_high_also_thumb.jpg","title":" Crispy Chicken Tenders ","subtitle":" with Honey Mustard &amp; Tomato-Cucumber Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1331\/c_main_dish_images\/20150820-2004-98-3942\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200804_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  585    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chicken tenders have long been an all-American meal. In this recipe, we&rsquo;re making them from scratch&mdash;cutting chicken cutlets into strips, coating them with seasonings and breadcrumbs and lightly frying them to create perfectly crispy crusts. And what chicken tenders would be complete without a dipping sauce? Here, we&rsquo;re taking honey-mustard sauce back to its roots and making it with just two ingredients: honey and mustard. Here&rsquo;s to a family favorite done simply and well. ","ingbg":"\/\/media.blueapron.com\/recipes\/1331\/ingredient_images\/20150914-2021-144-9380\/FP-crispy-chicken-tenders-honey-mustard-F-W_large_feature.png","ingredients":[" 4  Boneless, Skinless Chicken Cutlets ","  1¼  Cups Panko Breadcrumbs   "," ½  Cup Plain Greek Yogurt ","  1  Cucumber   "," 1  Head Red Leaf Lettuce "," 1  Lemon "," 1  Tomato "," 3  Tablespoons Dijon Mustard ","  2  Tablespoons Honey   "," ¼  Cup Chicken Tender Spice Blend (All-Purpose Flour, Italian Seasoning, Garlic Powder & Smoked Sweet Paprika) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5758\/20150820-2007-21-3388\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200795_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Quarter and deseed the lemon. Cut off and discard the root end of the lettuce. Roughly chop the lettuce leaves; place in a large bowl. Core and medium dice the tomato. Halve the cucumber lengthwise; using a spoon, scoop out and discard the seeds. Medium dice the cucumber. In a small bowl, whisk together the honey and mustard.  "},{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5759\/20150820-2007-33-7522\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200796_high_feature.jpg","title":" Prepare the chicken &amp; make the yogurt mixture:  ","desc":" Pat the chicken cutlets dry with paper towels. Cut each cutlet lengthwise into about four 1-inch-wide strips; season with salt and pepper. Set aside. Thoroughly wash your hands, knife and cutting board after handling the chicken. In a large bowl, whisk together half the yogurt and &frac14; cup of water; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5760\/20150820-2007-45-8408\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200797_high_feature.jpg","title":" Bread the chicken:  ","desc":" Place the spice blend and breadcrumbs in 2 separate large bowls; season each with salt and pepper. Working 1 strip at a time, thoroughly coat the seasoned chicken with the spice blend (shaking off any excess), then the yogurt mixture (letting the excess drip off), then the breadcrumbs (pressing to adhere). Place the breaded chicken on a sheet pan or plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5761\/20150820-2007-69-1561\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200798_high_feature.jpg","title":" Cook the chicken:  ","desc":" In a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a few breadcrumbs sizzle immediately when added to the pan, working in batches, add the breaded chicken. Cook 3 to 5 minutes per side, or until the breadcrumbs are browned and crispy and the chicken is cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5762\/20150820-2007-57-6144\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200799_high_feature.jpg","title":" Make the salad dressing:  ","desc":" While the chicken cooks, in a small bowl, combine the remaining yogurt and the juice of all 4 lemon wedges; season with salt and pepper to taste. Add a drizzle of olive oil and whisk until well combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1331\/recipe_steps\/5763\/20150820-2007-86-1712\/FP_081115_4_CrispyChickenTenderswithHoneyMustard_20-_200800_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" Just before serving, to the bowl of lettuce, add the tomato and cucumber; season with salt and pepper. Add as much of the salad dressing as you&rsquo;d like (you may have extra). Toss to coat; season with salt and pepper to taste. Divide the cooked chicken and salad between 4 plates. Serve with the honey mustard on the side. Enjoy!  "}]}