{"category":"Vegetarian","link":"crispy-tofu-yu-choy-red-curry-with-jasmine-rice-thai-basil-cashews","thumb":"\/\/media.blueapron.com\/recipes\/1338\/c_main_dish_images\/20150921-1537-118-1468\/2P_081815_3_R091715_BokChoyRedCurry_20-_204187_high_also_thumb.jpg","title":" Crispy Tofu &amp; Bok Choy Red Curry ","subtitle":" with Jasmine Rice, Thai Basil &amp; Cashews ","headbg":"\/\/media.blueapron.com\/recipes\/1338\/c_main_dish_images\/20150921-1536-108-6860\/2P_081815_3_R091715_BokChoyRedCurry_20-_204190_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The best curries are a balancing act, incorporating layers of bold, contrasting tastes and textures in perfect harmony. Bursting with the vibrant flavors of Thailand, this dish hits all the right notes&mdash;spicy, crunchy, savory and sweet. At its base is red curry paste, an intense, heady blend of ground red chile peppers, lemongrass, makrut lime, spices and galangal (a pungent, ginger-like root essential to Southeast Asian cooking). And for a unique spin, we&rsquo;re adding bok choy, a mild, leafy green with hearty stems that soften in the heat of the curry. ","ingbg":"\/\/media.blueapron.com\/recipes\/1338\/ingredient_images\/20150921-1529-55-5334\/V3-Yu-Choy-Curry-Rice-Tofu-2P-W_large_feature.png","ingredients":[" 1  14-Ounce Package Extra Firm Tofu "," 1  Cup Jasmine Rice "," 3  Scallions "," 6  Ounces Baby Bok Choy ","  1  Bunch Thai Basil   "," 2  Tablespoons Cashews "," 2  Tablespoons Sweet Chili Sauce ","  1  Tablespoon Red Curry Paste   "," 1  1-Inch Piece Ginger "," ¼  Cup Rice Flour "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5794\/20150921-1521-26-2366\/2P_081815_3_R091715_BokChoyRedCurry_20-_204181_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Drain the tofu and pat dry with paper towels; slice lengthwise into 6 equal-sized pieces. Cut off and discard the root ends of the bok choy; separate the leaves. Peel and mince the ginger. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops. Pick the basil leaves off the stems; discard the stems. Roughly chop the cashews.  "},{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5795\/20150921-1521-32-1897\/2P_081815_3_YuChoyRedCurry_JasmineRicewithCrispyTofu_20-_201021_high_feature.jpg","title":" Cook the rice:  ","desc":" In a medium pot, combine the rice, a big pinch of salt and 2 cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5796\/20150921-1521-38-3178\/2P_081815_3_YuChoyRedCurry_JasmineRicewithCrispyTofu_20-_201020_high_feature.jpg","title":" Coat &amp; cook the tofu:  ","desc":" While the rice cooks, place the rice flour on a plate. Pat the sliced tofu dry with paper towels; season with salt and pepper on both sides. Coat both sides of the seasoned tofu in the rice flour (shaking off any excess). In a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Add the coated tofu in a single layer. (If necessary, work in batches.) Cook 4 to 6 minutes per side, or until lightly browned and crispy. Transfer to a paper towel-lined plate and season immediately with salt and pepper. Set aside in a warm place. Carefully wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5797\/20150921-1522-54-1563\/2P_081815_3_YuChoyRedCurry_JasmineRicewithCrispyTofu_20-_201022_high_feature.jpg","title":" Start the curry:  ","desc":" In the pan used to cook the tofu, heat 2 teaspoons of oil on medium-high until hot. Add the ginger, white bottoms of the scallions and as much of the curry paste as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the vegetables have softened and the curry paste is fragrant. Add &frac34; cup of water and cook, stirring frequently, 30 seconds to 1 minute, or until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5798\/20150921-1522-59-1110\/2P_081815_3_R091715_BokChoyRedCurry_20-_204182_high_feature.jpg","title":" Add the bok choy &amp; finish the curry:  ","desc":" Add the bok choy and sweet chili sauce to the pan of curry. Cook, stirring occasionally, 3 to 4 minutes, or until the bok choy leaves have wilted and the liquid has reduced in volume by about half. Remove from heat. Stir in the basil and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1338\/recipe_steps\/5799\/20150921-1522-64-8195\/2P_081815_3_R091715_BokChoyRedCurry_20-_204183_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Divide the cooked rice between 2 plates. Top with the cooked tofu and finished curry. Garnish with the green tops of the scallions and cashews. Enjoy!  "}]}