{"category":"Pork","link":"cuban-sandwiches-with-sweet-plantain-kale-salad","thumb":"\/\/media.blueapron.com\/recipes\/454\/c_main_dish_images\/20140909-1935-15051-0181\/Cuban_20Sandwich_20Kale_20Plantain-7062_high_also_thumb.jpg","title":" Cuban Sandwiches ","subtitle":" with Sweet Plantain &amp; Kale Salad ","headbg":"\/\/media.blueapron.com\/recipes\/454\/c_main_dish_images\/20140909-1935-20153-3577\/Cuban_20Sandwich_20Kale_20Plantain-7061_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"In the 1800s, travel between Cuba and Southern Florida was fairly easy. People, and their cuisines, went back and forth frequently. By 1860, a new kind of sandwich had appeared. It was made on Cuban bread and layered with sliced pork, mustard, pickles and melted Swiss cheese. The Cuban sandwich was born and is now Tampa&rsquo;s official sandwich. We&rsquo;re keeping true to the traditional recipe while pairing it with a delicious, hearty kale salad featuring maduros (ripe, brown plantains).","desc":" In the 1800s, travel between Cuba and Southern Florida was fairly easy. People, and their cuisines, went back and forth frequently. By 1860, a new kind of sandwich had appeared. It was made on Cuban bread and layered with sliced pork, mustard, pickles and melted Swiss cheese. The Cuban sandwich was born and is now Tampa&rsquo;s official sandwich. We&rsquo;re keeping true to the traditional recipe while pairing it with a delicious, hearty kale salad featuring maduros (ripe, brown plantains). ","ingbg":"\/\/media.blueapron.com\/recipes\/454\/ingredient_images\/20140918-1622-6443-9271\/cuban-sandwich-ing-WEB_large_feature.png","ingredients":[" 2  Cloves Garlic "," 2  Cuban Sandwich Rolls "," 2  Tablespoons White Vinegar "," 8  Ounces Pork Tenderloin "," 2  Kirby Cucumbers "," 1  Lime "," 1  Sweet Plantain "," 1  Tablespoon Honey ","  ¼  Bunch Lacinato Kale   "," 4  Slices Swiss Cheese ","  2  Tablespoons Dijon Mustard   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3027\/20140918-1624-6546-7216\/Cuban_20Sandwich_20Kale_20Plantain-7046_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Remove the pork from the refrigerator to bring to room temperature. Peel the garlic cloves. Smash 1 clove to flatten it. Mince the remaining clove; smash it with the side of your knife until it resembles a paste. Slice the sandwich rolls horizontally. Very thinly slice the cucumbers and place in a heat-safe container with the vinegar, honey and flattened garlic clove. Quarter the lime. Peel the plantain; discard the peel. Slice the plantain into &frac34;-inch pieces. Cut out and discard the stems of the kale; roughly chop the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3028\/20140918-1624-5933-7306\/Cuban_20Sandwich_20Kale_20Plantain-7050_high_feature.jpg","title":" Cook &amp; slice the pork:  ","desc":" Season the pork with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the seasoned pork and cook, loosely covering the pan with aluminum foil, 5 to 7 minutes per side, or until browned and cooked through. Transfer the cooked pork to a plate and set aside; let rest for at least 5 minutes. Wipe out the pan. When cool enough to handle, find the lines of muscle (or grain) of the pork; thinly slice the meat crosswise against the grain.  "},{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3029\/20140918-1625-6562-6332\/Cuban_20Sandwich_20Kale_20Plantain-7048_high_feature.jpg","title":" Make the pickles:  ","desc":" While the pork cooks, in a small pot, heat 1 cup of water with a big pinch of salt to boiling on high. Once boiling, pour the salted water over the cucumber mixture, making sure the cucumbers are completely submerged. Set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3030\/20140918-1625-5962-1708\/Cuban_20Sandwich_20Kale_20Plantain-7051_high_feature.jpg","title":" Cook the plantains:  ","desc":" While the pork rests, in the same pan used to cook the pork, heat a thin layer of oil on medium until hot. Once the oil is hot enough that a piece of plantain sizzles immediately when added to the pan, add the plantain pieces. Cook 3 to 4 minutes per side, or until browned. Transfer to a paper towel-lined plate. Carefully discard the oil. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3031\/20140918-1625-5968-1992\/Cuban_20Sandwich_20Kale_20Plantain-7054_high_feature.jpg","title":" Assemble &amp; toast the sandwiches:  ","desc":" Drain the pickles. Lay the sandwich rolls out on a clean work surface. Spread the mustard on the cut sides. Divide the sliced pork, as much of the pickles as you&rsquo;d like and cheese between the sandwiches. Close the sandwiches. In the same pan used to cook the plantains, heat 2 teaspoons of olive oil on medium until hot. Add the sandwiches; rest a heavy pot on top to press the sandwiches down. Cook 3 to 5 minutes per side, or until the cheese has melted and the bread is toasted. Transfer to a plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/454\/recipe_steps\/3032\/20140918-1625-6568-2599\/Cuban_20Sandwich_20Kale_20Plantain-7058_high_feature.jpg","title":" Make the dressing &amp; plate your dish:  ","desc":" While the sandwiches cook, in a small bowl, combine the garlic paste and the juice of all 4 lime wedges; season with salt and pepper. Slowly whisk in 2 tablespoons of olive oil until well combined. In a medium bowl, combine the kale and cooked plantains with enough dressing to coat the kale (you may have extra dressing); gently toss to coat. Cut the toasted sandwiches in half and divide between 2 plates. Serve the salad and any remaining pickles on the side. Enjoy!  "}]}