{"category":"Beef","link":"cumin-sichuan-beef-noodles-with-pepper-cabbage-garlic-chives","thumb":"\/\/media.blueapron.com\/recipes\/1326\/c_main_dish_images\/20150910-2031-58-3766\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200792_20EDIT_high_also_thumb.jpg","title":" Cumin-Sichuan Beef &amp; Noodles ","subtitle":" with Sweet Peppers, Cabbage &amp; Garlic Chives ","headbg":"\/\/media.blueapron.com\/recipes\/1326\/c_main_dish_images\/20150910-2031-49-6662\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200791_20EDIT_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The cuisine of China&rsquo;s Xinjiang Province (in the Northwest region of the country) is famous for its use of bold flavors. Certain areas were influenced by Middle Eastern cuisines, and cumin became a popular spice in many local dishes. Here, we&rsquo;re using an incredibly delicious cumin and Sichuan peppercorn sauce to coat our beef and rice noodle stir-fry. Sichuan peppercorns are an essential Chinese ingredient. Bursting with citrusy, aromatic complexity, they produce a distinctive, cooling sensation on the tongue, which enhances the flavor of warming spices like cumin. (So if you feel a little bit of  tingling, don&rsquo;t worry!) ","ingbg":"\/\/media.blueapron.com\/recipes\/1326\/ingredient_images\/20150914-2020-62-7646\/M-cumin-beef-noodles-2P-W_large_feature.png","ingredients":[" 10  Ounces Stir-Fry Cut Beef "," ½  Pound Wide Rice Noodles "," 2  Cloves Garlic "," 4  Sweet Peppers ","  1  Bunch Garlic Chives   "," 1  Red Onion "," ½  Pound Green Cabbage "," 2  Tablespoons Black Vinegar "," 2  Tablespoons Soy Glaze "," 1  Tablespoon Cumin & Sichuan Peppercorn Sauce "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5638\/20150910-2035-21-5646\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200781_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and thinly slice the garlic. Cut off and discard the stem ends of the sweet peppers; remove and discard the seeds. Thinly slice the sweet peppers into rings. Peel, halve and thinly slice the onion. Thinly slice the garlic chives. Cut out and discard the cabbage core; thinly slice the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5639\/20150812-2120-377-1040\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200782_high_feature.jpg","title":" Cook the beef:  ","desc":" Pat the beef dry with paper towels; season with salt and pepper. In a large pan, heat 2 teaspoons of oil on medium-high until hot. Add the seasoned beef and cook, stirring occasionally, 2 to 3 minutes, or until browned and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5640\/20150812-2120-522-6676\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200785_high_feature.jpg","title":" Cook the noodles:  ","desc":" While the beef cooks, add the noodles to the pot of boiling water. Cook 5 to 7 minutes, or until tender. Drain thoroughly and rinse under warm water to prevent sticking.  "},{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5641\/20150910-2035-27-1356\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200784_20EDIT_high_feature.jpg","title":" Cook the vegetables:  ","desc":" While the noodles cook, add 1 teaspoon of oil to the pan of reserved fond; heat on medium-high until hot. Add the garlic, onion and sweet pepper; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the cabbage and half the garlic chives; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until the cabbage has wilted.  "},{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5642\/20150812-2121-403-3379\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200786_high_feature.jpg","title":" Make the sauce:  ","desc":" While the vegetables cook, in a small bowl, combine the vinegar, soy glaze, 2 tablespoons of water and as much of the cumin and Sichuan peppercorn sauce as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Stir to thoroughly combine.  "},{"img":"\/\/media.blueapron.com\/recipes\/1326\/recipe_steps\/5643\/20150910-2035-33-4929\/2P_081115_3_CuminScentedStirFryBeefNoodles_20-_200787_20EDIT_high_feature.jpg","title":" Finish the noodles &amp; plate your dish:  ","desc":" Rinse the cooked noodles under warm water again to loosen them; drain thoroughly. Add the drained noodles, cooked beef and sauce to the pan of vegetables. Cook, stirring frequently, 1 to 2 minutes, or until thoroughly combined. Remove from heat and season with salt and pepper to taste. Divide the finished noodles between 2 dishes. Garnish with the remaining garlic chives. Enjoy!  "}]}