{"category":"Vegetarian","link":"eggplant-mozzarella-panini-with-caramelized-fig-arugula-salad","thumb":"\/\/media.blueapron.com\/recipes\/1312\/c_main_dish_images\/20150831-1908-59-4273\/2P_072815_5_R_081415_1_R_082515_6_EggplantandMozzarellaPanini_20-_200989_high_also_thumb.jpg","title":" Eggplant &amp; Mozzarella Paninis ","subtitle":" with Caramelized Stone Fruit &amp; Arugula Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1312\/c_main_dish_images\/20150831-1908-54-6979\/2P_072815_5_R_081415_1_R_082515_6_EggplantandMozzarellaPanini_20-_200988_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  690    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The panini is an Italian sandwich that&rsquo;s traditionally toasted on a grill or in a press. In this recipe, we&rsquo;re making gourmet ciabatta, eggplant and mozzarella paninis on the stove, using a heavy pot to press them down and create their distinctive, crispy texture. On the side, we&rsquo;re serving a classic tomato sauce, along with an incredibly tasty treat: a salad of arugula and caramelized stone fruit. (Depending on what&rsquo;s best in your area, we&rsquo;ll be sending you either a plum or a pluot.) When heated, the stone fruit&rsquo;s natural sugars caramelize and brown, resulting in rich, complex sweetness&mdash;the perfect pairing for the hearty, melty sandwiches. ","ingbg":"\/\/media.blueapron.com\/recipes\/1312\/ingredient_images\/20150831-1919-46-8009\/V3-eggplant-mozz-panini-2P-W_large_feature.png","ingredients":[" 2  Ciabatta Rolls "," 1  15-Ounce Can Crushed Tomatoes "," ½  Pound Fresh Mozzarella Cheese "," 3  Cloves Garlic "," 3  Ounces Arugula "," 1  Eggplant ","  1  Bunch Basil   "," 1  Tablespoon Dijon Mustard "," 1  Stone Fruit "," 1  Tablespoon Red Wine Vinegar "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5552\/20150831-1919-81-0160\/2P_072815_5_R_081415_1_R_082515_6_EggplantandMozzarellaPanini_20-_200981_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic. Pit the stone fruit and cut into wedges. Cut off and discard the stem end of the eggplant; slice into &frac12;-inch-thick rounds. Thinly slice the mozzarella cheese. Halve the ciabatta rolls horizontally. Pick the basil leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5553\/20150806-1430-251-7169\/2P_072815_5_EggplantandMozzarellaPanini_20-_200162_high_feature.jpg","title":" Make the sauce:  ","desc":" In a medium pot, heat 2 teaspoons of olive oil on medium until hot. Add the garlic; season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until fragrant. Add the crushed tomatoes; reduce the heat to low. Simmer, stirring occasionally, 14 to 16 minutes, or until thickened. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5554\/20150831-1919-86-4268\/2P_072815_5_R_081415_1_R_082515_6_EggplantandMozzarellaPanini_20-_203958_high_feature.jpg","title":" Caramelize the stone fruit &amp; make the vinaigrette:  ","desc":" While the sauce simmers, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the stone fruit; season with salt and pepper. Cook, flipping occasionally, 3 to 5 minutes, or until caramelized and slightly softened. Transfer to a plate. Wipe out the pan. While the stone fruit caramelizes, in a bowl, combine the vinegar and mustard; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5555\/20150806-1431-277-1926\/2P_072815_5_EggplantandMozzarellaPanini_20-_200161_high_feature.jpg","title":" Cook the eggplant:  ","desc":" In the pan used to caramelize the stone fruit, heat 1 tablespoon of olive oil on medium-high until hot. Add the eggplant in a single, even layer. (If necessary, work in batches.) Season with salt and pepper. Cook 3 to 5 minutes per side, or until browned and tender. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5556\/20150806-1431-288-3319\/2P_072815_5_EggplantandMozzarellaPanini_20-_200163_high_feature.jpg","title":" Assemble &amp; toast the paninis:  ","desc":" Place the ciabatta rolls on a clean, dry work surface. Spread a layer of the sauce onto the cut sides of each roll (you will have extra sauce). Divide the mozzarella cheese and basil between the bottoms of the rolls; season with salt and pepper. Top with the cooked eggplant and the tops of the rolls. In the pan used to cook the eggplant, heat 2 teaspoons of olive oil on medium until hot. Add the assembled paninis; place a heavy pot on top of the paninis to press them down. Cook 2 to 4 minutes per side, or until the cheese has melted and the bread is toasted. Transfer to a cutting board to cool slightly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1312\/recipe_steps\/5557\/20150831-1919-91-1022\/2P_072815_5_R_081415_1_R_082515_6_EggplantandMozzarellaPanini_20-_203967_high_feature.jpg","title":" Make the salad &amp; plate your dish:  ","desc":" In a large bowl, combine the caramelized stone fruit and arugula; season with salt and pepper. Add as much of the vinaigrette as you&rsquo;d like; toss to thoroughly coat and season with salt and pepper to taste. Cut the toasted paninis in half diagonally and divide between 2 plates. Serve with the salad and remaining sauce on the side. Enjoy!  "}]}