{"category":"Beef","link":"flat-iron-steaks-with-arugula-pine-nut-pesto-heirloom-tomato-panzanella","thumb":"\/\/media.blueapron.com\/recipes\/1248\/c_main_dish_images\/20150619-1833-89-6930\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207321_high_also_thumb.jpg","title":" Top Round Steaks ","subtitle":" with Arugula-Walnut Pesto &amp; Panzanella ","headbg":"\/\/media.blueapron.com\/recipes\/1248\/c_main_dish_images\/20150619-1832-74-1241\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207320_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  600    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" It&rsquo;s the perfect season for panzanella, a traditional bread and tomato salad from Tuscany, Italy. Though it may have originated as a creative way to use up extra bread, rustic panzanella has since risen to gourmet heights. Here, we&rsquo;re making ours truly special (and delicious) with crunchy sourdough croutons, toasted in the oven and lightly flavored with garlic. Olives, cucumber, basil and vinegar-marinated onion complete the hearty salad, a refreshing side for juicy, arugula pesto-topped steaks. ","ingbg":"\/\/media.blueapron.com\/recipes\/1248\/ingredient_images\/20150714-2116-35-0935\/Flat-Iron-Steaks-with-Arugula-Walnut-Pesto-_-Heirloom-Tomato-Panzanella-FP-W_large_feature.png","ingredients":[" 4  Premium Top Round Steaks "," 1  Sourdough Bread Boule "," 2  Cloves Garlic "," 2½  Ounces Arugula "," 1  Cucumber "," 1  Tomato "," 1  Red Onion ","  1  Large Bunch Basil   "," 3  Tablespoons Walnuts "," 2  Ounces Kalamata Olives "," 2  Tablespoons Red Wine Vinegar "," ⅓  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5194\/20150619-1840-188-1380\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207308_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut the bread into 1-inch-thick slices. Peel the garlic. Mince 1 garlic clove; using the flat side of your knife, smash until it resembles a paste (or use a zester). Leave the remaining garlic clove whole. Peel, halve and thinly slice the onion; place in a bowl with the vinegar. Finely chop the arugula. Large dice the tomato and cucumber. Pick the basil leaves off the stems; discard the stems. Using the flat side of your knife, smash the olives; remove and discard the pits. Roughly chop the olives.  "},{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5195\/20150619-1840-199-4246\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207312_high_feature.jpg","title":" Make the garlic croutons:  ","desc":" Place the bread slices on a sheet pan in a single, even layer; lightly drizzle with olive oil. Toast in the oven 10 to 12 minutes, or until golden brown and crispy. Remove from the oven and let cool slightly. When cool enough to handle, carefully rub the toasted bread slices with the whole garlic clove; discard the clove. Transfer the garlic bread slices to a clean, dry work surface; large dice. Place the garlic croutons in a large bowl; drizzle with olive oil and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5196\/20150619-1840-219-6616\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207309_high_feature.jpg","title":" Toast the walnuts:  ","desc":" While the bread toasts, heat a large, dry pan (nonstick, if you have one) on medium-high until hot. Add the walnuts and toast, stirring frequently, 1 to 2 minutes, or until lightly browned and fragrant. Transfer to a cutting board. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5197\/20150619-1840-230-3732\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207310_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the bread continues to toast, pat the steaks dry with paper towels; season with salt and pepper on both sides. In the pan used to toast the walnuts, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steaks and cook 3 to 5 minutes per side, or until browned and cooked to your desired degree of doneness. Transfer to a serving dish and let rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5198\/20150619-1840-241-4680\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207311_high_feature.jpg","title":" Make the pesto:  ","desc":" While the steaks rest, finely chop the toasted walnuts; transfer to a medium bowl. Transfer half the marinated onion to a cutting board (reserving the vinegar and remaining marinated onion); finely chop. To the bowl of chopped walnuts, add the arugula, chopped onion, garlic paste and Parmesan cheese; slowly stir in enough olive oil to create a rough paste. Season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/1248\/recipe_steps\/5199\/20150619-1841-252-0408\/FP_061115_3_Flat_20Iron_20Steaks_20with_20Arugula-Walnut_20Pesto_20__20Heirloom_20Tomato_20Panzanella_20-_207313_high_feature.jpg","title":" Make the panzanella &amp; serve your dish:  ","desc":" To the bowl of garlic croutons, add the tomato, cucumber, olives, basil, reserved vinegar and as much of the remaining marinated onion as you&rsquo;d like; season with salt and pepper. Drizzle with olive oil and toss to combine; season with salt and pepper to taste. Transfer to a serving dish. Top the rested steaks with the pesto. Serve with the panzanella on the side. Enjoy!  "}]}