{"category":"Beef","link":"hanger-steak-with-creamed-spinach-lemon-butter-purple-potatoes","thumb":"\/\/media.blueapron.com\/recipes\/128\/c_main_dish_images\/20150824-1512-56-9607\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2427_high_also_thumb.jpg","title":" Pan-Seared Steaks ","subtitle":" with &quot;Creamed&quot; Spinach &amp; Lemon-Butter Purple Potatoes ","headbg":"\/\/media.blueapron.com\/recipes\/128\/c_main_dish_images\/20140808-1824-372-3273\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2427_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" There&rsquo;s a reason why most classic American steakhouse menus haven&rsquo;t changed much for over 100 years: a beautifully cooked steak will never go out of style. We&rsquo;re serving up our own version, alongside tender purple potatoes coated in a delicious sauce of lemon, butter and chives. We&rsquo;re also making &ldquo;creamed&rdquo; spinach with Parmesan cheese and a little butter instead of cream, for a lighter touch and incredible flavor&mdash;but the same distinctive, creamy texture. ","ingbg":"\/\/media.blueapron.com\/recipes\/128\/ingredient_images\/20150922-1434-91-2795\/M-Steak-Spinach-Potatoes-2P-W_large_feature.png","ingredients":[" 2  Steaks "," 2  Cloves Garlic "," 1  Lemon ","  ½  Pound Purple Potatoes   "," ½  Pound Spinach "," 1  Bunch Chives "," 2  Tablespoons Butter "," ¼  Cup Grated Parmesan Cheese "," ¼  Teaspoon Crushed Red Pepper Flakes "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2407\/20140725-2007-540-2135\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2403_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut the potatoes into &frac12;-inch-thick rounds. Finely chop the chives. Quarter and deseed the lemon. Peel and mince the garlic.  "},{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2408\/20140725-2008-630-4711\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2408_high_feature.jpg","title":" Start the potatoes:  ","desc":" Add the potatoes to the pot of boiling water. Cook 8 to 10 minutes, or until tender when pierced with a fork. Drain thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2409\/20140725-2007-612-1711\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2407_high_feature.jpg","title":" Start the spinach:  ","desc":" While the potatoes cook, in a large pan, heat 2 teaspoons of olive oil on medium until hot. Add the spinach; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the spinach to release as much liquid as possible; discard the liquid. Transfer the spinach to a cutting board to cool. When cool enough to handle, finely chop. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2410\/20140725-2008-624-3661\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2410_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the spinach cools, pat the steaks dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the spinach, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned steaks and cook 3 to 5 minutes per side for medium, or until browned and cooked to your desired degree of doneness. Transfer to a cutting board, leaving any browned bits (or fond) in the pan. Let the cooked steaks rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2411\/20140725-2007-606-1219\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2412_high_feature.jpg","title":" Finish the potatoes:  ","desc":" While the steaks rest, add half the butter to the pan of reserved fond; melt on medium-high until hot. Add the drained potatoes and cook, stirring frequently, 1 to 2 minutes, or until thoroughly coated and lightly browned. Remove from heat. Stir in the chives and the juice of 2 lemon wedges; season with salt and pepper to taste. Divide between 2 plates. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/128\/recipe_steps\/2412\/20140725-2008-546-5551\/Hanger_20Steak_20Spinach_20Purple_20Potatoes-2413_high_feature.jpg","title":" Finish the spinach &amp; plate your dish:  ","desc":" In the pan used to cook the potatoes, melt the remaining butter on medium until hot. Add the garlic, chopped spinach and as much of the crushed red pepper flakes as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Turn off the heat. Add the cheese and 2 tablespoons of water; stir until creamy. Season with salt and pepper to taste. Find the lines of muscle (or grain) of the rested steaks; thinly slice against the grain. Add any juices from the cutting board to the pan of spinach; stir to combine. Divide the sliced steaks and finished spinach between the plates of finished potatoes. Garnish with the remaining lemon wedges. Enjoy!  "}]}