{"category":"Beef","link":"italian-meatball-sandwiches-with-romaine-caesar-stye-salad","thumb":"\/\/media.blueapron.com\/recipes\/1204\/c_main_dish_images\/20150519-1452-6480-4181\/FP_040715_1_20Italian_20Meat_20Hoagies-3232_high_also_thumb.jpg","title":" Italian Meatball Sandwiches ","subtitle":" with Caesar-Style Romaine Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1204\/c_main_dish_images\/20150519-1451-6465-5715\/FP_040715_1_20Italian_20Meat_20Hoagies-3231_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Depending on the region, this classic Italian-American sandwich goes by many names, from hoagie to hero to grinder to sub. Most believe that it originated in the Northeastern U.S., spreading from Maine down through New England. Now, it&rsquo;s a national staple&mdash;and whatever you call it at home, the sandwich is incredibly delicious. Served on a hearty Italian roll, ours is filled with traditionally-spiced meatballs and topped with homemade tomato sauce, Parmesan and melty mozzarella. ","ingbg":"\/\/media.blueapron.com\/recipes\/1204\/ingredient_images\/20150521-1620-1076-2539\/italian-meat-hoagies-fp-w_large_feature.png","ingredients":[" 1⅛  Pounds Ground Beef "," 4  Sub Rolls "," 1  28-Ounce Can Crushed Tomatoes ","  8  Ounces Fresh Mozzarella Cheese   "," 4  Cloves Garlic "," 1  Head Romaine Lettuce "," 1  Lemon "," 1  Yellow Onion "," 2  Teaspoons Dijon Mustard "," ⅓  Cup Grated Parmesan Cheese "," ⅓  Cup Panko Breadcrumbs "," ½  Teaspoon Italian Seasoning "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4848\/20150520-1520-201-3496\/FP_040715_1_20Italian_20Meat_20Hoagies-3217_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Peel and mince the garlic. Peel and small dice the onion. Slice the rolls lengthwise, keeping them intact (they should look like hot dog buns). Thinly slice the mozzarella cheese. Cut off and discard the root end of the lettuce; roughly chop the leaves. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4849\/20150520-1520-212-3858\/FP_040715_1_20Italian_20Meat_20Hoagies-3219_high_feature.jpg","title":" Cook the aromatics:  ","desc":" In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic, onion and Italian seasoning; season with salt and pepper. Cook, stirring frequently, 3 to 5 minutes, or until softened and fragrant. Remove from heat. Transfer half the cooked aromatics to a large bowl, leaving the remaining cooked aromatics in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4850\/20150520-1520-229-6956\/FP_040715_1_20Italian_20Meat_20Hoagies-3221_high_feature.jpg","title":" Form &amp; brown the meatballs:  ","desc":" Add the ground beef, breadcrumbs and half the Parmesan cheese to the bowl of cooked aromatics; season with salt and pepper. Gently mix until just combined. Using your hands, form the mixture into 16 equal-sized meatballs. In a medium pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the meatballs and cook, flipping occasionally, 5 to 7 minutes, or until browned on all sides.  "},{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4851\/20150520-1521-240-0723\/FP_040715_1_20Italian_20Meat_20Hoagies-3223_high_feature.jpg","title":" Make the sauce &amp; finish the meatballs:  ","desc":" While the meatballs cook, add the crushed tomatoes to the pan of remaining cooked aromatics; season with salt and pepper. Heat to boiling on high. Once boiling, reduce the heat to medium. Simmer 3 to 5 minutes, or until thickened; season with salt and pepper. Add the browned meatballs. Simmer, stirring occasionally, 6 to 8 minutes, or until the meatballs are cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4852\/20150520-1521-255-2541\/FP_040715_1_20Italian_20Meat_20Hoagies-_high_feature.jpg","title":" Assemble &amp; toast the sandwiches:  ","desc":" Place the rolls on a sheet pan, cut sides up. Spread a layer of the sauce into each roll (you may have extra sauce). Divide the finished meatballs, mozzarella cheese and half the remaining Parmesan cheese between the rolls. Toast in the oven 3 to 5 minutes, or until the mozzarella cheese has melted. Remove from the oven and transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1204\/recipe_steps\/4853\/20150520-1521-266-8517\/FP_040715_1_20Italian_20Meat_20Hoagies-3225_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" In a medium bowl, combine the mustard, remaining Parmesan cheese and the juice of 2 lemon wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Place the lettuce in a large bowl; season with salt and pepper. Add enough of the dressing to coat the salad (you may have extra dressing); toss to coat and season with salt and pepper to taste. Transfer to a serving dish. Serve the toasted sandwiches and salad with the remaining lemon wedges and any remaining sauce on the side. Enjoy!  "}]}