{"category":"Vegetarian","link":"kale-queso-quesadillas-breakfast","thumb":"\/\/media.blueapron.com\/recipes\/459\/c_main_dish_images\/20140918-1649-7782-5017\/Mexican_20Breakfast-3403_high_also_thumb.jpg","title":" Kale &amp; Monterey Jack Quesadillas ","subtitle":" with Avocado, Radishes &amp; Fried Eggs ","headbg":"\/\/media.blueapron.com\/recipes\/459\/c_main_dish_images\/20140918-1649-7321-0209\/Mexican_20Breakfast-3402_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Tex-Mex, or north-of-the-border adaptations of classic Mexican dishes, is the ultimate comfort cuisine. It combines authentic Mexican ingredients&mdash;warm tortillas, tart crema and creamy avocado&mdash;with all-American flavors and textures. In this recipe, we&rsquo;re making Tex-Mex quesadillas featuring mild, luscious Monterey Jack cheese (named for the city of Monterey in Northern California). Filled with spiced kale and topped with peppery radishes and fried eggs, these gourmet quesadillas are a delicious tribute to the cooking of Mexico and the Western U.S. ","ingbg":"\/\/media.blueapron.com\/recipes\/459\/ingredient_images\/20150918-1529-204-3128\/mexican-breakfast-W_large_feature.png","ingredients":[" 2  Farm Eggs "," 4  Corn Tortillas "," 6  Ounces Monterey Jack Cheese "," 1  Avocado "," 1  Bunch Cilantro "," 1  Bunch Kale "," 1  Clove Garlic "," 3  Ounces Radishes "," 1  Lime "," 1  Teaspoon Quesadilla Spice Blend (Ancho Chile Powder, Chipotle Chile Powder & Ground Cumin) "," ¼  Cup Mexican Crema "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3050\/20150918-1528-162-4640\/Mexican_20Breakfast-3384_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Using a peeler, remove the rind of the lime, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Peel and mince the garlic. Remove and discard the kale stems; roughly chop the leaves. Grate the cheese. Pit, peel and medium dice the avocado; place in a bowl. Toss the avocado with the juice of 2 lime wedges; season with salt and pepper. Pick the cilantro leaves off the stems; discard the stems. Cut off and discard the stem ends of the radishes; cut into thin matchsticks and place in a bowl of ice water.  "},{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3051\/20140918-1706-8823-6456\/Mexican_20Breakfast-3387_high_feature.jpg","title":" Make the lime crema:  ","desc":" In a bowl, combine the crema and the juice of the remaining lime wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3055\/20140918-1706-8001-6360\/Mexican_20Breakfast-3385_high_feature.jpg","title":" Cook the kale:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the garlic. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Add the kale, &frac14; cup of water and (reserving a pinch) as much of the spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until the water has evaporated and the kale has wilted. Add the lime zest. Cook, stirring occasionally, 30 seconds to 1 minute, or until well combined. Season with salt and pepper to taste. Transfer to a plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3052\/20140918-1706-8847-6582\/Mexican_20Breakfast-3392_high_feature.jpg","title":" Assemble &amp; cook the quesadillas:   ","desc":" Place the tortillas on a clean, dry work surface. Divide the cheese and cooked kale between 2 of the tortillas; top with the remaining tortillas. Wipe out the pan used to cook the kale. Add 2 teaspoons of olive oil; heat on medium-high until hot. Add the quesadillas and cook 2 to 3 minutes per side, or until the tortillas are crispy and the cheese has melted. Divide between 2 plates and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3053\/20140918-1707-8853-1597\/Mexican_20Breakfast-3395_high_feature.jpg","title":" Fry the eggs:  ","desc":" In the same pan, heat 2 teaspoons of olive oil on medium until hot. Crack in the eggs, keeping them separate; season with salt and pepper. Cook 1 to 3 minutes, or until the whites are set and the yolks are cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/459\/recipe_steps\/3054\/20140918-1707-8859-3219\/Mexican_20Breakfast-3396_high_feature.jpg","title":" Plate your dish:  ","desc":" Top each cooked quesadilla with a fried egg; season with salt and pepper. Garnish with the seasoned avocado, lime crema, radishes (draining before adding), remaining spice blend and cilantro. Enjoy!  "}]}