{"category":"Lamb","link":"lamb-beef-sliders-with-harissa-labneh-sauce-cucumber-salad","thumb":"\/\/media.blueapron.com\/recipes\/447\/c_main_dish_images\/20140905-1607-112-7290\/Lamb_20Sliders-2540_high_also_thumb.jpg","title":" Lamb &amp; Beef Sliders ","subtitle":" with Harissa-Labneh Sauce &amp; Cucumber Salad ","headbg":"\/\/media.blueapron.com\/recipes\/447\/c_main_dish_images\/20140905-1606-119-5800\/Lamb_20Sliders-2540_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"This spin on an American classic uses a rich blend of lamb and beef to create six flavorful mini burgers. You&rsquo;ll season the patties with aromatics, lemon zest and a mix of traditional Middle Eastern spices. Slathered with labneh cheese (a creamy variety made from yogurt) and harissa (a signature North African spice paste), we&rsquo;re bringing big flavors to these small burgers.","desc":" This spin on an American classic uses a rich blend of lamb and beef to create six flavorful mini burgers. You&rsquo;ll season the patties with aromatics, lemon zest and a mix of traditional Middle Eastern spices. Slathered with labneh cheese (a creamy variety made from yogurt) and harissa (a signature North African spice paste), we&rsquo;re bringing big flavors to these small burgers. ","ingbg":"\/\/media.blueapron.com\/recipes\/447\/ingredient_images\/20140905-2110-3135-1064\/lamb-sliders-W_large_feature.png","ingredients":[" 6  Potato Slider Buns "," 2  Cloves Garlic "," 1  Bunch Mint ","  1  Head Little Gem Lettuce   "," 1  Kirby Cucumber "," 1  Lemon "," 1  Red Onion "," 2  Teaspoons Lamb Slider Spice Blend (Za’Atar Spice & Crushed Aleppo Pepper ","  2  Tablespoons Harissa Paste   ","  ½  Cup Labneh Cheese   "," 10  Ounces Ground Lamb & Beef Mixture "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2963\/20140905-2018-111-2610\/Lamb_20Sliders-2521_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Split the slider buns. Peel the garlic cloves. Mince 1 clove; mince the remaining clove, then smash with the side of your knife until it resembles a paste. Halve the cucumber lengthwise; using a spoon, remove and discard the seeds. Thinly slice the cucumber on an angle. Pick the mint off the stems; discard the stems and finely chop the leaves. Cut off and discard the root of the lettuce; separate the leaves. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest. Quarter the lemon and remove the seeds. Peel and cut the onion in half. Thinly slice one half into rings; small dice the remaining half.  "},{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2964\/20140905-2018-90-9326\/Lamb_20Sliders-2523_high_feature.jpg","title":" Cook the aromatics:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the minced garlic and diced onion; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the spice blend, lemon zest and half the mint. Cook, stirring frequently, 30 seconds to 1 minute, or until toasted and fragrant. Transfer to a plate and spread in a thin layer. Place in the refrigerator to cool. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2965\/20140905-2019-126-7717\/Lamb_20Sliders-2525_high_feature.jpg","title":" Make the salad &amp; sauce:  ","desc":" While the aromatics cool, in a medium bowl, combine the garlic paste, half the labneh, the remaining mint and the juice of 2 lemon wedges; season with salt and pepper to taste. Add the cucumber and as much sliced red onion as you&rsquo;d like (you may have extra); mix until well combined. In a separate small bowl, combine the harissa paste, remaining labneh and the juice of the remaining lemon wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2966\/20140905-2019-117-1620\/Lamb_20Sliders-2526_high_feature.jpg","title":" Assemble &amp; cook the patties:  ","desc":" In a medium bowl, combine the ground meat with the cooled aromatics; season with salt and pepper. Gently mix to incorporate. Divide the mixture into 6 equal parts and flatten into &frac12;-inch-thick patties. In the pan used to cook the aromatics, heat 2 teaspoons of olive oil on high until hot. Add the slider patties and cook, occasionally pressing down with a spatula, 2 to 3 minutes per side, or until cooked to your desired degree of doneness. Transfer to a plate; wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2967\/20140905-2019-186-2495\/Lamb_20Sliders-2527_high_feature.jpg","title":" Toast the buns:  ","desc":" In the same pan used to cook the patties, heat 2 teaspoons of olive oil on medium until hot. Working in batches to avoid overcrowding the pan, add the buns, cut side down, and toast 1 to 2 minutes, or until lightly browned. Transfer the buns to a clean work surface.  "},{"img":"\/\/media.blueapron.com\/recipes\/447\/recipe_steps\/2968\/20140905-2020-192-9235\/Lamb_20Sliders-2529_high_feature.jpg","title":" Assemble &amp; plate your dish:  ","desc":" Divide the lettuce between the tops of each toasted bun. Place 1 burger patty onto the bottom of each toasted bun and top with a spoonful of the harissa-labneh sauce. Serve with the cucumber salad on the side. Enjoy!  "}]}