{"category":"Lamb","link":"lamb-kofte-kebabs-sauteed-chickpeas-and-cucumber-yogurt-sauce","thumb":"\/\/media.blueapron.com\/recipes\/23\/c_main_dish_images\/20140808-1626-156-8111\/For-Print-1105_high_also_thumb.jpg","title":" Lamb Kofte Kebabs ","subtitle":" with Sautéed Chickpeas &amp; Cucumber Yogurt Sauce ","headbg":"\/\/media.blueapron.com\/recipes\/23\/c_main_dish_images\/20140808-1626-156-8111\/For-Print-1105_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"“Kofte” is a popular Middle Eastern dish whose name comes from the Turkish word for “ball.” This preparation is a variation on meatballs, using fresh herbs and traditional cooking methods. Dill and mint mixed into the meat add deep, complex flavor. Cooking the meat on skewers makes them easy to handle and fun to eat!","desc":" “Kofte” is a popular Middle Eastern dish whose name comes from the Turkish word for “ball.” This preparation is a variation on meatballs, using fresh herbs and traditional cooking methods. Dill and mint mixed into the meat add deep, complex flavor. Cooking the meat on skewers makes them easy to handle and fun to eat! ","ingbg":"\/\/media.blueapron.com\/recipes\/23\/ingredient_images\/20140807-2143-96-3103\/lamb-kofte-ing-WEB_large_feature.png","ingredients":[" 3  Cloves Garlic "," 1  15-Ounce Can Chickpeas "," 1  1-Inch Piece Ginger "," 1  Bunch Fresh Dill "," 1  Bunch Mint "," 1  Lemon "," 1  Mini Cucumber "," 1  Shallot "," 1  Yellow Onion "," ½  Cup Plain Low-Fat Yogurt "," 10  Ounces Ground Lamb & Beef Mixture "," ¼  Cup Breadcrumbs "," 4  Wooden Skewers "," 1  Tablespoon Kofte Spice Blend (Turmeric, Cumin & Madras Curry Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2288\/20140723-2023-3510-2119\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":"   \tWash and dry the fresh produce. Peel and mince the garlic then, using the side of your knife, smash until it resembles a paste. Drain and rinse the chickpeas. Peel and mince the ginger and shallot. Pick the mint and dill off the stems; discard the stems and roughly chop the leaves. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of lemon zest. Cut the lemon into 6 wedges and remove the seeds. Small dice the cucumber. Peel and small dice the onion.   "},{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2289\/20140723-2023-5628-6057\/step2_high_feature.jpg","title":" Make the cucumber-yogurt sauce:  ","desc":"   \tIn a small bowl, combine the yogurt, cucumber, lemon zest, half of the mint, half of the dill, the juice of 2 lemon wedges and a pinch of garlic paste (save the rest for the kebabs and vegetables). Season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2290\/20140723-2023-3516-2702\/step3_high_feature.jpg","title":" Make the kebabs:  ","desc":"   \tIn a large bowl, combine the ground lamb and beef mixture, breadcrumbs, half the shallot, a pinch of garlic (save the rest for the vegetables), the remaining dill and remaining mint; season with salt and pepper. Divide the mixture into 4 equal, oblong patties and insert a wooden skewer lengthwise into the center of each.   "},{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2291\/20140723-2023-5634-3406\/step4_high_feature.jpg","title":" Cook the kebabs:  ","desc":"   \tIn a large pan (nonstick, if you have one), heat 2 teaspoons of oil on medium until hot. Add the kebabs and cook 3 to 5 minutes per side, or until browned and cooked through. (Loosely cover the pan with aluminum foil to help the kebabs cook faster.) Transfer the cooked kebabs to a plate, leaving any drippings in the pan. Set the cooked kebabs aside in a warm place.   "},{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2292\/20140723-2023-4698-5973\/step5_high_feature.jpg","title":" Cook the vegetables:  ","desc":"   \tHeat the reserved drippings on medium until hot. Add the ginger, kofte spice blend, onion, remaining shallot and remaining garlic paste. Cook, stirring frequently, 1 to 2 minutes, or until the vegetables have softened and the spices are toasted.   "},{"img":"\/\/media.blueapron.com\/recipes\/23\/recipe_steps\/2293\/20140723-2023-5640-6544\/step6_high_feature.jpg","title":" Finish the chickpeas &amp; plate your dish:  ","desc":"   \tTo the vegetables, add the chickpeas and &frac14; cup of water. Cook, stirring frequently, 2 to 3 minutes, or until the chickpeas are infused with flavor and most of the liquid has cooked off. Remove from the heat and stir in the juice of 2 lemon wedges. Season with salt and pepper to taste. To plate your dish, divide the cooked kebabs and chickpeas between 2 plates. Garnish with the cucumber-yogurt sauce and the remaining lemon wedges. Enjoy!   "}]}