{"category":"Vegetarian","link":"lentil-mushroom-veggie-burgers-with-arugula-salad-aioli","thumb":"\/\/media.blueapron.com\/recipes\/1324\/c_main_dish_images\/20150904-2054-44-0556\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209914_20EDIT_2_high_also_thumb.jpg","title":" Lentil &amp; Mushroom Veggie Burgers ","subtitle":" with Arugula Salad &amp; Aioli ","headbg":"\/\/media.blueapron.com\/recipes\/1324\/c_main_dish_images\/20150904-2053-34-6701\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209914_20EDIT_1_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this Middle Eastern-inspired recipe, we&rsquo;re making za&rsquo;atar-spiced veggie burgers with cremini mushrooms and two different legumes: green lentils and chickpeas. The cooked mushrooms and lentils form a thick batter with egg and chickpea flour, made simply from ground chickpeas. In a hot pan, that batter sets into delicious burgers, turning crispy and brown on the outside. Topped with aioli, arugula and lemon-marinated red onion, these burgers are gourmet through and through. ","ingbg":"\/\/media.blueapron.com\/recipes\/1324\/ingredient_images\/20150902-1623-85-2684\/FV-lentil-mushroom-burger-garlic-aioli-F-W_large_feature.png","ingredients":[" 4  Sesame Seed Buns "," 1  Farm Egg "," ½  Cup Green Lentils "," 6  Ounces Cherry Tomatoes "," 4  Cloves Garlic "," 2  Lemons "," 1  Red Onion "," 6  Ounces Cremini Mushrooms "," ¼  Pound Arugula "," ½  Cup Mayonnaise "," ½  Cup Chickpea Flour ","  1½  Tablespoons Veggie Burger Spice Blend (Za'atar, Ground Sage, Dried Thyme & Dried Rosemary)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5631\/20150812-2118-186-6073\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209895_high_feature.jpg","title":" Cook the lentils:  ","desc":" Preheat the oven to 450&deg;F. Heat a large pot of salted water to boiling on high. Once boiling, add the lentils. Cook 14 to 16 minutes, or until tender. Drain thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5633\/20150902-1626-21-8874\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209893_20EDIT_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" While the lentils cook, wash and dry the fresh produce. Halve the buns. Peel and halve the onion; thinly slice 1 half and small dice the remaining half. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Finely chop the mushrooms. Quarter and deseed the lemons. Halve the tomatoes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5634\/20150812-2118-496-9837\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209898_high_feature.jpg","title":" Cook the aromatics &amp; mushrooms:   ","desc":" While the lentils continue to cook, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the diced onion, spice blend and half the garlic paste; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the mushrooms. Cook, stirring occasionally, 8 to 10 minutes, or until browned and crispy; season with salt and pepper. Transfer to a large bowl to cool slightly. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5635\/20150812-2119-507-2850\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209894_high_feature.jpg","title":" Make the aioli &amp; marinate the onion:   ","desc":" While the aromatics and mushrooms cool, in a small bowl, combine the mayonnaise, remaining garlic paste and the juice of 3 lemon wedges. Stir to thoroughly combine; season with salt and pepper to taste. In a separate small bowl, combine the sliced onion and the juice of the remaining lemon wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5636\/20150812-2119-201-9267\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209899_high_feature.jpg","title":" Make the batter &amp; cook the burgers:   ","desc":" Crack the egg into the bowl of cooled aromatics and mushrooms. Add the cooked lentils and chickpea flour; season with salt and pepper. Stir to form a stiff batter. Divide into 4 equal-sized portions. In the pan used to cook the aromatics and mushrooms, heat 1 tablespoon of olive oil on medium until hot. Using a spoon, transfer the portions of batter to the pan, keeping them separate. Gently press down to flatten into &frac12;-inch-thick burgers. Cook 3 to 4 minutes per side, or until browned and cooked through. Remove from heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/1324\/recipe_steps\/5637\/20150812-2119-364-0813\/FP_071615_2_Lentil_MushroomBurgerswithGarlicAioli_20-_209900_high_feature.jpg","title":" Finish &amp; serve your dish:   ","desc":" While the burgers cook, place the buns on a sheet pan. Toast in the oven 2 to 4 minutes, or until the edges are lightly browned. Transfer to a clean, dry work surface. Spread each toasted bun bottom with a layer of the aioli. Top with a cooked burger, a spoonful of the remaining aioli, a pinch of both the arugula and marinated onion (you will have extra) and a bun top. Transfer to a serving dish. In a large bowl, combine the tomatoes, remaining arugula and marinated onion and a drizzle of olive oil. Toss to coat; season with salt and pepper to taste. Serve with the finished burgers. Enjoy!  "}]}