{"category":"Vegetarian","link":"mixed-mushroom-tacos-with-crispy-avocado-cotija-cheese","thumb":"\/\/media.blueapron.com\/recipes\/1370\/c_main_dish_images\/20150928-2048-186-8958\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203928_high_also_thumb.jpg","title":" Mixed Mushroom Tacos ","subtitle":" with Crispy Avocado &amp; Cotija Cheese ","headbg":"\/\/media.blueapron.com\/recipes\/1370\/c_main_dish_images\/20150928-2049-204-3473\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203927_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  675    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Mushrooms, one of the staple ingredients of autumn, make for a wonderful taco filling. Flavored with authentic Mexican spices, they&rsquo;re hearty and incredibly delicious. Here, we&rsquo;re using two types of mushrooms&mdash;button-topped cremini and ruffled maitake&mdash;and pairing them with an array of tasty toppings. Quick-pickled red onion provides tangy brightness, while battered, pan-fried avocado slices add crispy texture on the outside and creaminess within. When frying the avocado, be sure to work in batches, to keep the oil in the pan nice and hot. Enjoy, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1370\/ingredient_images\/20150928-2050-214-8376\/V2-Mushroom-Tacos-Tempura-Avocado-2P-W_large_feature.png","ingredients":[" 6  Corn Tortillas "," 1  Avocado "," 1  Lime "," 1  Red Onion ","  7  Ounces Mixed Mushrooms   "," 1  Large Bunch Cilantro "," 2  Tablespoons Sugar "," ¼  Cup Crumbled Cotija Cheese ","  ¼  Cup Rice Flour   "," 2  Teaspoons Mushroom Taco Spice Blend (Ancho Chile Powder, Smoked Sweet Paprika, Ground Cumin, Ground Coriander, Garlic Powder & Whole Dried Oregano) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5800\/20150827-2108-386-5778\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203910_high_feature.jpg","title":" Prepare the ingredients  ","desc":" Wash and dry the fresh produce. Peel, halve and thinly slice the onion. Quarter the cremini mushrooms lengthwise. Using your hands, break the maitake mushrooms into bite-sized pieces. Pick the cilantro leaves off the stems; discard the stems. Quarter the lime. Pit and peel the avocado; cut into &frac14;-inch-thick slices. Toss the avocado with the juice of 2 lime wedges to prevent browning.  "},{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5801\/20150827-2108-381-0626\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203911_high_feature.jpg","title":" Pickle the onion  ","desc":" In a large pan (nonstick, if you have one), combine the onion, sugar, a big pinch of salt, &frac14; cup of water and the juice of the remaining lime wedges. Heat to boiling on high. Once boiling, cook, stirring occasionally, 1 to 2 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume. Transfer to a heatproof bowl and set aside to pickle. Carefully rinse and wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5802\/20150827-2108-391-3379\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203912_high_feature.jpg","title":" Cook the mushrooms  ","desc":" In the pan used to pickle the onion, heat 2 teaspoons of olive oil on medium-high until hot. Add the cremini and maitake mushrooms. Cook, stirring occasionally, 6 to 8 minutes, or until browned and crispy. Turn off the heat. Stir in the &frac34; of the spice blend; season with salt and pepper. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5815\/20150827-2108-400-9951\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203914_high_feature.jpg","title":" Make the crispy avocado  ","desc":" In a large bowl, combine the rice flour, remaining spice blend and &frac14; cup of water to create a batter; season with salt and pepper. In the pan used to cook the mushrooms, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a drop of batter sizzles immediately when added to the pan, coat the avocado slices in the batter (letting any excess drip off). Working in batches, add the coated avocado slices to the pan in a single layer. Cook 1 to 3 minutes per side, or until crispy. Transfer to a paper towel-lined plate; immediately season with salt. Carefully discard the oil. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5816\/20150827-2109-405-1824\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203916_high_feature.jpg","title":" Warm the tortillas  ","desc":" Heat the pan used to make the crispy avocado on medium-high until hot. Working in batches, add the tortillas. Warm 30 seconds to 1 minute per side, or until soft and pliable. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1370\/recipe_steps\/5817\/20150827-2109-410-0408\/2P_082515_4_MushroomTacoswithTempuraAvocado_20-_203918_high_feature.jpg","title":" Assemble &amp; plate your dish  ","desc":" Divide the warmed tortillas between 2 plates. Divide the cooked mushrooms, crispy avocado and pickled onion (draining just before adding) between the tortillas. Garnish with the cilantro and cheese. Enjoy!  "}]}