{"category":"Vegetarian","link":"mushroom-fontina-grilled-cheese-sandwiches-with-sweet-pepper-roasted-cauliflower-salad","thumb":"\/\/media.blueapron.com\/recipes\/1329\/c_main_dish_images\/20150812-2115-345-8591\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200777_high_also_thumb.jpg","title":" Mushroom &amp; Fontina Grilled Cheese Sandwiches ","subtitle":" with Sweet Pepper &amp; Roasted Cauliflower Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1329\/c_main_dish_images\/20150812-2115-451-8150\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200776_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" At the heart of what makes grilled cheese so delicious is a simple textural contrast. The crispy bread and melty cheese perfectly complement one another, as do their mild and savory flavors. In this recipe, we&rsquo;re staying true to the classic preparation by assembling the sandwiches and then cooking them on the stove. But we&rsquo;re only using the finest ingredients, from subtly sweet oyster mushrooms to creamy Fontina cheese. And we&rsquo;re pairing the sandwiches with a salad featuring roasted heirloom cauliflower (yours may be either green, white or purple). ","ingbg":"\/\/media.blueapron.com\/recipes\/1329\/ingredient_images\/20150914-2020-115-4855\/V3-mushroom-fontina-grilled-cheese-2P-W_large_feature.png","ingredients":[" 4  Slices Sourdough Bread ","  6  Ounces Fontina Cheese   "," 6  Ounces Oyster Mushrooms "," 4  Sweet Peppers "," 1  Head Heirloom Cauliflower ","  1  Red Onion   "," 1  Bunch Parsley "," 2  Tablespoons Currants "," 2  Tablespoons Red Wine Vinegar "," 2  Tablespoons Sugar "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5644\/20150812-2122-546-0413\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200768_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut out and discard the cauliflower core; cut the head into small florets. Cut off and discard the rind of the Fontina cheese; thinly slice. Cut the mushrooms into small pieces. Cut off and discard the stem ends of the sweet peppers; remove and discard the seeds. Thinly slice the sweet peppers into rings. Peel, halve and thinly slice the onion. Pick the parsley leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5645\/20150812-2123-267-2599\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200772_high_feature.jpg","title":" Roast the cauliflower:  ","desc":" Place the cauliflower on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast 21 to 23 minutes, or until browned and tender when pierced with a knife. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5646\/20150812-2123-424-5484\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200769_high_feature.jpg","title":" Pickle the onion &amp; currants:  ","desc":" While the cauliflower roasts, in a medium pan (nonstick, if you have one), combine the onion, currants, vinegar, sugar, a big pinch of salt and &frac14; cup of water. Heat to boiling on high. Cook, stirring occasionally, 1 to 2 minutes, or until the sugar has dissolved and the liquid is slightly reduced in volume. Transfer the mixture to a heatproof bowl and set aside to pickle. Carefully rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5647\/20150812-2123-282-3140\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200770_high_feature.jpg","title":" Cook the mushrooms:  ","desc":" While the cauliflower continues to roast, in the pan used to pickle the onion and currants, heat 2 teaspoons of olive oil on medium-high until hot. Add the mushrooms. Cook, stirring occasionally, 5 to 7 minutes, or until browned and crispy. Transfer to a paper towel-lined plate and season immediately with salt and pepper. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5648\/20150812-2124-565-5326\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200771_high_feature.jpg","title":" Assemble &amp; cook the sandwiches:  ","desc":" Place the bread slices on a clean, dry work surface. Divide the Fontina cheese and cooked mushrooms between 2 of the bread slices; season with salt and pepper. Top with the remaining bread slices. In the pan used to cook the mushrooms, heat 2 teaspoons of olive oil on medium until hot. Add the sandwiches. Cook 3 to 4 minutes per side, or until golden brown and the cheese has melted. (If the pan seems dry, add an additional teaspoon of olive oil before flipping.) Transfer to a cutting board.  "},{"img":"\/\/media.blueapron.com\/recipes\/1329\/recipe_steps\/5649\/20150812-2124-442-0103\/2P_081115_2_Mushroom_FontinaGrilledCheese_20-_200773_high_feature.jpg","title":" Make the salad &amp; plate your dish:  ","desc":" While the sandwiches cook, in a large bowl, combine the roasted cauliflower, sweet peppers, parsley, pickled onion and currants and as much of the pickling liquid as you&rsquo;d like. Drizzle with olive oil and toss to coat; season with salt and pepper to taste. Slice the cooked sandwiches in half diagonally and divide between 2 plates. Serve with the salad on the side. Enjoy!  "}]}