{"category":"Beef","link":"north-african-beef-tagine-with-zucchini-almond-parsley-couscous","thumb":"\/\/media.blueapron.com\/recipes\/1242\/c_main_dish_images\/20150612-1603-12023-8984\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206604_high_also_thumb.jpg","title":" North African Beef Tagine ","subtitle":" with Zucchini &amp; Almond-Herb Couscous ","headbg":"\/\/media.blueapron.com\/recipes\/1242\/c_main_dish_images\/20150612-1601-11984-1081\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206603_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Tagine, an authentic North African dish, consists of meat, vegetables and spices cooked together and traditionally served with couscous. Here, we&rsquo;re filling our tagine with seasonal zucchini, which adds a refreshing, summery touch to the hearty stew. And we&rsquo;re making our couscous with toasted spices, chopped almonds, fresh herbs and lemon juice. Feel free to spoon the tagine over the absorbent, fluffy couscous, creating a harmony of complex flavors. ","ingbg":"\/\/media.blueapron.com\/recipes\/1242\/ingredient_images\/20150612-1603-12008-9699\/beef-tagine_zucchini_couscous-2p-w_large_feature.png","ingredients":[" 1¼  Pounds Ground Beef "," 1  15-Ounce Can Diced Tomatoes "," 1½  Cups Couscous "," 3  Cloves Garlic "," 1  Pound Zucchinis "," 1  Lemon "," 1  Red Onion "," 1  Bunch Mint "," 1  Bunch Parsley ","  3  Medjool Dates   "," ¼  Cup Sliced Almonds ","  1½  Tablespoons Beef Tagine Spice Blend (Ras El Hanout & Turmeric)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5110\/20150612-1612-12111-6475\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206583_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Wash and dry the fresh produce. Peel and thinly slice the garlic. Trim off and discard the stem ends of the zucchinis; medium dice the zucchinis. Peel and small dice the onion. Using your hands, remove and discard the date pits; roughly chop the dates. Roughly chop the almonds. Pick the parsley and mint leaves off the stems; discard the stems. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5111\/20150612-1612-12127-1948\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206606_high_feature.jpg","title":" Cook the couscous:   ","desc":" In a large pot, heat 1 tablespoon of olive oil on medium-high until hot. Add half the garlic and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 1 to 3 minutes, or until softened and fragrant. Add the couscous and 1&frac12; cups of water. Heat to boiling on high. Once boiling, cover and turn off the heat. Let stand for 6 to 8 minutes, or until the liquid has been absorbed and the couscous is tender. Set aside in a warm place. Fluff the cooked couscous with a fork.   "},{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5112\/20150612-1613-12150-2307\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206584_high_feature.jpg","title":" Cook the beef:   ","desc":" While the couscous cooks, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the ground beef; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 6 minutes, or until browned and cooked through. Carefully drain off and discard the drippings. Transfer the cooked beef to a bowl, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5113\/20150612-1613-12165-3541\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206585_high_feature.jpg","title":" Cook the vegetables:  ","desc":" Add 1 tablespoon of olive oil to the pan of reserved fond. Heat on medium-high until hot. Add the zucchinis, onion, remaining garlic and remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until lightly browned and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5114\/20150612-1613-12180-0332\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206586_high_feature.jpg","title":" Make the tagine:   ","desc":" Add the cooked beef, tomatoes, dates and 1 cup of water to the pan of vegetables; season with salt and pepper. Simmer, stirring occasionally, 12 to 14 minutes, or until heated through and the liquid is slightly reduced in volume. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1242\/recipe_steps\/5115\/20150612-1613-12191-6071\/FP_060315_4_20Beef_20Tagine_20with_20Zucchini_20__20Couscous_20Salad_20-_206587_high_feature.jpg","title":" Finish the couscous &amp; serve your dish:  ","desc":" Once the tagine has simmered for about 10 minutes, to the pot of cooked couscous, add the almonds, half of both the parsley and the mint (roughly chopping the leaves just before adding) and the juice of all 4 lemon wedges. Drizzle with olive oil and stir to thoroughly combine; season with salt and pepper to taste. Transfer the finished couscous to a serving dish. Garnish the tagine with the remaining parsley and mint. Enjoy!  "}]}