{"category":"Fish","link":"pan-seared-salmon-with-summer-panzanella-opal-basil","thumb":"\/\/media.blueapron.com\/recipes\/1273\/c_main_dish_images\/20150731-1757-107-0720\/2P_063015_3-_R070915_2-_R072215_6-_R073115_1_20salmon_20panzanella-0396_high_also_thumb.jpg","title":" Seared Salmon &amp; Panzanella ","subtitle":" with Corn, Shishito Peppers &amp; Thai Basil ","headbg":"\/\/media.blueapron.com\/recipes\/1273\/c_main_dish_images\/20150731-1756-91-7783\/2P_063015_3-_R070915_2-_R072215_6-_R073115_1_20salmon_20panzanella-0398_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  560    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" When it comes to warm-weather vegetables, vivid colors often mean amazing taste. That&rsquo;s true of the vegetables in this summer panzanella, served alongside seared salmon fillets. A traditional Tuscan salad made with crispy bread, panzanella is designed to feature the best produce on the market. Our version combines corn, plum tomatoes and an heirloom cucumber, as well as two specialty ingredients: shishito peppers and Thai basil. Shishitos are sweet and generally mild, but about one in every ten is hot (so be careful)! Thai basil is a cooling, anise-like variety of the herb that perfectly completes the salad. ","ingbg":"\/\/media.blueapron.com\/recipes\/1273\/ingredient_images\/20150804-1515-73-5507\/Pan-Seared-Salmon-with-Summer-Panzanella-_-Opal-Basil-2P-W_large_feature.png","ingredients":[" 2  Salmon Fillets "," 1  Small Baguette ","  1  Ear Of Corn   "," 2  Plum Tomatoes "," 1  Clove Garlic "," 1  Heirloom Cucumber "," 1  Ounce Shishito Peppers "," 1  Bunch Thai Basil "," 2  Ounces Castelvetrano Olives "," 2  Tablespoons Red Wine Vinegar "," 1  Shallot "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5308\/20150731-1806-45-0040\/2P_063015_3_Pan-Seared-Salmon-with-Summer-Panzanella-_-Opal-Basil---8051-EDIT_202_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 400&deg;F. Wash and dry the fresh produce. Halve the baguette lengthwise. Peel the garlic. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Large dice the tomatoes. Cut off and discard the ends of the cucumber; medium dice. Remove and discard the shishito pepper stems; halve the shishitos on an angle. Pick the basil leaves off the stems; discard the stems. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop. Peel and thinly slice the shallot; place in a bowl with the vinegar.  "},{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5309\/20150731-1806-60-3373\/2P_063015_3_Pan-Seared_20Salmon_20with_20Summer_20Panzanella_20__20Opal_20Basil_20-_208054_high_feature.jpg","title":" Make the garlic croutons:  ","desc":" Place the baguette halves on a sheet pan, cut sides up; drizzle with olive oil and season with salt and pepper. Toast in the oven 8 to 10 minutes, or until golden brown and crispy. Remove from the oven. When cool enough to handle, rub the cut sides of the toasted baguette halves with the garlic clove; discard the garlic clove. Transfer to a clean, dry work surface. Large dice the baguette halves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5310\/20150708-2040-494-4552\/2P_063015_3_Pan-Seared_20Salmon_20with_20Summer_20Panzanella_20__20Opal_20Basil_20-_208052_high_feature.jpg","title":" Cook the corn:  ","desc":" While the baguette halves toast, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the corn; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened. Transfer to a large bowl.  "},{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5311\/20150731-1806-71-5253\/2P_063015_3_Pan-Seared_20Salmon_20with_20Summer_20Panzanella_20__20Opal_20Basil_20-_208053_high_feature.jpg","title":" Cook the shishito peppers:  ","desc":" In the pan used to cook the corn, heat 2 teaspoons of olive oil on medium-high until hot. Add the shishito peppers; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until browned on all sides. Transfer to the bowl of cooked corn.  "},{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5312\/20150731-1806-87-8267\/2P_063015_3_R070915_2_R072215_6_PanSearedSalmonwithSummerPanzanella_20-_209910_high_feature.jpg","title":" Cook the salmon:  ","desc":" Pat the salmon dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the shishito peppers, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned salmon, skin sides down first. Cook 3 to 5 minutes per side, or until lightly browned and cooked to your desired degree of doneness.  "},{"img":"\/\/media.blueapron.com\/recipes\/1273\/recipe_steps\/5313\/20150731-1807-98-5501\/2P_063015_3-_R070915_2-_R072215_6-_R073115_1_20salmon_20panzanella-0390_high_feature.jpg","title":" Make the panzanella &amp; plate your dish:  ","desc":" Add the garlic croutons, tomatoes, cucumber, olives and basil to the bowl of cooked corn and shishito peppers; season with salt and pepper. Add the shallot-vinegar mixture and a drizzle of olive oil. Toss to thoroughly combine and season with salt and pepper to taste. Divide the cooked salmon and panzanella between 2 plates. Enjoy!  "}]}