{"category":"Pork","link":"pork-tenderloin-with-rhubarb-chutney-asparagus","thumb":"\/\/media.blueapron.com\/recipes\/165\/c_main_dish_images\/20140808-1930-594-1715\/Pork_20Tenderloin_20Rhubarb_20Chutney-3510_high_also_thumb.jpg","title":" Seared Pork Medallions ","subtitle":" with Rhubarb Chutney &amp; Sautéed Freekah ","headbg":"\/\/media.blueapron.com\/recipes\/165\/c_main_dish_images\/20140808-1930-594-1715\/Pork_20Tenderloin_20Rhubarb_20Chutney-3510_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  585    Per Serving ","time":"We’re reclaiming rhubarb. Often called the “pie plant,” these crisp, tart stalks are most commonly found paired with sweet fruit and baked in buttery crusts. And while we love pies, we think rhubarb deserves a place at the dinner table. In this recipe, you’ll simmer it with honey, ginger and lemon juice to create a delightful, gorgeous condiment for juicy pork medallions.","desc":" We’re reclaiming rhubarb. Often called the “pie plant,” these crisp, tart stalks are most commonly found paired with sweet fruit and baked in buttery crusts. And while we love pies, we think rhubarb deserves a place at the dinner table. In this recipe, you’ll simmer it with honey, ginger and lemon juice to create a delightful, gorgeous condiment for juicy pork medallions. ","ingbg":"\/\/media.blueapron.com\/recipes\/165\/ingredient_images\/20140807-2154-372-6040\/pork-tenderloin-rhubarb-ing-WEB_large_feature.png","ingredients":[" 6  Ounces Rhubarb "," 1  1-Inch Piece Ginger "," 1  Bunch Thyme "," 1  Lemon "," ½  Bunch Asparagus "," ¼  Cup Whole Almonds "," ½  Cup Cracked Freekah "," 6  Pork Tenderloin Medallions "," 2  Tablespoons Honey "," 3  Tablespoons Currants "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2514\/20140725-2015-624-7657\/Pork_20Tenderloin_20Rhubarb_20Chutney-3502_high_feature.jpg","title":" Cook the freekah:  ","desc":"   \tHeat a medium pot of salted water to boiling on high. Add the cracked freekah and cook 22 to 25 minutes, or until tender and cooked through. Drain thoroughly and set aside as you continue cooking.   "},{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2515\/20140725-2016-744-9658\/Pork_20Tenderloin_20Rhubarb_20Chutney-3497_high_feature.jpg","title":" Prepare the ingredients:  ","desc":"   \tWhile the freekah cooks, wash and dry the fresh produce. Cut the rhubarb into &frac34;-inch pieces . Peel and mince the ginger. Pick the thyme leaves off the stems; discard the stems. Using a peeler, remove the rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest. Quarter the lemon and remove the seeds. Trim off and discard the woody ends of the asparagus; cut the asparagus into 2-inch pieces. Roughly chop the almonds.   "},{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2516\/20140725-2014-714-2778\/Pork_20Tenderloin_20Rhubarb_20Chutney-3505_high_feature.jpg","title":" Make the rhubarb chutney:  ","desc":"   \tWhile the freekah continues to cook, in a small pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the ginger and cook, stirring frequently, 30 seconds to 1 minute, or until softened. Add the rhubarb, honey, lemon zest and the juice of 2 lemon wedges. Bring the mixture to a simmer then reduce the heat to medium. Simmer, stirring occasionally, 12 to 15 minutes, or until saucy and thickened. Remove from heat and stir in 1 teaspoon of olive oil; season with salt and pepper to taste and set aside.   "},{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2517\/20140725-2014-708-6189\/Pork_20Tenderloin_20Rhubarb_20Chutney-3498_high_feature.jpg","title":" Cook the pork:  ","desc":"   \tWhile the chutney simmers, pat the pork medallions dry with paper towels, then season with salt and pepper on both sides. In a large pan, heat 2 teaspoons of olive oil on medium until hot. Add the seasoned pork medallions and cook, loosely covering the pan with aluminum foil, 3 to 4 minutes per side, or until browned and the juice runs clear. Transfer the cooked pork to a plate, leaving any drippings in the pan. Set the pork aside to rest as you continue cooking.   "},{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2518\/20140725-2015-720-0994\/Pork_20Tenderloin_20Rhubarb_20Chutney-3500_high_feature.jpg","title":" Toast the almonds:  ","desc":"   \tWhile the pork rests, heat the reserved pork drippings on medium until hot. Add the almonds and toast, stirring frequently, 1 to 2 minutes, or until browned and fragrant.   "},{"img":"\/\/media.blueapron.com\/recipes\/165\/recipe_steps\/2519\/20140725-2015-630-4640\/Pork_20Tenderloin_20Rhubarb_20Chutney-3504_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":"   \tTo the pan of almonds, add the asparagus and season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until softened and bright green. Add the currants, cooked freekah and thyme; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until well combined; season with salt and pepper to taste. Remove from heat. To plate your dish, add any juices from the cooked pork to the freekah, then divide the pork medallions and freekah between 2 plates. Top with the rhubarb chutney and garnish with the remaining lemon wedges. Enjoy!   "}]}