{"category":"Pork","link":"pork-ramen-with-fresh-ramen-noodles-summer-vegetables","thumb":"\/\/media.blueapron.com\/recipes\/1317\/c_main_dish_images\/20150819-1555-43-8938\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20EDIT_20-_208537_high_also_thumb.jpg","title":" Pork Ramen ","subtitle":" with Fresh Ramen Noodles &amp; Summer Vegetables ","headbg":"\/\/media.blueapron.com\/recipes\/1317\/c_main_dish_images\/20150819-1554-31-0813\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20EDIT_20-_208536_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this seasonal take on a Japanese standard, we&rsquo;re serving up a delicious version of yakibuta ramen. Yakibuta (Japanese for &ldquo;roast pork&rdquo;) is a classic preparation similar to char siu, a Cantonese-style Chinese dish. The pork is seared and roasted, then sliced thinly and used in all kinds of dishes&mdash;accenting the ingredients around it with its signature richness. Here, we&rsquo;re serving it with tender ramen noodles, a flavorful broth and seasonal produce, including eggplant and delicate microgreens (the nutritious early sprouts of leafy vegetables). ","ingbg":"\/\/media.blueapron.com\/recipes\/1317\/ingredient_images\/20150827-1842-68-0721\/M-pork-ramen-2P-W_large_feature.png","ingredients":[" 1  Pork Roast "," ¾  Pound Fresh Ramen Noodles "," 2  Scallions "," 1  Ear Of Corn "," 1  Eggplant "," ¼  Ounce Microgreens "," 2  Tablespoons Pork Demi-Glace "," 2  Tablespoons Rice Vinegar ","  1  1-Inch Piece Ginger   "," 2  Tablespoons Soy Glaze "," 1  Teaspoon Pork Ramen Spice Blend (Black Sesame Seeds, White Sesame Seeds, Kibbled Nori & Sansho Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5558\/20150819-1544-89-0034\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20EDIT_20-_208525_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Trim off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Cut off and discard the stem end of the eggplant; cut the eggplant into &frac12;-inch-thick rounds. Peel and mince the ginger.  "},{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5559\/20150806-1932-38-9148\/2P_071015_2_R_072415_1_PorkRamenwithFreshRamenNoodles_20-_209972_high_feature.jpg","title":" Sear &amp; roast the pork:  ","desc":" Remove and discard any netting from the pork; pat dry with paper towels and season with salt and pepper on all sides. In a large pan, heat 2 teaspoons of oil on medium-high until hot. Add the seasoned pork. Cook, turning occasionally, 4 to 6 minutes per side, or until evenly browned. Transfer to a foil-lined sheet pan. Roast the seared pork 10 to 12 minutes, or until cooked through. (An instant-read thermometer should register 145&deg;F.) Remove from the oven and transfer to a cutting board. Let rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5560\/20150819-1544-115-8734\/2P_081815_SearedPorkRamenwithFreshRamenNoodles_20-_200997_high_feature.jpg","title":" Brown the eggplant:  ","desc":" While the pork roasts, wipe out the pan used to sear the pork. Add 2 teaspoons of oil; heat on medium-high until hot. Add the eggplant in a single layer; season with salt and pepper. Cook, flipping occasionally, 5 to 7 minutes, or until browned and tender. Season with salt and pepper to taste. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5561\/20150806-1932-75-9957\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20-_208528_high_feature.jpg","title":" Make the broth:  ","desc":" While the pork continues to roast, add 2 teaspoons of oil to the pan used to brown the eggplant. Heat on medium until hot. Add the ginger and white bottoms of the scallions; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Add the corn, soy glaze, vinegar, demi-glace and 2 cups of water; season with salt and pepper. Bring to a simmer and cook, stirring occasionally, 4 to 6 minutes, or until thoroughly combined. Remove from heat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5562\/20150806-1932-86-8435\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20-_208529_high_feature.jpg","title":" Cook the noodles:  ","desc":" While the broth simmers, add the noodles to the pot of boiling water, stirring gently to separate. Cook, stirring occasionally, 2 to 3 minutes, or until tender. Drain thoroughly and rinse under warm water. Divide between 2 bowls.  "},{"img":"\/\/media.blueapron.com\/recipes\/1317\/recipe_steps\/5563\/20150819-1544-100-9564\/2P_071015_2_SearedPorkRamenwithFreshRamenNoodles_20EDIT_20-_208530_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Find the lines of muscle (or grain) of the rested pork; thinly slice crosswise against the grain. Stir any juices from the cutting board into the broth. Divide the finished broth between the 2 bowls of cooked noodles. Top with the browned eggplant and sliced pork. Garnish with the spice blend, green tops of the scallions and microgreens. Enjoy!  "}]}