{"category":"Pork","link":"pork-dan-dan-noodles-with-kohlrabi-garlic-peanuts","thumb":"\/\/media.blueapron.com\/recipes\/646\/c_main_dish_images\/20150223-2105-2495-4858\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208578_high_also_thumb.jpg","title":" Pork Dan Dan Noodles  ","subtitle":" with Watermelon Radish &amp; Garlic-Lime Peanuts  ","headbg":"\/\/media.blueapron.com\/recipes\/646\/c_main_dish_images\/20150223-2105-1744-4779\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208574_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Traditionally a soupy, spicy combination of minced pork, noodles, chile paste and Sichuan pepper, dan dan originated in China as street food. Its name refers to the bamboo poles vendors used to carry it around in baskets, trailing its enticing aroma through the streets. The dish has endured not because of its portability, but because of its delicious flavors and easy preparation. In our version, we&rsquo;re sticking to authentic spices, and dressing the noodles up with gorgeous matchticks of heirloom watermelon radish. ","ingbg":"\/\/media.blueapron.com\/recipes\/646\/ingredient_images\/20150227-1850-292-1892\/pork-dandan-noodles-2p-w2_large_feature.png","ingredients":[" 8  Ounces Ground Pork "," 4  Ounces Canton Noodles "," 2  Cloves Garlic "," 2  Scallions "," 1  Lime "," 1  Watermelon Radish "," 2  Tablespoons Peanut Butter ","  2  Teaspoons Dan Dan Spice Blend (Light Brown Sugar, Ground Ginger, Ground Sichuan Peppercorn & White Pepper)   ","  2  Teaspoons Soy Sauce   "," 1  Tablespoon Peanuts "," 2  Tablespoons Doubanjiang Paste "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4081\/20150227-1855-6357-3222\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208559_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Cut off and discard the root ends of the scallions; thinly slice on an angle, separating the white bottoms and green tops. Using a peeler, remove the rind of the lime, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter the lime. Trim off and discard the ends of the watermelon radish; cut into matchsticks. Roughly chop the peanuts. In a medium bowl, whisk together the peanut butter, soy sauce, &frac14; cup of water and as much of the doubanjiang paste as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be.  "},{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4082\/20150227-1856-12-6590\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208562_high_feature.jpg","title":" Make the garlic-lime peanuts:  ","desc":" In a medium pan, heat 2 teaspoons of oil on medium until hot. Add half the garlic. Cook, stirring frequently, 30 seconds to 1 minute, or until golden brown. Reduce the heat to low and add the peanuts. Cook, stirring frequently, 30 seconds to 1 minute, or until the peanuts are thoroughly coated. Add the lime zest; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Transfer to a paper towel-lined plate and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4083\/20150227-1856-19-3801\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208564_high_feature.jpg","title":" Cook the pork:  ","desc":" In the same pan used to make the garlic-lime peanuts, heat 2 teaspoons of oil on medium-high until hot. Add the ground pork and season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 4 minutes, or until lightly browned. Drain off and discard the drippings. Transfer the cooked pork to a bowl and set aside, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4084\/20150227-1857-6396-2366\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208565_high_feature.jpg","title":" Make the sauce:  ","desc":" Add 2 teaspoons of oil to the pan of reserved fond and heat on medium-high until hot. Add the white bottoms of the scallions, remaining garlic and the spice blend. Cook, stirring frequently, 1 to 2 minutes, or until slightly softened and fragrant. Add the peanut butter mixture, the juice of 2 lime wedges and &frac34; cup of water; stir to thoroughly combine. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4085\/20150227-1857-26-2352\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208569_high_feature.jpg","title":" Cook the noodles:  ","desc":" Add the noodles to the pot of boiling water. Cook 2 to 3 minutes, or until tender. Drain thoroughly and rinse under warm water to prevent the noodles from sticking together.   "},{"img":"\/\/media.blueapron.com\/recipes\/646\/recipe_steps\/4086\/20150227-1857-6407-3391\/2P_012215_6_20Dan_20Dan_20Noodles_20-_208570_high_feature.jpg","title":" Plate your dish:  ","desc":" Add the cooked pork and cooked noodles to the pan of sauce. Cook on medium-high, stirring occasionally, 2 to 3 minutes, or until thoroughly combined and heated through. Divide the finished pork and noodles between 2 dishes. Garnish with the watermelon radish, green tops of the scallions, garlic-lime peanuts and remaining lime wedges. Enjoy!  "}]}