{"category":"Vegetarian","link":"queso-pepper-arepas-with-kale-salad","thumb":"\/\/media.blueapron.com\/recipes\/167\/c_main_dish_images\/20150903-2134-32-7646\/Queso_20Pepper_20Arepas-6290_high_also_thumb.jpg","title":" Queso &amp; Pepper Arepas ","subtitle":" with Kale-Avocado Salad &amp; Chimichurri ","headbg":"\/\/media.blueapron.com\/recipes\/167\/c_main_dish_images\/20150903-2133-21-4615\/Queso_20Pepper_20Arepas-6289_splash_feature.jpg","portions":" Makes:  3 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Arepas are flatbreads made from masarepa (maize flour). They&rsquo;re most popular in Colombia and Venezuela, where arepas have been part of the region&rsquo;s cuisine for centuries. The word &ldquo;arepa&rdquo; comes from a local indigenous language and means, roughly, &ldquo;cornbread.&rdquo; These moist cakes with crispy crusts are traditionally sliced and stuffed. In our version, you&rsquo;ll fill them with saut&eacute;ed bell and poblano peppers, seared queso para fre&iacute;r (a delicious semi-hard cheese) and the intensely flavorful herb sauce chimichurri. You&rsquo;ll also serve them with a tasty, hearty salad of kale, avocado and almonds. ","ingbg":"\/\/media.blueapron.com\/recipes\/167\/ingredient_images\/20151006-1749-67-3797\/queso-kale-arepas-WEB_large_feature.png","ingredients":[" 4  Ounces Queso Para Freír "," 1½  Cups Masarepa "," 2  Cloves Garlic "," 1  Avocado "," 1  Bunch Lacinato Kale "," 1  Lime "," 1  Poblano Pepper "," 1  Red Bell Pepper "," 1  Bunch Cilantro "," 1  Bunch Parsley "," 2  Tablespoons Sliced Almonds "," 1  Tablespoon Mayonnaise "," 1  Tablespoon White Wine Vinegar "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/583\/891ecb7b-6be1-4bb1-b38c-196c72c1efd1\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 400&deg;F. Wash and dry the fresh produce. Using a peeler, remove the lime rind, avoiding the white pith; mince to get 2 teaspoons of zest. Quarter the lime. Remove and discard the kale stems; thinly slice the leaves. Remove and discard the stems, ribs and seeds of the bell and poblano peppers; cut into large pieces. Slice the queso into 6 planks. Peel and mince the garlic; using the side of your knife, smash until it resembles a paste (or use a zester). Roughly chop the almonds. Pit, peel and thinly slice the avocado; top with the juice of 2 lime wedges. Mince the parsley and cilantro leaves and stems; place in a bowl and drizzle with olive oil.  "},{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/584\/785df330-998f-4518-8912-f826f2a48c02\/step2_high_feature.jpg","title":" Make the dough &amp; form the arepas:  ","desc":" In a large bowl, combine the masarepa, lime zest, 1&frac12; cups of lukewarm water and 1 teaspoon of olive oil. Season with salt and pepper; stir to form a stiff dough. Transfer to a clean, dry work surface. Using your hands, knead the dough for 20 to 30 seconds, or until smooth. Form into 6 equal-sized balls. Flatten the balls with the palm of your hand to create &frac12;-inch-thick discs.  "},{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/585\/66a03fdc-f36f-42b8-a718-7c65cd6c0255\/step3_high_feature.jpg","title":" Cook the arepas:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the arepas. Cook 3 to 4 minutes per side, or until lightly browned. Transfer to an oiled sheet pan. Bake 13 to 15 minutes, or until cooked through. (To test the doneness of your arepas, cut a small slit into their centers. The insides should be moist, but not gooey.) Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/586\/4516a0d6-17f3-4dc3-9af2-932cd73fa742\/step4_high_feature.jpg","title":" Cook the peppers &amp; queso:  ","desc":" While the arepas bake, wipe out the pan used to brown the arepas. Add 2 teaspoons of olive oil; heat on medium-high until hot. Add the bell and poblano peppers; season with salt and pepper. Cook, turning occasionally, 2 to 3 minutes, or until softened. Add the queso. Cook 1 to 3 minutes per side, or until browned. Remove from heat and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/587\/77ea5053-1acf-422b-be91-64cc1c6fcbe4\/step5_high_feature.jpg","title":" Make the dressing &amp; salad:  ","desc":" While the arepas continue to bake, in a small bowl, combine the mayonnaise, half the garlic paste, the juice of the remaining lime wedges and a drizzle of olive oil; stir to thoroughly combine and season with salt and pepper to taste. In a medium bowl, combine the kale, avocado and almonds. Add as much of the dressing as you&rsquo;d like (you may have extra); toss to coat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/167\/recipe_steps\/588\/aeaf39ed-ecc9-4cc7-8c59-d36bf5d6f370\/step6_high_feature.jpg","title":" Make the chimichurri &amp; plate your dish:  ","desc":" In a bowl, combine the dressed parsley and cilantro, vinegar, remaining garlic paste and 2 tablespoons of olive oil; season with salt and pepper to taste. Halve the baked arepas horizontally; spread a thin layer of the chimichurri onto the cut sides. Divide the cooked peppers and queso between the arepa bottoms. Top with a spoonful of chimichurri and the arepa tops. Serve with the salad and any remaining chimichurri on the side. Enjoy!  "}]}