{"category":"Vegetarian","link":"quinoa-black-bean-burgers-with-sweet-potato-oven-fries-garlic-lime-sauce","thumb":"\/\/media.blueapron.com\/recipes\/1359\/c_main_dish_images\/20150908-2008-75-6891\/FP_090215_1_BlackBeanQuinoaBurgers-0222_high_also_thumb.jpg","title":" Quinoa &amp; Black Bean Burgers ","subtitle":" with Sweet Potato Oven Fries &amp; Garlic-Lime Sauce ","headbg":"\/\/media.blueapron.com\/recipes\/1359\/c_main_dish_images\/20150908-2007-66-0962\/FP_090215_1_BlackBeanQuinoaBurgers-0221_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  570    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chefs, this recipe does veggie burgers right. We&rsquo;re using red quinoa and smashed black beans to make burgers that stay creamy on the inside while crisping up on the outside. Two kinds of chile powder lend the burgers a kick of heat, while chopped dates balance the spices with a hint of fruity sweetness. Topped with avocado and a cool sauce of lime-seasoned sour cream&shy;, these burgers are sure to hit the spot. And we&rsquo;re serving them, of course, with a side of &ldquo;fries&rdquo;&mdash;sweet potatoes roasted in the oven, for a lighter touch. ","ingbg":"\/\/media.blueapron.com\/recipes\/1359\/ingredient_images\/20150910-2017-273-6728\/FV-Black-Bean-Quinoa-Burgers-F-W_large_feature.png","ingredients":[" 1  Farm Egg "," 4  Potato Buns "," 1¼  Cups Black Beans "," 3  Cloves Garlic "," 1  Pound Sweet Potatoes "," 1  Avocado "," 1  Lime "," 1  Large Bunch Cilantro ","  2  Ounces Medjool Dates   "," ⅓  Cup Sour Cream "," ¼  Cup Red Quinoa ","  ¼  Cup Black Bean Burger Spice Blend (Chickpea Flour, Smoked Sweet Paprika, Ancho Chile Powder, Dried Thyme & Chipotle Chile Powder)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5667\/20150910-2017-282-9548\/FP_090215_1_BlackBeanQuinoaBurgers-0202_high_feature.jpg","title":" Cook the quinoa:  ","desc":" Preheat the oven to 475&deg;F. Heat a small pot of salted water to boiling on high. Thoroughly rinse the quinoa. Once the pot of water is boiling, add the rinsed quinoa. Cook 14 to 16 minutes, or until tender. Drain thoroughly and rinse under cold water.  "},{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5668\/20150910-2018-292-5217\/FP_090215_1_BlackBeanQuinoaBurgers-0201_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the quinoa cooks, wash and dry the fresh produce. Halve the buns. Cut the sweet potatoes into &frac12;-inch-thick sticks. Peel and mince the garlic; smash with the side of your knife until it resembles a paste (or use a zester). Drain and rinse the beans; place in a large bowl. Smash the rinsed beans with a fork until they resemble a coarse paste. Pit and finely chop the dates. Pick the cilantro leaves off the stems; discard the stems. Quarter the lime. Pit, peel and thinly slice the avocado; top with the juice of 1 lime wedge.  "},{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5669\/20150910-2018-297-8884\/FP_090215_1_BlackBeanQuinoaBurgers-0204_high_feature.jpg","title":" Roast the sweet potatoes:  ","desc":" Place the sweet potatoes on a sheet pan. Drizzle with olive oil; season with salt, pepper and &frac14; of the spice blend. Toss to thoroughly coat. Arrange in a single, even layer. Roast 18 to 20 minutes, or until browned and tender when pierced with a fork. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5670\/20150910-2018-306-4585\/FP_090215_1_BlackBeanQuinoaBurgers-0203_high_feature.jpg","title":" Form the burgers &amp; make the garlic-lime sauce:  ","desc":" While the sweet potatoes roast, crack the egg into the bowl of smashed beans. Add the cooked quinoa, dates, &frac34; of the garlic paste and the remaining spice blend. Season with salt and pepper; stir to thoroughly combine. Using your hands, form the mixture into four 1-inch-thick burgers and place on a plate. In a bowl, combine the sour cream, remaining garlic paste and the juice of the remaining lime wedges. Stir to combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5671\/20150910-2018-311-1194\/FP_090215_1_BlackBeanQuinoaBurgers-0205_20EDIT_high_feature.jpg","title":" Cook the burgers:  ","desc":" While the sweet potatoes continue to roast, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Carefully add the burgers, keeping them separate. Cook 4 to 6 minutes per side, or until crispy and cooked through. Transfer to a paper towel-lined plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1359\/recipe_steps\/5672\/20150910-2018-316-4352\/FP_090215_1_BlackBeanQuinoaBurgers-0206_high_feature.jpg","title":" Toast the buns &amp; plate your dish:  ","desc":" In the pan used to cook the burgers, heat 2 teaspoons of olive oil on medium-high until hot. Working in batches, add the buns, cut sides down. Toast 1 to 2 minutes, or until crispy and browned. Transfer to a plate. Divide the cooked burgers between the toasted bun bottoms. Top with the garlic-lime sauce, avocado, cilantro and bun tops. Divide between 4 plates and serve with the roasted sweet potatoes on the side. Enjoy!  "}]}