{"category":"Fish","link":"rice-flake-crusted-hake-with-sauteed-daikon-yuzu-white-soy-sauce","thumb":"\/\/media.blueapron.com\/recipes\/1157\/c_main_dish_images\/20150428-2118-498-8420\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200295_high_also_thumb.jpg","title":" Rice Flake-Crusted Hake ","subtitle":" with Sautéed Daikon Radish &amp; Yuzu-Soy Sauce ","headbg":"\/\/media.blueapron.com\/recipes\/1157\/c_main_dish_images\/20150428-2117-487-1477\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200297_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, we&rsquo;re creating a flavorful sauce using two incredible Japanese ingredients. Yuzu is the juice of an amazingly aromatic citrus fruit native to Eastern Asia. It&rsquo;s tart and sweet, a bright accent to any dish. We&rsquo;re combining it with light soy sauce (also called usukuchi). Though slightly bolder in flavor than its darker counterparts, it contains vinegar, making it tangier, too. This highlights the tartness of the yuzu and provides a counterpoint to its sweetness. As a sauce for rice flake-crusted hake, the combination is light, without sacrificing flavor. ","ingbg":"\/\/media.blueapron.com\/recipes\/1157\/ingredient_images\/20150429-2024-3383-0301\/rice-flake-hake-2p-w_large_feature.png","ingredients":[" 2  Hake Fillets "," ½  Cup Rice Flakes "," 3  Ounces Shiitake Mushrooms "," 5  Ounces Daikon Radish "," 2  Cloves Garlic "," ½  Bunch Yu Choy "," 2  Tablespoons Sesame Oil ","  1  Tablespoon Yuzu Juice   "," 2  Tablespoons Light Soy Sauce ","  1  1-Inch Piece Ginger   "," 1  Tablespoon Wasabi Powder "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4651\/20150428-2120-532-0194\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200271_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut off and discard the mushroom stems; leave the caps whole. Slice the radish into &frac12;-inch-thick rounds. Peel and mince the garlic and ginger. Cut off and discard the root ends of the yu choy. In a small bowl, combine the wasabi powder and 1 tablespoon of water.  "},{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4652\/20150428-2120-543-4850\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200272_high_feature.jpg","title":" Cook the mushrooms:  ","desc":" In a medium pan (nonstick, if you have one), heat 2 teaspoons of oil on medium-high until hot. Add the mushrooms and cook, flipping occasionally, 4 to 6 minutes, or until browned. Transfer to a large bowl and set aside, without wiping out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4653\/20150428-2120-554-2091\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200274_high_feature.jpg","title":" Cook the vegetables:  ","desc":" In the pan used to cook the mushrooms, heat 2 teaspoons of oil on medium-high until hot. Add the radish in a single layer. Cook 2 to 4 minutes per side, or until browned. Add the garlic and ginger; cook, stirring frequently, 30 to 45 seconds, or until fragrant. Add the yu choy, half the sesame oil and 2 tablespoons of water. Cook, stirring frequently, 1 to 2 minutes, or until the yu choy has wilted and the liquid has evaporated. Transfer to the bowl of cooked mushrooms and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4654\/20150428-2120-565-5893\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200276_high_feature.jpg","title":" Coat the hake:  ","desc":" Place the rice flakes on a plate. Pat the hake fillets dry with paper towels and season with salt and pepper on both sides. Working 1 at a time, thoroughly coat the seasoned fillets in the remaining sesame oil, letting the excess drip off. Firmly press both sides of the coated fillets into the rice flakes, shaking the excess off. Transfer the coated fillets to a plate.   "},{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4655\/20150428-2121-580-7343\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200277_high_feature.jpg","title":" Cook the hake:  ","desc":" In the pan used to cook the vegetables, heat 2 teaspoons of oil on medium-high until hot. Add the coated hake fillets. Cook 3 to 5 minutes per side, or until the rice flakes are browned and crispy and the hake is cooked through. (Some of the rice flakes may fall off during the cooking process.) Transfer to a plate and set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1157\/recipe_steps\/4656\/20150428-2121-591-2476\/2P_030415_4_20Rice_20Flake-Crusted_20Hake_20with_20Saute_CC_81ed_20Daikon_20-_200281_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" In a medium bowl, combine the yuzu juice and light soy sauce. Divide the cooked mushrooms and vegetables and cooked hake fillets between 2 dishes; stir any juices from the bowl of vegetables into the yuzu-light soy sauce. Garnish with a few spoonfuls of the yuzu-light soy sauce and as much of the wasabi mixture as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Enjoy!  "}]}