{"category":"Vegetarian","link":"roasted-romanesco-cauliflower-salad-with-homemade-garlic-croutons-sunny-side-up-eggs","thumb":"\/\/media.blueapron.com\/recipes\/1362\/c_main_dish_images\/20150928-2053-259-8791\/2P_082615_5_R092515_2_HeartyRoastedRomanescoBroccoliSalad_CauliflowerVariation_20-_204480_high_also_thumb.jpg","title":" Roasted Cauliflower Salad ","subtitle":" with Homemade Garlic Croutons &amp; Sunny-Side Up Eggs ","headbg":"\/\/media.blueapron.com\/recipes\/1362\/c_main_dish_images\/20150928-2052-250-4858\/2P_082615_5_R092515_2_HeartyRoastedRomanescoBroccoliSalad_CauliflowerVariation_20-_204479_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re celebrating autumn&rsquo;s bounty with this salad, featuring mild, hearty cauliflower. We&rsquo;re roasting the cauliflower in olive oil and an intensely flavorful, lightly spicy blend of coriander, ground fennel seeds and Aleppo pepper. Tossed with saut&eacute;ed kale, garlic croutons and mint and topped with sunny-side up eggs, this meal is the epitome of simple, seasonal elegance. Enjoy, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1362\/ingredient_images\/20150928-2053-273-2838\/V3-Hearty-Roasted-Romanesco-Broccoli-Salad-WHITE-2P-W_large_feature.png","ingredients":[" 2  Farm Eggs "," 1  Small Baguette "," 3  Cloves Garlic "," 1  Head Cauliflower "," 1  Lemon "," 1  Red Onion ","  ½  Bunch Lacinato Kale   "," 1  Large Bunch Mint "," 1  Ounce Piave Cheese "," 2  Teaspoons Roasted Cauliflower Spice Blend (Ground Fennel Seeds, Crushed Aleppo Pepper & Ground Coriander) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5842\/20150928-2126-51-0769\/2P_082615_5_HeartyRoastedRomanescoBroccoliSalad_20-_204613_CauliflowerVariation_high_feature.jpg","title":" Prepare the ingredients  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut out and discard the cauliflower core; cut the head into small florets. Halve the baguette lengthwise. Peel the garlic; thinly slice 2 of the cloves and leave the remaining clove whole. Remove and discard the kale stems; roughly chop the leaves. Quarter and deseed the lemon. Peel the onion and cut into wedges; separate the layers. Pick the mint leaves off the stems; discard the stems. Using a fork, crumble the cheese.  "},{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5843\/20150928-2126-56-7664\/2P_082615_5_R092515_2_HeartyRoastedRomanescoBroccoliSalad_CauliflowerVariation_20-_204468_high_feature.jpg","title":" Roast the cauliflower  ","desc":" Place the cauliflower on a sheet pan. Drizzle with olive oil and season with salt, pepper and the spice blend; toss to thoroughly coat. Arrange the seasoned cauliflower in a single, even layer. Roast 20 to 22 minutes, or until tender and lightly browned.     "},{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5844\/20150901-1934-55-7533\/2P_082615_5_HeartyRoastedRomanescoBroccoliSalad_20-_204614_high_feature.jpg","title":" Make the garlic croutons  ","desc":" While the cauliflower roasts, place the baguette halves directly onto the oven rack, cut sides up. Toast in the oven 5 to 7 minutes, or until lightly browned and crispy. Remove from the oven and set aside to cool slightly. When cool enough to handle, transfer to a cutting board. Rub the cut side of each baguette half with the whole garlic clove; discard the garlic clove. Medium dice the baguette halves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5845\/20150901-1934-45-1792\/2P_082615_5_HeartyRoastedRomanescoBroccoliSalad_20-_204615_high_feature.jpg","title":" Cook the vegetables  ","desc":" While the baguette halves cool, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the onion; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the kale and sliced garlic; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the kale is slightly wilted. Transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5846\/20150901-1935-82-5117\/2P_082615_5_HeartyRoastedRomanescoBroccoliSalad_20-_204616_high_feature.jpg","title":" Cook the eggs  ","desc":" In the pan used to cook the kale, heat 2 teaspoons of olive oil on medium until hot. Crack the eggs into the pan, keeping them separate; season with salt and pepper. Cook, without flipping, 2 to 3 minutes, or until the whites are set and the yolks are cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1362\/recipe_steps\/5847\/20150928-2126-61-5480\/2P_082615_5_R092515_2_HeartyRoastedRomanescoBroccoliSalad_CauliflowerVariation_20-_204470_high_feature.jpg","title":" Finish the salad &amp; plate your dish  ","desc":" To the bowl of cooked kale, add the roasted cauliflower, garlic croutons, cheese, half the mint (tearing just before adding) and the juice of all 4 lemon wedges. Toss to combine and season with salt and pepper to taste. Divide the salad between 2 plates. Top with the cooked eggs. Garnish with the remaining mint (finely chopping just before adding). Enjoy!  "}]}