{"category":"Vegetarian","link":"roasted-fennel-over-linguini-with-lemon-ricotta-castelvetrano-olives-breadcrumbs","thumb":"\/\/media.blueapron.com\/recipes\/360\/c_main_dish_images\/20150819-1521-16-9424\/Fennel_20Pasta-0023_high_also_thumb.jpg","title":" Fresh Linguine &amp; Roasted Fennel ","subtitle":" with Lemon Ricotta, Castelvetrano Olives &amp; Breadcrumbs ","headbg":"\/\/media.blueapron.com\/recipes\/360\/c_main_dish_images\/20140808-2034-180-4968\/for_20print_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  550    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Lemon juice and ricotta are a classic combination. The tart bite of the citrus cuts the mild richness of the cheese, making for a delicious pairing. In this recipe, we&rsquo;re using lemon ricotta to flavor fresh linguine, coated in a simple sauce of lemon-infused oil. We&rsquo;re also roasting some of the season&rsquo;s first fennel and adding it to the mix (along with olives and fennel fronds) for browned, crispy texture and incredible flavor. And for a final, gourmet touch, we&rsquo;re toasting breadcrumbs with shallot, garlic, parsley and butter, and sprinkling them over the dish as a garnish. ","ingbg":"\/\/media.blueapron.com\/recipes\/360\/ingredient_images\/20150914-2020-93-4858\/V1-linguine-lemon-ricotta-2P-W_large_feature.png","ingredients":[" 10  Ounces Fresh Linguine Pasta "," ⅓  Cup Part-Skim Ricotta Cheese "," 3  Cloves Garlic ","  1  Fennel Bulb   "," 1  Lemon "," 1  Bunch Parsley "," 1  Ounce Castelvetrano Olives ","  2  Tablespoons Butter   "," 1  Shallot "," ¼  Cup Breadcrumbs "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2139\/20150914-2021-197-6068\/step1_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Pick off and mince a few of the fennel fronds (the thread-like tops of the plant). Cut off and discard the fennel stems. Halve and core the fennel bulb; slice into &frac12;-inch-thick strips. Pick the parsley off the stems. Peel and mince the garlic. Using a peeler, remove the lemon rind, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra). Pit the olives; roughly chop.  "},{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2140\/20140723-2013-5154-9469\/step2_high_feature.jpg","title":" Roast the fennel &amp; make the lemon ricotta:  ","desc":" Place the sliced fennel bulb on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast, stirring halfway through, 18 to 20 minutes, or until tender and lightly browned. While the fennel roasts, in a small bowl, combine the ricotta cheese and the juice of 3 lemon wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2141\/20140723-2013-3252-4939\/step3_high_feature.jpg","title":" Make the breadcrumb mixture:  ","desc":" While the fennel roasts, in a large pan, melt the butter on medium until hot. Add the garlic, shallot and half the parsley. Cook, stirring frequently, 1 to 2 minutes, or until fragrant and softened. Add the breadcrumbs. Cook, stirring frequently, 2 to 4 minutes, or until toasted and browned. Season with salt and pepper to taste; transfer to a paper towel-lined plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2142\/20140723-2013-4542-8930\/step4_high_feature.jpg","title":" Make the sauce:  ","desc":" While the fennel continues to roast, in the pan used to make the breadcrumb mixture, combine the lemon zest, the juice of the remaining lemon wedge, &frac12; cup of water and 2 tablespoons of olive oil; season with salt and pepper to taste. Heat to boiling on high; stir to thoroughly combine. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2143\/20140723-2013-5160-0274\/step5_high_feature.jpg","title":" Cook &amp; finish the pasta:  ","desc":" Using your hands, carefully separate the strands of the pasta; add to the pot of boiling water. Cook 4 to 6 minutes, or until tender. Reserving &frac14; cup of the pasta cooking water, drain thoroughly and transfer to the pan of sauce. Add the roasted fennel bulb, minced fennel fronds and reserved pasta cooking water. Cook on medium-high, stirring occasionally, 2 to 4 minutes, or until well combined. Remove from heat; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/360\/recipe_steps\/2144\/20140723-2013-3258-8809\/step6_high_feature.jpg","title":" Plate your dish:  ","desc":" Spread a layer of the lemon ricotta onto the sides of 2 dishes. Divide the finished pasta between the dishes. Garnish with the olives, breadcrumb mixture and remaining parsley. Serve with the remaining lemon ricotta on the side. Enjoy!  "}]}