{"category":"Pork","link":"roast-pork-smashed-potatoes-with-apple-walnut-goat-cheese-salad","thumb":"\/\/media.blueapron.com\/recipes\/627\/c_main_dish_images\/20150211-1634-26543-9006\/FP_121714_3_20Roasted_20Pork-6873_high_also_thumb.jpg","title":" Roast Pork &amp; Smashed Potatoes ","subtitle":" with Apple, Walnut &amp; Goat Cheese Salad ","headbg":"\/\/media.blueapron.com\/recipes\/627\/c_main_dish_images\/20150211-1634-12-3840\/FP_121714_3_20Roasted_20Pork-6872_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  625    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Roast pork is the definition of simple perfection. The dish evokes centuries of winter meat-roasting&mdash;a tradition particularly beloved in England. Potatoes are the classic side, but instead of mashing them, we&rsquo;re smashing them. Smashing deliciously exposes their interior, without losing their skin. After smashing the potatoes, you&rsquo;ll brown them in a pan of butter to crisp them up and give them savory richness. And feel free to drizzle them with the pan sauce, too! ","ingbg":"\/\/media.blueapron.com\/recipes\/627\/ingredient_images\/20150217-1842-2264-1835\/roasted-pork-fp-w3_large_feature.png","ingredients":[" 1  Pork Roast "," 4  Ounces Arugula "," 1  Apple "," 1  Lemon "," ¾  Pound Potatoes "," 1  Large Bunch Chives ","  4  Tablespoons Butter   "," 3  Tablespoons Pork Demi-Glace "," 1  Tablespoon Pork Roast Spice Blend (Whole Fennel Seeds, Ground Coriander & Smoked Paprika) "," ½  Cup Crumbled Goat Cheese "," ½  Cup Walnuts "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3914\/20150211-1714-1681-7399\/FP_121714_3_20Roasted_20Pork-6858_high_feature.jpg","title":" Cook &amp; smash the potatoes:  ","desc":" Preheat the oven to 425&deg;F. Heat a medium pot of salted water to boiling on high. Wash and dry the fresh produce. Once the pot of water is boiling, add the potatoes. Cook 14 to 16 minutes, or until just tender when pierced with a fork. Drain thoroughly and transfer to a clean work surface. Once cool enough to handle, carefully smash the potatoes with the flat side of your knife.  "},{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3915\/20150217-1843-17629-6205\/FP_121714_3-Roasted-Pork-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the potatoes cook, pat the pork dry with paper towels; completely coat in the spice blend and season with salt and pepper. Quarter and deseed the lemon. Core the apple and cut into matchsticks; toss with the juice of 1 lemon wedge to prevent browning. Cut the chives into &frac12;-inch pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3916\/20150211-1714-1688-1900\/FP_121714_3_20Roasted_20Pork-6852_high_feature.jpg","title":" Sear &amp; roast the pork:  ","desc":" In a medium pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned pork and cook, turning occasionally, 4 to 6 minutes, or until browned on all sides. Transfer to a baking sheet, leaving any browned bits (or fond) in the pan. Roast the seared pork in the oven 14 to 16 minutes, or until cooked through. (An instant-read thermometer should register 145&deg;F.) Remove from the oven and let rest for 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3917\/20150211-1715-1702-0929\/FP_121714_3_20Roasted_20Pork-6859_high_feature.jpg","title":" Make the pan sauce:  ","desc":" While the pork roasts, heat the pan of reserved fond on medium until hot. Add &frac14; cup of water and cook, scraping up the fond from the bottom of the pan with a spoon, 15 to 30 seconds, or until well combined. Add the pork demi-glace, half the butter and the juice of 1 lemon wedge. Bring to a boil, then remove from heat; season with salt and pepper to taste. Transfer to a serving dish and set aside in a warm place. Carefully wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3918\/20150211-1716-12-2471\/FP_121714_3_20Roasted_20Pork-6860_high_feature.jpg","title":" Brown the smashed potatoes:  ","desc":" In the same pan used to make the pan sauce, heat 1 tablespoon of olive oil on medium-high until hot. Add the smashed potatoes in a single, even layer and cook 3 to 4 minutes on the first side, or until browned. Add the remaining butter and flip the potatoes. Cook, swirling the pan occasionally, 2 to 3 minutes, or until evenly browned and lightly crispy. Season with salt and pepper to taste. Transfer to a serving dish and garnish with half the chives.  "},{"img":"\/\/media.blueapron.com\/recipes\/627\/recipe_steps\/3919\/20150211-1716-1713-5155\/FP_121714_3_20Roasted_20Pork-6861_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" While the smashed potatoes brown, in a large bowl, combine the arugula, apple, walnuts, the juice of the remaining lemon wedges and a drizzle of olive oil. Toss to coat; season with salt and pepper to taste. Transfer to a serving dish and top with the goat cheese. Cut off and discard the string of the rested pork. Find the lines of muscle (or grain) of the pork; thinly slice against the grain. Transfer to a serving dish. Garnish the sliced pork and salad with the remaining chives. Serve with the pan sauce on the side. Enjoy!  "}]}