{"category":"Beef","link":"salisbury-steaks-with-spiced-potato-wedges-roasted-asparagus","thumb":"\/\/media.blueapron.com\/recipes\/1118\/c_main_dish_images\/20150327-1712-1820-9495\/FM_20FP_022515_1_20Salisbury_20Steak-9589_high_also_thumb.jpg","title":" Salisbury Steaks ","subtitle":" with Spiced Potato Wedges &amp; Roasted Asparagus ","headbg":"\/\/media.blueapron.com\/recipes\/1118\/c_main_dish_images\/20150327-1711-3343-7350\/FM_20FP_022515_1_20Salisbury_20Steak-9588_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  655    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Salisbury steak is a classically American dish. Despite its name, it&rsquo;s actually a type of bunless hamburger, traditionally served in a savory brown sauce. This &ldquo;steak&rdquo; was invented by (and named for) a 19th-Century doctor, who believed that it would bolster the health of American troops. Later, the preparation was embraced by the population at large. We&rsquo;re revitalizing it here in gourmet fashion, finishing the beef patties in a mushroom sauce and adding a side of roasted asparagus and lightly spiced potato wedges. ","ingbg":"\/\/media.blueapron.com\/recipes\/1118\/ingredient_images\/20150408-1702-428-3839\/salisbury-steak-fp-w2_large_feature.png","ingredients":[" 1⅛  Pounds Ground Beef "," 1½  Pounds Russet Potatoes "," 10  Ounces Cremini Mushrooms "," 3  Cloves Garlic "," 1  Bunch Asparagus "," 1  Yellow Onion "," 1  Bunch Parsley "," 3  Tablespoons Beef Demi-Glace "," 2  Tablespoons All-Purpose Flour ","  2  Tablespoons Tomato Paste   "," 2  Tablespoons Vegetarian Worcestershire Sauce "," 1½  Tablespoons Salisbury Steak Spice Blend (Montreal Steak Seasoning, Colman's Mustard Powder & Ground Nutmeg) "," ¼  Cup Breadcrumbs "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4308\/20150327-1716-1961-0474\/FM_20FP_022515_1_20Salisbury_20Steak-9578_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut the potatoes in half lengthwise, then into 1-inch-thick wedges. Quarter the mushrooms. Peel and mince the garlic. Snap off and discard the woody ends of the asparagus. Peel and small dice the onion. Pick the parsley leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4309\/20150327-1716-300-1993\/FM_20FP_022515_1_20Salisbury_20Steak-9580_high_feature.jpg","title":" Roast the potatoes:  ","desc":" Place the potatoes on a sheet pan. Drizzle with olive oil and season with salt, pepper and ⅓ of the spice blend; toss to coat. Arrange the seasoned potatoes, skin sides down, in a single, even layer and roast 26 to 28 minutes, or until browned and tender when pierced with a fork. Remove from the oven and transfer to a serving dish, leaving the oven on. Carefully wipe off the sheet pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4310\/20150327-1717-2016-4352\/FM_20FP_022515_1_20Salisbury_20Steak-9591_high_feature.jpg","title":" Cook the aromatics:  ","desc":" While the potatoes roast, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the onion, &frac34; of the garlic and the remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant. Transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4311\/20150327-1717-2178-0335\/FM_20FP_022515_1_20Salisbury_20Steak-9581_high_feature.jpg","title":" Form &amp; brown the patties:  ","desc":" While the potatoes continue to roast, add the ground beef and breadcrumbs to the bowl of aromatics; season with salt and pepper. Using a spoon, gently mix to combine. Using your hands, form the mixture into four 1-inch-thick patties. In the pan used to cook the aromatics, heat 1 tablespoon of olive oil on medium-high until hot. Add the patties; cook 3 to 4 minutes per side, or until browned and cooked through. Transfer to a plate and set aside in  a warm place, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4312\/20150327-1717-6742-3161\/FM_20FP_022515_1_20Salisbury_20Steak-9584_high_feature.jpg","title":" Make the sauce &amp; finish the patties:  ","desc":" Add the mushrooms to the pan of reserved fond. Cook on medium-high, stirring occasionally, 3 to 4 minutes, or until lightly browned. Add the tomato paste and cook, stirring constantly, 1 to 2 minutes, or until dark red. Add the Worcestershire sauce, beef demi-glace, flour and 1&frac14; cups of water; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until thickened. Add the cooked patties and cook, occasionally spooning the sauce over the patties, 2 to 3 minutes, or until thoroughly coated. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1118\/recipe_steps\/4313\/20150327-1717-2063-0507\/FM_20FP_022515_1_20Salisbury_20Steak-9585_high_feature.jpg","title":" Roast the asparagus &amp; serve your dish:  ","desc":" While the sauce and patties cook, place the asparagus and remaining garlic on the same sheet pan used to roast the potatoes. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast 2 to 4 minutes, or until bright green. Transfer to the serving dish of roasted potatoes. Garnish the finished patties and roasted potatoes with the parsley. Enjoy!  "}]}