{"category":"Fish","link":"salmon-caesar-salad","thumb":"\/\/media.blueapron.com\/recipes\/69\/c_main_dish_images\/20150611-1959-363-8373\/salmon_caesear_salad_blue_apron_high_also_thumb.jpg","title":" Salmon Caesar Salad ","subtitle":" with Homemade Sourdough Croutons ","headbg":"\/\/media.blueapron.com\/recipes\/69\/c_main_dish_images\/20140808-1722-18-5205\/salmon_caesear_salad_blue_apron_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" At its most basic, the Caesar salad is a delicious mixture of crisp romaine lettuce, sharp Parmesan cheese, olive oil and crunchy croutons. But there are countless variations of the dish&mdash;many of which turn it into a hearty entr&eacute;e. Here, we&rsquo;re doing just that by adding flaky, pan-seared salmon fillets and using oven-toasted sourdough croutons. Coated in a creamy dressing with a bright lemony tang, this light, easy dinner is perfect for the start of summer. ","ingbg":"\/\/media.blueapron.com\/recipes\/69\/ingredient_images\/20150706-1909-241-1759\/Salmon-Caesar-Salad-FP-W_large_feature.png","ingredients":[" 2  Salmon Fillets "," 1  Small Sourdough Bread Boule "," 2  Cloves Garlic "," 2  Romaine Hearts "," 1  Lemon "," 1  Tablespoon White Wine Vinegar ","  ¼  Cup Grated Parmesan Cheese   "," ¼  Cup Mayonnaise "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/990\/20140723-1850-2751-1374\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 350&deg;F. Wash and dry the fresh produce. Cut off and discard the root ends of the lettuce; roughly chop the leaves. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Place the garlic paste in a small bowl with the vinegar.  "},{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/992\/20140723-1850-2757-6920\/step2_high_feature.jpg","title":" Make the croutons:  ","desc":" Tear the bread into bite-sized pieces and place on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and toast in the oven, stirring halfway through, 10 to 12 minutes, or until golden brown and crispy. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/989\/20140723-1850-2448-0710\/step3_high_feature.jpg","title":" Make the dressing:  ","desc":" While the croutons toast, add the lemon zest and the juice of 2 lemon wedges to the garlic paste vinegar mixture. Stir in the mayonnaise until well combined. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/991\/20140723-1850-2454-2933\/step4_high_feature.jpg","title":" Cook the salmon:  ","desc":" Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the seasoned fillets, skin sides down, and cook 6 to 8 minutes on the first side. Flip and cook 3 to 4 minutes, or until browned and cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/988\/20140723-1850-2442-8744\/step5_high_feature.jpg","title":" Make the salad:  ","desc":" In a large bowl, combine the lettuce, croutons and half the Parmesan cheese. Add enough of the dressing to coat the salad (you may have extra dressing). Transfer 1 cooked salmon fillet to a clean, dry work surface. Using a fork, flake the fillet into bite-sized pieces; discard the skin. Add the flaked fillet to the salad; gently toss to combine. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/69\/recipe_steps\/1918\/20140723-1959-4476-7924\/step6_high_feature.jpg","title":" Plate your dish:  ","desc":" Slice the remaining cooked salmon fillet in half. Divide the salad between 2 plates. Top each with a piece of the halved salmon fillet. Garnish with the remaining lemon wedges and Parmesan cheese. Enjoy!  "}]}