{"category":"Shellfish","link":"sauteed-shrimp-sandwiches-with-saffron-aioli-celery-parmesan-salad","thumb":"\/\/media.blueapron.com\/recipes\/1328\/c_main_dish_images\/20150819-1513-44-5300\/2P_081215_1_ItalianSHRIMPSandwich_20-_200855_high_also_thumb.jpg","title":" Sautéed Shrimp Sandwiches  ","subtitle":" with Saffron Aioli &amp; Celery-Parmesan Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1328\/c_main_dish_images\/20150819-1513-33-8153\/2P_081215_1_ItalianSHRIMPSandwich_20-_200854_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Saffron and seafood are a favorite pairing throughout the Mediterranean. Though the use of saffron is most prominent in Middle Eastern and North African cuisines, Sardinia (an island off Italy&rsquo;s west coast) is also famous for its saffron, which Sardinians have cultivated for hundreds of years. In this dish, we&rsquo;re drawing inspiration from Sardinian cuisine and creating sandwiches with saut&eacute;ed shrimp and a creamy saffron aioli. Served with a side salad of celery, olives, toasted almonds and Parmesan cheese, this summery meal is incredibly gourmet and satisfying. ","ingbg":"\/\/media.blueapron.com\/recipes\/1328\/ingredient_images\/20150914-2020-84-0367\/F_shrimp-panini-2P-W_large_feature.png","ingredients":[" 10  Ounces Shrimp "," 2  Hot Dog Buns "," 2  Stalks Celery "," 2  Cloves Garlic "," 1  Lemon "," 1  Bunch Parsley "," 2  Tablespoons Sliced Almonds "," 1  Ounce Kalamata Olives ","  ¼  Cup Shaved Parmesan Cheese   "," ¼  Cup Mayonnaise ","  1\/16  Teaspoon Saffron Powder   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5632\/20150820-2133-36-0053\/2P_081215_1_ItalianSHRIMPSandwich-0839-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Using a peeler, remove the rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Pick the parsley leaves off the stems; discard the stems. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop. Slice the celery on an angle into thin strips.  "},{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5650\/20150819-1530-118-0285\/2P_081215_1_ItalianSHRIMPSandwich_20-_200840_high_feature.jpg","title":" Make the saffron aioli:  ","desc":" In a small bowl, combine the mayonnaise, saffron powder, half the garlic paste and the juice of 2 lemon wedges. Stir to thoroughly combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5651\/20150819-1530-129-1350\/2P_081215_1_ItalianSHRIMPSandwich_20-_200841_high_feature.jpg","title":" Toast the almonds:  ","desc":" Heat a medium, dry pan (nonstick, if you have one) on medium until hot. Add the almonds. Toast, stirring frequently, 2 to 3 minutes, or until lightly browned and fragrant. Transfer to a bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5652\/20150819-1530-144-0471\/2P_081215_1_ItalianSHRIMPSandwich_20-_200842_high_feature.jpg","title":" Cook the shrimp:  ","desc":" Pat the shrimp dry with paper towels and season with salt and pepper on both sides. In the pan used to toast the almonds, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned shrimp and remaining garlic paste; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the shrimp are opaque and cooked through. Transfer to a bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5653\/20150819-1531-155-8766\/2P_081215_1_ItalianSHRIMPSandwich_20-_200843_high_feature.jpg","title":" Toast the buns &amp; make the sandwiches:  ","desc":" In the pan used to cook the shrimp, heat 2 teaspoons of olive oil on medium until hot. Add the buns. Toast 30 to 45 seconds per side, or until lightly browned and crispy. Transfer to a clean, dry work surface. Split the buns. Spread a thin layer of the saffron aioli into each bun (you will have extra). Divide the cooked shrimp between the buns. Top with as much of the remaining saffron aioli as you&rsquo;d like.  "},{"img":"\/\/media.blueapron.com\/recipes\/1328\/recipe_steps\/5654\/20150819-1531-166-6007\/2P_081215_1_ItalianSHRIMPSandwich_20-_200844_high_feature.jpg","title":" Make the salad &amp; plate your dish:  ","desc":" In a medium bowl, combine the celery, olives, lemon zest, toasted almonds, cheese and half the parsley; season with salt and pepper. Add the juice of the remaining lemon wedges and a drizzle of olive oil; toss to coat and season with salt and pepper to taste. Divide the sandwiches and salad between 2 dishes. Garnish the sandwich with the remaining parsley. Enjoy!  "}]}