{"category":"Fish","link":"seared-rockfish-with-spring-vegetables-lemon-mustard-vinaigrette","thumb":"\/\/media.blueapron.com\/recipes\/1198\/c_main_dish_images\/20150522-1703-14222-8435\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg--2_high_also_thumb.jpg","title":" Seared Cod ","subtitle":" with Spring Vegetables &amp; Lemon-Mustard Vinaigrette ","headbg":"\/\/media.blueapron.com\/recipes\/1198\/c_main_dish_images\/20150522-1703-14208-6428\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  520    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, we&rsquo;re celebrating the delicate flavors of spring. As a side, we&rsquo;re serving up fingerling potatoes with two spring vegetables: radishes and asparagus. You&rsquo;ll be serving the radishes thinly sliced and raw, taking advantage of their peppery flavor and crunchy texture. To preserve the bright earthiness of the asparagus, you&rsquo;ll be blanching it, or briefly boiling it then cooling it rapidly in ice water to keep its texture and color. Topped with flaky cod fillets and ribbons of tarragon, this dish is a seasonal marvel. ","ingbg":"\/\/media.blueapron.com\/recipes\/1198\/ingredient_images\/20150609-1811-118-1130\/seared-cod-spring-veg-2p-w_large_feature.png","ingredients":[" 2  Cod Fillets ","  10  Ounces Fingerling Potatoes   "," 3  Ounces Radishes ","  1  Bunch Asparagus   "," 1  Lemon "," 1  Bunch Tarragon "," 2  Tablespoons Butter "," 1  Shallot "," 1  Tablespoon Capers "," 1  Tablespoon Dijon Mustard "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4885\/20150522-1708-14293-6401\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-4582_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Trim off and discard the ends of the radishes; thinly slice the radishes. Snap off and discard the woody ends of the asparagus; cut the asparagus into 2-inch pieces on an angle. Cut the potatoes into &frac12;-inch-thick rounds. Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra shallot). Pick the tarragon leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4886\/20150522-1708-14304-2409\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-4584_high_feature.jpg","title":" Blanch the asparagus:  ","desc":" Fill a medium bowl with ice water and set aside. Add the asparagus to the pot of boiling water and cook 1 to 2 minutes, or until bright green and slightly softened. Using a slotted spoon or strainer, transfer the cooked asparagus directly to the bowl of ice water, leaving the pot of water boiling. Let the cooked asparagus stand until cool. Once cool, thoroughly drain and set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4887\/20150522-1708-14319-3417\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-4587_high_feature.jpg","title":" Cook the potatoes:  ","desc":" While the asparagus cools, add the potatoes to the pot of boiling water used to cook the asparagus. Cook 9 to 11 minutes, or until tender when pierced with a fork. Drain thoroughly.   "},{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4888\/20150522-1708-14341-8707\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-4586_high_feature.jpg","title":" Make the vinaigrette:  ","desc":" While the potatoes cook, in a medium bowl, combine the shallot, mustard and the juice of all 4 lemon wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4889\/20150522-1708-14330-2289\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg--4_high_feature.jpg","title":" Cook the cod:  ","desc":" While the potatoes continue to cook, pat the cod fillets dry with paper towels and season with salt and pepper on both sides. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned fillets and cook 3 to 4 minutes on the first side. Flip and add the butter. Cook, occasionally tilting the pan and spooning the butter over the fillets, 3 to 4 minutes, or until the fillets are cooked through. Remove from heat and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1198\/recipe_steps\/4890\/20150522-1709-14356-3691\/2P_042415_1_20R_2P_042815_2_20Seared_20Cod_20Spring_20Veg-4589_high_feature.jpg","title":" Finish the vegetables &amp; plate your dish:  ","desc":" In a large bowl, combine the radishes, blanched asparagus, cooked potatoes, capers and half the tarragon (tearing the leaves just before adding); season with salt and pepper. Add as much of the vinaigrette as you&rsquo;d like; toss to thoroughly combine. Season with salt and pepper to taste. Divide the finished vegetables between 2 plates. Top each with a cooked cod fillet. Garnish with the remaining tarragon. Enjoy!  "}]}