{"category":"Fish","link":"seared-salmon-creamy-farro-with-brussels-sprouts-apple-hazelnuts","thumb":"\/\/media.blueapron.com\/recipes\/1364\/c_main_dish_images\/20150928-2045-110-5225\/2P_082515_3_20_R092515_4_Salmon_CreamyFarro_20-_204524_high_also_thumb.jpg","title":" Pan-Seared Salmon &amp; Farro Salad ","subtitle":" with Brussels Sprouts &amp; Apple ","headbg":"\/\/media.blueapron.com\/recipes\/1364\/c_main_dish_images\/20150928-2044-101-0796\/2P_082515_3_20_R092515_4_Salmon_CreamyFarro_20-_204525_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  550    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chefs, fall is here, and there&rsquo;s no better way to celebrate it than with some of the season&rsquo;s first Brussels sprouts. Tiny heads of densely wrapped leaves, Brussels sprouts are amazingly versatile. Here, we&rsquo;re thinly slicing them, cooking them with a little lemon zest and mixing them into a farro salad that accompanies seared salmon fillets. In the salad, we&rsquo;re also featuring apple, one of our favorite fall fruits. Juicy and sweet, it&rsquo;s delicious coated in a tangy vinaigrette made with lemon juice and Dijon mustard. ","ingbg":"\/\/media.blueapron.com\/recipes\/1364\/ingredient_images\/20150928-2046-128-6516\/F-Salmon-Creamy-Farro-2P-W_large_feature.png","ingredients":[" 2  Salmon Fillets "," ⅓  Cup Semi-Pearled Farro ","  4  Ounces Brussels Sprouts   "," 1  Apple "," 1  Lemon "," 1  Large Bunch Parsley "," 2  Tablespoons Whole Grain Dijon Mustard "," 1  Shallot "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5809\/20150827-2106-301-8358\/2P_082515_3_Salmon_CreamyFarro_20-_203888_high_feature.jpg","title":" Cook the farro:  ","desc":" Heat a medium pot of salted water to boiling on high. Once boiling, add the farro. Cook 16 to 18 minutes, or until tender. Drain thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5810\/20150928-2123-90-7023\/2P_082515_3_20_R092515_4_Salmon_CreamyFarro_20-_204497_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the farro cooks, wash and dry the fresh produce. Cut off and discard the stem ends of the Brussels sprouts; halve lengthwise, then thinly slice crosswise. Using a peeler, remove the rind of the lemon, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the juice of 3 lemon wedges. Pick the parsley leaves off the stems; discard the stems. Core and small dice the apple.  "},{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5811\/20150928-2123-99-0438\/2P_082515_3_Salmon_CreamyFarro_20-_203889_high_feature.jpg","title":" Cook the Brussels Sprouts:  ","desc":" While the farro continues to cook, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the Brussels sprouts and lemon zest; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened. Transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5812\/20150827-2106-316-5900\/2P_082515_3_Salmon_CreamyFarro_20-_203891_high_feature.jpg","title":" Make the vinaigrette:  ","desc":" While the Brussels sprouts cook, add the mustard to the shallot-lemon juice mixture; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5813\/20150827-2106-325-8270\/2P_082515_3_Salmon_CreamyFarro_20-_203892_high_feature.jpg","title":" Cook the salmon:  ","desc":" Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the Brussels sprouts, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned salmon. Cook 2 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1364\/recipe_steps\/5814\/20150928-2123-104-0257\/2P_082515_3_20_R092515_4_Salmon_CreamyFarro_20-_204498_high_feature.jpg","title":" Finish the farro &amp; plate your dish:  ","desc":" While the salmon cooks, to the bowl of cooked Brussels sprouts, add the apple, cooked farro and as much of the vinaigrette as you&rsquo;d like (you may have extra vinaigrette). Stir to thoroughly combine and season with salt and pepper to taste. In a small bowl, toss the parsley with the juice of the remaining lemon wedge; season with salt and pepper to taste. Divide the farro salad between 2 dishes. Top with the cooked salmon and garnish with the dressed parsley. Enjoy!  "}]}