{"category":"Fish","link":"seared-salmon-long-beans-with-teriyaki-udon-noodles-yu-choy","thumb":"\/\/media.blueapron.com\/recipes\/1188\/c_main_dish_images\/20150507-2018-239-9950\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-9_high_also_thumb.jpg","title":" Seared Salmon &amp; Long Beans ","subtitle":" with Teriyaki Udon Noodles &amp; Yu Choy ","headbg":"\/\/media.blueapron.com\/recipes\/1188\/c_main_dish_images\/20150507-2018-579-5336\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-8_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  610    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Japanese udon is an amazing type of noodle. Long, thick and deliciously chewy, udon noodles are most often served in a hot broth. But brothless yaki udon is also a popular preparation, and we&rsquo;re taking inspiration from it here. A stir-fry of vegetables, noodles and sauce, yaki udon is a little cooler&mdash;perfect for the late spring weather. In this dish, we&rsquo;re cooking the noodles and vegetables separately, then mixing them together at the end with sweetly tangy teriyaki sauce. ","ingbg":"\/\/media.blueapron.com\/recipes\/1188\/ingredient_images\/20150601-2050-86-8505\/salmon-teriyaki-udon-fp-w_large_feature.png","ingredients":[" 4  Salmon Fillets "," 1  Pound Fresh Udon Noodles "," 3  Cloves Garlic "," 3  Scallions "," 1  Lime "," 6  Ounces Long Beans "," 3  Ounces Yu Choy "," 1  Large Bunch Cilantro ","  1  Tablespoon Sesame Oil   "," 1  Teaspoon Black & White Sesame Seeds "," ¼  Cup Teriyaki Sauce "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4771\/20150507-2025-709-6699\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-2_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions on an angle; cut the green tops into 1-inch pieces on an angle. Quarter the lime. Trim off and discard the ends of the long beans. Trim off and discard the root ends of the yu choy; roughly chop the stems, keeping the leaves whole. Pick the cilantro leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4772\/20150507-2025-346-6462\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-3_high_feature.jpg","title":" Start the vegetables:  ","desc":" In a large pan, heat 1 tablespoon of oil on medium-high until hot. Add the long beans. Cook, stirring occasionally, 4 to 6 minutes, or until tender and lightly browned.  "},{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4773\/20150507-2026-720-0580\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-5_high_feature.jpg","title":" Cook the noodles:  ","desc":" While the long beans cook, add the noodles to the pot of boiling water, stirring gently to separate. Cook 2 to 3 minutes, or just until tender. Turn off the heat. Drain thoroughly and return to the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4774\/20150507-2026-357-9764\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-4_high_feature.jpg","title":" Add the aromatics &amp; yu choy:  ","desc":" To the pan of long beans, add the garlic, white bottoms of the scallions and yu choy; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the yu choy leaves have wilted. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4775\/20150507-2026-372-0750\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-6_high_feature.jpg","title":" Finish the noodles &amp; vegetables:  ","desc":" Add the cooked vegetables, teriyaki sauce and sesame oil to the pot of cooked noodles; stir to thoroughly combine and season with salt and pepper to taste. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1188\/recipe_steps\/4776\/20150507-2026-742-8157\/FP_040915_3_20Salmon_20Teriyaki_20Udon-2-7_high_feature.jpg","title":" Cook the salmon &amp; serve your dish:  ","desc":" Pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 1 tablespoon of oil on medium-high until hot. Add the seasoned fillets and cook 3 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Remove from heat. Divide the finished noodles and vegetables between 4 dishes. Top each with a cooked salmon fillet. Garnish with the cilantro, green tops of the scallions and sesame seeds. Serve with the lime wedges on the side. Enjoy!  "}]}