{"category":"Pork","link":"seared-pork-roast-with-smashed-potatoes-strawberry-rhubarb-compote","thumb":"\/\/media.blueapron.com\/recipes\/1178\/c_main_dish_images\/20150519-2214-371-5228\/2P_111414_3_R050815_1_R051915_2_20Pork_20Spinach_20Mashed_20Potatoes-6022_high_also_thumb.jpg","title":" Seared Pork  ","subtitle":" with Sautéed  Spinach &amp; Smashed Potatoes ","headbg":"\/\/media.blueapron.com\/recipes\/1178\/c_main_dish_images\/20150519-2213-355-0031\/2P_111414_3_R050815_1_R051915_2_20Pork_20Spinach_20Mashed_20Potatoes-6021_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  585    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Pork roasts are one of the most classically American entrees. Usually served simply with hearty sides, this satisfying meal has become a standard of our cuisine for one reason: it&rsquo;s delicious! In this recipe, we&rsquo;re serving up our version with saut&eacute;ed spinach, and buttery-sweet Yukon Gold potatoes smashed together with cr&egrave;me fra&icirc;che, scallion greens and the added briny touch of Castelvetrano olives. ","ingbg":"\/\/media.blueapron.com\/recipes\/1178\/ingredient_images\/20150526-1827-1910-1952\/pork-chop-potatoes-2p-w2_large_feature.png","ingredients":[" 1  Pork Roast "," ¾  Pound Yukon Gold Potatoes "," 5  Ounces Spinach "," 3  Scallions "," 1  Lemon "," 1  Ounce Castelvetrano Olives ","  ¼  Cup Crème Fraîche   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1178\/recipe_steps\/4795\/20150521-1734-611-5559\/2P_111414_3_20R050815_20Pork_20Chop-5239_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Large dice the potatoes. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Using a peeler, remove the rind of the lemon, avoiding the pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Using the flat side of your knife, smash the olives; remove and discard the pits and roughly chop the olives.  "},{"img":"\/\/media.blueapron.com\/recipes\/1178\/recipe_steps\/4796\/20150521-1734-622-1746\/2P_111414_3_20Pork_20Chop_20w-_20Strawberry_20Rhubarb_20-_204222_high_feature.jpg","title":" Cook &amp; smash the potatoes:  ","desc":" Add the potatoes to the pot of boiling water and cook 9 to 11 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot; remove from heat. Using a fork, smash the cooked potatoes to your desired consistency. Add the olives, cr&egrave;me fra&icirc;che, half the green tops of the scallions, half the lemon zest and the juice of 2 lemon wedges; drizzle with olive oil and stir to combine. Season with salt and pepper to taste. Set aside in a warm place.   "},{"img":"\/\/media.blueapron.com\/recipes\/1178\/recipe_steps\/4797\/20150521-1734-637-3506\/2P_111414_3_R050815_1_R051915_2_20Pork_20Spinach_20Mashed_20Potatoes-6016_high_feature.jpg","title":" Cook the pork:  ","desc":" While the potatoes cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Season the pork with salt and pepper on both sides. Add the seasoned pork to the pan and cook, loosely covering with aluminum foil and flipping occasionally, 12 to 15 minutes, or until browned and cooked to your desired degree of doneness. Transfer to a clean work surface and let rest for at least 5 minutes, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1178\/recipe_steps\/4798\/20150521-1735-648-8905\/2P_111414_3_R050815_1_R051915_2_20Pork_20Spinach_20Mashed_20Potatoes-6017_high_feature.jpg","title":" Cook the spinach:  ","desc":" While the pork rests, add 1 teaspoon of olive oil to the pan of reserved fond and heat on medium until hot. Add the white bottoms of the scallions and remaining lemon zest. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the spinach and cook, stirring frequently, 1 to 2 minutes, or until the spinach has wilted. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1178\/recipe_steps\/4799\/20150521-1735-659-6388\/2P_111414_3_R050815_1_R051915_2_20Pork_20Spinach_20Mashed_20Potatoes-6018_high_feature.jpg","title":" Plate your dish:  ","desc":" Find the lines of muscle (or grain) of the rested pork; thinly slice against the grain. Divide the sliced pork, cooked spinach and smashed potatoes between 2 dishes. Garnish with the remaining green tops of the scallions. Garnish the pork with pepper. Serve with the remaining lemon wedges on the side. Enjoy!  "}]}