{"category":"Lamb","link":"shepherd-s-pie-with-green-beans-mushrooms","thumb":"\/\/media.blueapron.com\/recipes\/1339\/c_main_dish_images\/20150826-1619-32-2901\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201060_high_also_thumb.jpg","title":" Shepherd's Pie ","subtitle":" with Green Beans &amp; Mushrooms ","headbg":"\/\/media.blueapron.com\/recipes\/1339\/c_main_dish_images\/20150826-1618-21-8386\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201059_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the late 18th Century, potatoes (native to the Americas) finally won favor in the U.K. One of the most delicious results was shepherd&rsquo;s pie&shy;&mdash;now a classic comfort food. So named for its use of lamb, it consists of a hearty filling baked under a crust of mashed potatoes. We&rsquo;re making our filling with lamb, beef, green beans and mushrooms, all simmered in a flavorful sauce. And our crust features perfectly-textured Yukon Golds. If you&rsquo;d like, use a fork to create a crisscrossing pattern in the surface of your pie before it goes into the oven! ","ingbg":"\/\/media.blueapron.com\/recipes\/1339\/ingredient_images\/20150917-1543-168-9129\/FM-Shepherds-Pie-Green-Beans-Mushrooms-FP-W_large_feature.png","ingredients":[" 1⅛  Pounds Ground Lamb & Beef Blend "," 6  Ounces Green Beans "," 6  Ounces Cremini Mushrooms "," 2  Scallions "," 1½  Pounds Yukon Gold Potatoes "," 4  Tablespoons Butter ","  2  Tablespoons Tomato Paste   ","  1  Tablespoon Vegetarian Worcestershire Sauce   "," ½  Cup Low-Fat Sour Cream "," ¼  Cup Grated Parmesan Cheese "," 1  Tablespoon Shepherd's Pie Spice Blend (Mustard Powder, Dried Thyme & Garlic Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5895\/20150828-1845-21-8107\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201047_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Peel and large dice the potatoes. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Cut the mushrooms into bite-sized pieces. Cut off and discard the stem ends of the green beans; cut the green beans into &frac14;-inch pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5896\/20150828-1845-27-3668\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201051_high_feature.jpg","title":" Cook &amp; mash the potatoes:   ","desc":" Add the potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, stir in the sour cream, &frac34; of the butter and half the green tops of the scallions; season with salt and pepper. Using a fork, mash to your desired consistency.  "},{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5897\/20150828-1846-33-4379\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201048_high_feature.jpg","title":" Cook the lamb &amp; beef:  ","desc":" While the potatoes cook, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the ground lamb and beef; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 5 to 7 minutes, or until browned and cooked through. Carefully drain off and discard the drippings. Transfer the cooked lamb and beef to a bowl, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5898\/20150828-1846-39-4195\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201050_high_feature.jpg","title":" Cook the mushrooms:   ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond; heat on medium until hot. Add the mushrooms. Cook, stirring occasionally, 4 to 6 minutes, or until browned. Season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5899\/20150828-1846-50-6005\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201052_high_feature.jpg","title":" Make the filling:   ","desc":" Add the green beans, white bottoms of the scallions, tomato paste and spice blend to the pan of mushrooms; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until fragrant and the beans are bright green. Add the cooked lamb and beef, Worcestershire sauce, remaining butter and &frac34; cup of water; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until thickened. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1339\/recipe_steps\/5900\/20150828-1846-62-5576\/FP_081815_5_Shepherd_E2_80_99sPiewithGreenBeans_Mushrooms_20-_201053_high_feature.jpg","title":" Finish the pie &amp; serve your dish:   ","desc":" Transfer the filling to a baking dish. Using a spatula or fork, evenly spread the mashed potatoes over the filling. Sprinkle with the cheese; season with salt and pepper. Bake 12 to 15 minutes, or until the edges of the potatoes are lightly browned. Remove from the oven and let stand for at least 2 minutes before serving. Garnish with the remaining green tops of the scallions. Enjoy!  "}]}