{"category":"Shellfish","link":"shrimp-fettuccine-alfredo-with-asparagus-romaine-parmesan-salad","thumb":"\/\/media.blueapron.com\/recipes\/1179\/c_main_dish_images\/20150507-1530-308-5939\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2435_high_also_thumb.jpg","title":" Shrimp Fettuccine Alfredo ","subtitle":" with Asparagus &amp; Romaine-Parmesan Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1179\/c_main_dish_images\/20150507-1529-297-2565\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2434_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  620    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" At its most basic, the classic Roman dish fettuccine alfredo is pasta in a sauce of butter and Parmesan cheese. In the U.S., the recipe usually includes cream as well, and, quite often, shrimp. We&rsquo;re using shrimp in this gourmet version (along with spring asparagus), but we&rsquo;re removing cream from the equation. Instead, we&rsquo;re substituting in light, fluffy mascarpone cheese. An Italian variety with a delightfully sweet taste, mascarpone brings this dish together with its incredible, silky texture and flavor. You&rsquo;ll never want to make fettuccine alfredo the old way again! ","ingbg":"\/\/media.blueapron.com\/recipes\/1179\/ingredient_images\/20150526-1747-1561-3958\/fresh-linguine-shrimp-fp-w2_large_feature.png","ingredients":[" 1  Pound Shrimp "," 12  Ounces Fresh Fettuccine Pasta "," 3  Cloves Garlic "," 3  Scallions "," 2  Lemons ","  ½  Bunch Asparagus   "," 1  Romaine Heart "," 1  Large Bunch Parsley "," 2  Tablespoons Butter "," ¼  Cup Mascarpone Cheese "," ⅓  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4740\/20150507-1539-550-8994\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2372_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops. Peel and thinly slice the garlic. Quarter and deseed the lemons. Snap off and discard the woody ends of the asparagus; cut into 1-inch pieces on an angle. Trim off and discard the root end of the lettuce; separate the leaves. Pick the parsley leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4741\/20150507-1539-561-4694\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2416_high_feature.jpg","title":" Make the dressing:  ","desc":" In a medium bowl, combine half the Parmesan cheese and the juice of 4 lemon wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4742\/20150507-1539-576-4227\/FP_032715_3_20Fresh_20Linguine_20Shrimp-_high_feature.jpg","title":" Cook the vegetables &amp; shrimp:  ","desc":" In a large pan, heat 1 tablespoon of olive oil on medium until hot. Add the white bottoms of the scallions and garlic; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the asparagus and cook, stirring occasionally, 2 to 3 minutes, or until bright green. Add the shrimp; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until opaque and just cooked through. Turn off the heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4743\/20150507-1539-587-7908\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2417_high_feature.jpg","title":" Cook the pasta:  ","desc":" Add the pasta to the pot of boiling water, stirring gently to separate. Cook 2 to 3 minutes, or until tender. Reserving &frac12; cup of the pasta cooking water, thoroughly drain the cooked pasta.  "},{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4744\/20150507-1539-598-6883\/FP_032715_3_20Fresh_20Linguine_20Shrimp--2_high_feature.jpg","title":" Finish the pasta:  ","desc":" To the pan of vegetables and shrimp, add the cooked pasta, butter, mascarpone cheese, remaining Parmesan cheese, the juice of the remaining lemon wedges and half the pasta cooking water; season with salt and pepper. Cook on medium, stirring frequently to coat the pasta, 2 to 3 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Remove from heat. Stir in the green tops of the scallions and half the parsley; season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1179\/recipe_steps\/4745\/20150507-1540-624-2915\/FP_032715_3_20Fresh_20Linguine_20Shrimp-2421_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" In a large bowl, combine the lettuce and remaining parsley; season with salt and pepper. Add enough of the dressing to coat the salad (you may have extra); toss to combine and season with salt and pepper to taste. Transfer to a serving dish. Serve the finished pasta with the salad on the side. Enjoy!  "}]}