{"category":"Shellfish","link":"shrimp-tacos-with-pineapple-salsa-creamy-cabbage-slaw","thumb":"\/\/media.blueapron.com\/recipes\/1136\/c_main_dish_images\/20150403-2132-15415-6084\/FP_021115_1_20Shrimp_20Tacos_20-_209985_high_also_thumb.jpg","title":" Shrimp &amp; Pineapple Soft Tacos ","subtitle":" with Creamy Cabbage Slaw &amp; Crunchy Romaine Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1136\/c_main_dish_images\/20150403-2132-13689-8450\/FP_021115_1_20Shrimp_20Tacos_20-_209984_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  565    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The very first tacos were made with fish. In the Valley of Mexico, a lake-filled highlands region in the center of the country, indigenous peoples used to prepare taco feasts with fresh catch. Ever since, tacos made with seafood have been at the center of this esteemed culinary tradition. Here, we&rsquo;re making Mexican-inspired soft tacos filled with seasoned shrimp, creamy slaw and an herbaceously sweet pineapple-avocado salsa. And on the side, we&rsquo;re serving a simple, whole-leaf romaine salad dressed with zesty crema and toasted, spiced pepitas (pumpkin seeds). ","ingbg":"\/\/media.blueapron.com\/recipes\/1136\/ingredient_images\/20150428-1521-792-7775\/shrimp-tacos-fam-w2_large_feature.png","ingredients":[" 1  Pound Shrimp "," 10  Flour Tortillas "," ½  Pound Cubed Pineapple "," 1  Lime "," 1  Avocado "," 1  Head Romaine Lettuce "," ½  Pound Green Cabbage "," 1  Large Bunch Cilantro "," 2  Ounces Cotija Cheese ","  1  Tablespoon Cinco De Mayo Spice Blend (Smoked Sweet Paprika, Chipotle Chile Powder, Ground Cumin & Ground Coriander)   ","  ⅓  Cup Pepitas   "," ½  Cup Mexican Crema "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4441\/20150403-2141-15905-2660\/FP_021115_1_20Shrimp_20Tacos_20-_209964_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Quarter the lime. Cut out and discard the cabbage core; thinly slice the leaves. Roughly chop the cilantro leaves and stems. Pit, peel and medium dice the avocado; toss with the juice of 1 lime wedge to prevent browning. Small dice the pineapple. Cut off and discard the root end of the lettuce; separate the leaves. Crumble the cheese.  "},{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4442\/20150403-2141-15242-2675\/FP_021115_1_20Shrimp_20Tacos_20-_209967_high_feature.jpg","title":" Make the dressing &amp; cabbage slaw:  ","desc":" To make the dressing, in a medium bowl, combine the Mexican crema, the juice of 1 lime wedge and 1 tablespoon of water. Stir to thoroughly combine and season with salt and pepper to taste. In a large bowl, combine the cabbage, half the cilantro and half the dressing. Toss to coat and season with salt and pepper to taste. Set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4443\/20150403-2142-15249-4887\/FP_021115_1_20Shrimp_20Tacos_20-_209969_high_feature.jpg","title":" Make the salsa:  ","desc":" In a medium bowl, combine the pineapple, avocado, remaining cilantro, the juice of the remaining lime wedges and a drizzle of olive oil. Toss to coat and season with salt and pepper to taste. Set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4444\/20150403-2142-14048-5305\/FP_021115_1_20Shrimp_20Tacos_20-_209970_high_feature.jpg","title":" Toast the pepitas:  ","desc":" In a large pan, heat 1 teaspoon of olive oil on medium-high until hot. Add the pepitas and a pinch of the spice blend; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until golden brown and toasted. Transfer to a bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4445\/20150403-2142-15321-4262\/FP_021115_1_20Shrimp_20Tacos_20-_209971_high_feature.jpg","title":" Cook the shrimp:  ","desc":" Season the shrimp with salt, pepper and the remaining spice blend. In the same pan used to toast the pepitas, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned shrimp. Cook, flipping halfway through, 2 to 4 minutes, or until opaque and cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1136\/recipe_steps\/4446\/20150403-2142-13264-1575\/FP_021115_1_20Shrimp_20Tacos_20-_209973_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" While the shrimp cook, arrange the lettuce on a serving dish in a single layer. Drizzle with as much of the remaining dressing as you&rsquo;d like (you may have extra). Divide the toasted pepitas and cheese between the leaves. Stack the tortillas on a sheet pan and warm in the oven 3 to 5 minutes, or until soft and pliable. Transfer to a clean, dry work surface. Fill each of the warmed tortillas with some of the cabbage slaw, cooked shrimp and salsa. Transfer to a serving dish. Serve with the salad and any remaining cabbage slaw, cooked shrimp and salsa on the side. Enjoy!  "}]}