{"category":"Beef","link":"sirloin-tip-steaks-with-new-potatoes-asparagus-baby-artichoke-hash","thumb":"\/\/media.blueapron.com\/recipes\/1128\/c_main_dish_images\/20150417-1914-1404-2058\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4108_high_also_thumb.jpg","title":" Sirloin Tip Steaks ","subtitle":" with New Potato, Asparagus &amp; Radish Hash ","headbg":"\/\/media.blueapron.com\/recipes\/1128\/c_main_dish_images\/20150417-1914-1360-8189\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4107_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  620    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chefs, we love a good hash. Traditionally, potatoes are the stars of the dish&mdash;beautifully crisped and browned to savory perfection. And in spring, there&rsquo;s a special kind of potato available, which we&rsquo;re using to make this hash unique. While they&rsquo;re not a separate variety, new potatoes (potatoes harvested while they&rsquo;re still young) are incredibly delicious. With other spring vegetables like radish and asparagus, juicy slices of sirloin and an Italian salsa verde, this is a new, gourmet spin on one of our favorite meals. ","ingbg":"\/\/media.blueapron.com\/recipes\/1128\/ingredient_images\/20150421-1456-12-2548\/flank-steak-with-hash-2p-w3_large_feature.png","ingredients":[" 2  Sirloin Tip Steaks "," 3  Cloves Garlic ","  ½  Bunch Asparagus   "," 3  Ounces Radishes "," 1  Lemon "," 1  Red Onion "," 6  Ounces New Potatoes "," 1  Large Bunch Parsley ","  2  Tablespoons Capers   "," 2  Tablespoons Sliced Almonds ","  ¼  Cup Grated Parmesan Cheese   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4554\/20150417-2126-3668-4146\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4100_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Remove the steaks from the refrigerator to bring to room temperature. Peel and thinly slice the garlic. Snap off and discard the tough, woody ends of the asparagus stems; cut the asparagus into 1-inch pieces on an angle. Quarter and deseed the lemon. Peel and large dice the onion. Quarter the potatoes. Finely chop the parsley leaves and stems. Roughly chop the capers and almonds. Trim off and discard the stem ends of the radishes. Cut the radishes into wedges.  "},{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4555\/20150417-2126-3696-4916\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4101_high_feature.jpg","title":" Cook the steaks:  ","desc":" Pat the steaks dry with paper towels and season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the seasoned steaks and cook 2 to 3 minutes per side for medium, or until cooked to your desired degree of doneness. Transfer to a cutting board, leaving any browned bits (or fond) in the pan. Loosely cover the steaks with aluminum foil and let rest for at least 5 minutes.   "},{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4556\/20150417-2126-3947-6449\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4103_high_feature.jpg","title":" Start the hash:  ","desc":" While the steaks rest, heat the pan of reserved fond on medium-high until hot. (If the pan seems dry, add 1 teaspoon of olive oil.) Add the potatoes and season with salt and pepper. Cook, stirring occasionally, 6 to 8 minutes, or until lightly browned. Add the radishes and cook, stirring occasionally, 2 to 3 minutes, or until the radishes and potatoes are tender when pierced with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4557\/20150417-2126-3711-6059\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4102_high_feature.jpg","title":" Make the salsa verde:  ","desc":" While the potatoes and radishes cook, in a medium bowl, combine the parsley, capers, almonds and Parmesan cheese. Slowly stir in 2 tablespoons of olive oil to create a paste; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4558\/20150417-2126-2578-0382\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4104_high_feature.jpg","title":" Finish the hash:  ","desc":" Add the asparagus, onion and garlic to the pan of potatoes and radishes; season with salt and pepper. Reduce the heat to medium and cook, stirring occasionally, 5 to 7 minutes, or until the asparagus is bright green and the onion is softened. Remove from heat and stir in the juice of 2 lemon wedges. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1128\/recipe_steps\/4559\/20150417-2127-2245-9554\/2P_112114_1_20R041715_20Steak_20Hash_20Asparagus_20Radish-4105_high_feature.jpg","title":" Plate your dish:  ","desc":" Find the lines of muscle (or grain) of the rested steaks; thinly slice against the grain. Divide the finished hash and sliced steak between 2 dishes. Top with the salsa verde. Garnish with the remaining lemon wedges. Enjoy!  "}]}