{"category":"Shellfish","link":"smoky-shrimp-creamy-cheddar-grits-with-corn-zucchini-cherry-tomatoes","thumb":"\/\/media.blueapron.com\/recipes\/1259\/c_main_dish_images\/20150626-1807-16-6674\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200459_high_also_thumb.jpg","title":" Smoky Shrimp &amp; Creamy Cheddar Grits ","subtitle":" with Corn, Zucchini &amp; Cherry Tomatoes ","headbg":"\/\/media.blueapron.com\/recipes\/1259\/c_main_dish_images\/20150626-1820-358-4357\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200458_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  530    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re serving corn two ways in this seasonal family meal. Grits, made from finely-ground maize, turn into an incredible porridge when simmered with water. We&rsquo;re stirring cheddar cheese and cr&egrave;me fra&icirc;che into ours, for savory richness and incredibly creamy texture. And we&rsquo;re topping the grits with a saut&eacute; of fresh corn, zucchini and cherry tomatoes, three of our favorite summer crops. Shrimp marinated in smoky spices complete the dish, in classic Southern fashion. ","ingbg":"\/\/media.blueapron.com\/recipes\/1259\/ingredient_images\/20150710-1959-671-3320\/Smoky-Shrimp-Creamy-Cheddar-Grits-FP-W_large_feature.png","ingredients":[" 1  Pound Shrimp ","  1¼  Cups Yellow Grits   "," 3  Ounces Cheddar Cheese "," 6  Ounces Cherry Tomatoes ","  2  Scallions   "," 2  Cloves Garlic ","  2  Ears Of Corn   "," 1  Lemon "," 1  Zucchini "," 2  Tablespoons Butter ","  ¼  Cup Crème Fraîche   "," 1  Tablespoon Smoky Shrimp Spice Blend (Old Bay Seasoning & Smoked Sweet Paprika) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5230\/20150626-1808-70-6074\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200451_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. In a medium pot, combine 5 cups of water and a big pinch of salt; heat to boiling on high. Grate the cheese. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cobs; discard the cobs. Trim off and discard the ends of the zucchini; medium dice the zucchini. Peel and thinly slice the garlic. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions; cut the green tops into &frac12;-inch pieces. Halve the cherry tomatoes. Quarter and deseed the lemon. Pat the shrimp dry with paper towels. In a medium bowl, combine the shrimp and spice blend; toss to coat and set aside to marinate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5231\/20150626-1809-85-2976\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200454_high_feature.jpg","title":" Make the cheddar grits:   ","desc":" Stir the grits into the pot of boiling water; reduce the heat to low. Cook, stirring frequently, 10 to 12 minutes, or until the water has been absorbed and the grits are tender. (If the grits seem dry, gradually add up to &frac14; cup of water to achieve your desired consistency.) Remove from heat. Whisk in the cheese, cr&egrave;me fra&icirc;che and half the butter until thoroughly combined; season with salt and pepper to taste. Cover and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5232\/20150626-1809-96-1211\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200452_high_feature.jpg","title":" Cook the corn &amp; zucchini:  ","desc":" While the grits cook, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the corn and zucchini; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until lightly browned and softened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5233\/20150626-1809-111-8629\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200453_high_feature.jpg","title":" Add the aromatics &amp; tomatoes:  ","desc":" Add the garlic, white bottoms of the scallions and cherry tomatoes to the pan of corn and zucchini; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until the tomatoes have softened slightly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5234\/20150626-1809-122-7637\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200455_high_feature.jpg","title":" Add the shrimp:  ","desc":" Add the marinated shrimp to the pan of vegetables; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the shrimp are opaque and cooked through. Stir in the remaining butter and the juice of all 4 lemon wedges. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1259\/recipe_steps\/5235\/20150626-1810-133-3290\/FP_030615_1_20Smoky_20Shrimp_20__20Creamy_20Cheddar_20Grits_20-_200456_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the cheddar grits between 4 bowls. Top with the cooked vegetables and shrimp. Garnish with the green tops of the scallions. Enjoy!  "}]}