{"category":"Beef","link":"southern-style-burger-with-green-tomato-chow-chow-roasted-old-bay-potatoes","thumb":"\/\/media.blueapron.com\/recipes\/461\/c_main_dish_images\/20150918-1526-120-3044\/Green_20Tomato_20Burger-3455_20EDIT_high_also_thumb.jpg","title":" Southern-Style Burgers ","subtitle":" with Green Tomato Chow Chow &amp; Old Bay Oven Fries ","headbg":"\/\/media.blueapron.com\/recipes\/461\/c_main_dish_images\/20140926-2024-13880-9686\/Green_20Tomato_20Burger-3454_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re updating the burger Southern-style&mdash;complete with all the fixings. First, instead of lettuce, simply-dressed collard greens give the burgers a mildly peppery kick. Next, in lieu of the classic condiments, you&rsquo;ll make chow chow&mdash;a slightly vinegary relish&mdash;featuring aromatics and green tomato. Green tomato is the delicious result of harvesting a red tomato early. It has a firm texture that&rsquo;s ideal for stewing, and its tartness perfectly cuts the richness of the burgers. Served with Old Bay-spiced oven fries, this meal is a uniquely Southern twist on an all-American classic. ","ingbg":"\/\/media.blueapron.com\/recipes\/461\/ingredient_images\/20151013-1640-26-4893\/green-tomato-burger-W_large_feature.png","ingredients":[" 10  Ounces Ground Beef "," 2  Sesame Seed Buns "," 2  Cloves Garlic "," ½  Bunch Collard Greens "," 1  Green Tomato "," 1  Red Onion "," ¾  Pound Russet Potato "," 2  Teaspoons Old Bay Seasoning "," 1  Tablespoon Chow Chow Spice Blend (Celery Seeds, Dill, Black Mustard Seeds, Turmeric & Cayenne Powder) "," 1  Tablespoon Sugar "," 1  Tablespoon White Vinegar "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3065\/20140926-2021-13727-3378\/Green_20Tomato_20Burger-3441_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut the potato lengthwise into &frac12;-inch-thick sticks; place in a bowl and toss with half the Old Bay seasoning. Peel and small dice the onion. Peel and mince the garlic. Core and medium dice the green tomato. Remove and discard the stems of the collard greens; thinly slice the leaves. Place the collard greens in a bowl; drizzle with olive oil and toss to coat. Season with salt and pepper to taste.Split the buns.  "},{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3066\/20140926-2021-16962-1373\/Green_20Tomato_20Burger-3444_high_feature.jpg","title":" Make the oven fries:  ","desc":" Place the seasoned potato on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast, turning halfway through, 22 to 25 minutes, or until browned and tender when pierced with a fork. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3068\/20140926-2021-16983-9332\/Green_20Tomato_20Burger-3442_high_feature.jpg","title":" Start the chow chow:  ","desc":" While the potato roasts, in a medium pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the onion, garlic and spice blend; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until the vegetables have softened and the mustard seeds have started to pop. Transfer half the cooked aromatics to a medium bowl and set aside to cool, leaving the rest in the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3069\/20140926-2021-13772-3140\/Green_20Tomato_20Burger-3443_high_feature.jpg","title":" Finish the chow chow:  ","desc":" While the potato continues to roast, add the green tomato, vinegar, sugar and &frac14; cup of water to the pot of remaining cooked aromatics; season with salt and pepper. Cook, stirring occasionally, 13 to 15 minutes, or until thickened and saucy. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3071\/20140926-2022-16995-0089\/Green_20Tomato_20Burger-3445_high_feature.jpg","title":" Form &amp; cook the burgers:  ","desc":" While the chow chow cooks, add the ground beef and remaining Old Bay seasoning to the bowl of cooled aromatics. Season with salt and pepper; stir to combine. Using your hands, form the mixture into two &frac34;-inch-thick burgers. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the burgers. Cook 2 to 4 minutes per side for medium, or until browned and cooked to your desired degree of doneness. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/461\/recipe_steps\/3073\/20140926-2021-16989-7200\/Green_20Tomato_20Burger-3447_high_feature.jpg","title":" Toast the buns &amp; plate your dish:  ","desc":" Heat the pan of reserved fond on medium-high until hot. Add the buns, cut sides down. Toast 30 seconds to 1 minute, or until lightly browned. Transfer to a clean, dry work surface. Place a cooked burger onto each toasted bun bottom. Top with the finished chow chow, dressed collard greens and toasted bun tops. Serve with the oven fries on the side. Enjoy!  "}]}