{"category":"Poultry","link":"spiced-turkey-chickpea-chili-with-chermoula-labneh-pita-croutons","thumb":"\/\/media.blueapron.com\/recipes\/1334\/c_main_dish_images\/20150824-1508-107-7846\/2P_081815_7_NorthAfricanChili_20-_201099_high_also_thumb.jpg","title":" Spiced Turkey &amp; Chickpea Chili ","subtitle":" with Chermoula, Labneh &amp; Pita Croutons ","headbg":"\/\/media.blueapron.com\/recipes\/1334\/c_main_dish_images\/20150824-1507-84-2475\/2P_081815_7_NorthAfricanChili_20-_201098_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chermoula is a vividly flavorful North African herb sauce. Here, we&rsquo;re using it to top a hearty turkey chili made with chickpeas and eggplant. The cilantro, garlic, lemon and olive oil perfectly complement the warming spices of ras el hanout, regarded as Morocco&rsquo;s &ldquo;national spice blend&rdquo; and one of the cuisine&rsquo;s fundamental ingredients. For crunchy texture and added creaminess, we&rsquo;re also topping the chili with pan-toasted pita croutons and tangy labneh (a Middle Eastern cheese made from strained yogurt). ","ingbg":"\/\/media.blueapron.com\/recipes\/1334\/ingredient_images\/20150827-1908-21-7394\/P-Spiced-Turkey-Chickpea-Chili-2P-W_large_feature.png","ingredients":[" 10  Ounces Ground Turkey "," 1  Pocketless Pita "," 1½  Cups Chickpeas "," 3  Cloves Garlic "," 1  Eggplant "," 1  Lemon "," 1  Red Onion "," 1  Bunch Cilantro "," 2  Tablespoons Tomato Paste ","  3  Tablespoons Labneh Cheese   "," 2  Tablespoons Turkey Chili Spice Blend (All-Purpose Flour, Ras El Hanout, Cumin, Coriander, Cardamom, Crushed Aleppo Pepper & Dried Orange Peel) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5776\/20150824-1535-414-0408\/2P_081815_7_NorthAfricanChili_20-_201084_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Small dice the pita. Drain and rinse the chickpeas. Cut off and discard the stem end of the eggplant; small dice. Peel and small dice the onion. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Finely chop the cilantro leaves and stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5777\/20150824-1535-419-7363\/2P_081815_7_NorthAfricanChili_20-_201085_high_feature.jpg","title":" Make the pita croutons:  ","desc":" In a large, straight-sided pan (or large pot), heat 2 teaspoons of olive oil on medium-high until hot. Add the pita; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until browned and toasted. Transfer to a paper towel-lined plate and immediately season with salt and pepper. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5778\/20150930-2137-18-7805\/2P_081815_7_R_082515_5_NorthAfricanChili_20-_203933_high_feature.jpg","title":" Start the chili:  ","desc":" In the pan used to toast the pita, heat 2 teaspoons of olive oil on medium-high until hot. Add the eggplant; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until browned. Add the ground turkey; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 5 minutes, or until browned and cooked through.  "},{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5779\/20150824-1536-438-0832\/2P_081815_7_NorthAfricanChili_20-_201092_high_feature.jpg","title":" Finish the chili:  ","desc":" Add the onion, spice blend, tomato paste and &frac34; of the garlic paste to the pan of eggplant and turkey; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until fragrant and the onion is softened. Add the chickpeas and 2 cups of water; season with salt and pepper. Cook, stirring occasionally, 8 to 10 minutes, or until the mixture has thickened. Remove from heat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5780\/20150824-1536-448-2776\/2P_081815_7_NorthAfricanChili_20-_201088_high_feature.jpg","title":" Make the chermoula &amp; season the labneh:  ","desc":" While the chili cooks, in a small bowl, combine the labneh cheese and the juice of 1 lemon wedge; season with salt and pepper to taste. Set aside. In a separate small bowl, combine the cilantro, lemon zest, remaining garlic paste and the juice of the remaining lemon wedges; season with salt and pepper to taste. Stir in enough olive oil to create a thick paste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1334\/recipe_steps\/5781\/20150824-1536-443-7915\/2P_081815_7_NorthAfricanChili_20-_201094_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished chili between 2 bowls. Garnish with the pita croutons, chermoula and seasoned labneh cheese. Enjoy!  "}]}