{"category":"Beef","link":"spiced-lamb-meatballs-with-garlic-toast-summer-squash-salad","thumb":"\/\/media.blueapron.com\/recipes\/1290\/c_main_dish_images\/20150708-1618-337-5110\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_208002_high_also_thumb.jpg","title":" Spiced Meatballs ","subtitle":" with Garlic Toasts &amp; Summer Squash Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1290\/c_main_dish_images\/20150708-1617-324-2943\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_208000_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  665    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Spiced meatballs served in a warming tomato sauce are a North African specialty. And one of their defining features is a hint of lemon. The bright citrus cuts the richness of the meatballs, perfectly balancing the dish. Here, we&rsquo;re including dried lemon peel in a blend of spices used to flavor the meatballs. And we&rsquo;re adding lemon zest and juice to a refreshing summer squash, mint and olive salad&mdash;served right on top of the meatballs, to bring the dish&rsquo;s flavors together. And to complete the meal, we&rsquo;re making crunchy, garlic baguette toasts, perfect for dipping in the sauce. ","ingbg":"\/\/media.blueapron.com\/recipes\/1290\/ingredient_images\/20150720-1827-37-5939\/Lamb-Meatballs-with-Garlic-Toasts-_-Summer-Squash-Salad-2P-W_large_feature.png","ingredients":[" 10  Ounces Ground Beef "," 1  Small Baguette "," 2  Cloves Garlic "," 1  Lemon "," 1  Summer Squash "," 1  Large Bunch Mint "," 2  Tablespoons Tomato Paste "," 1  Ounce Castelvetrano Olives ","  ⅓  Cup Grated Parmesan Cheese   "," 2  Tablespoons Breadcrumbs "," 1  Tablespoon Meatball Spice Blend (Crushed Aleppo Pepper, Dried Thyme, Garlic Powder, Mustard Powder & Dried Lemon Peel) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5296\/20150708-2036-285-9697\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207980_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 425&deg;F. Wash and dry the fresh produce. Slice the baguette into 1-inch-thick pieces on an angle. Peel the garlic. Mince 1 clove; using the side of your knife, smash until it resembles a paste (or use a zester). Leave the remaining clove whole. Using a peeler, remove the lemon rind, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Cut off and discard the stem of the squash; cut into 3-inch-long sticks. Pick the mint off the stems; discard the stems. Using the side of your knife, smash the olives; remove and discard the pits, then roughly chop.  "},{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5297\/20150708-2037-326-6858\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207981_high_feature.jpg","title":" Form the meatballs:  ","desc":" In a large bowl, combine the ground beef, breadcrumbs, garlic paste, spice blend, half the Parmesan cheese and half the mint (roughly chopping just before adding). Drizzle with olive oil and season with salt and pepper. Mix until just combined. Using your hands, form the mixture into 12 to 14 equal-sized meatballs.  "},{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5299\/20150708-2037-300-9850\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207983_high_feature.jpg","title":" Cook the meatballs &amp; make the sauce:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the meatballs. Cook, turning occasionally, 5 to 7 minutes, or until browned on all sides. Add the tomato paste. Cook, stirring frequently, 1 to 2 minutes, or until dark red. Add &frac34; cup of water; season with salt and pepper. Cook, stirring occasionally and spooning the sauce over the meatballs, 3 to 5 minutes, or until the sauce has reduced in volume by about half and the meatballs are cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5298\/20150708-2037-311-4392\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207984_high_feature.jpg","title":" Make the squash salad:  ","desc":" While the meatballs cook, in a medium bowl, combine the squash, lemon zest, olives, remaining mint (roughly chopping just before adding) and the juice of all 4 lemon wedges. Drizzle with olive oil and toss to coat; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5300\/20150708-2037-337-5763\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207986_high_feature.jpg","title":" Make the garlic toasts:  ","desc":" While the meatballs continue to cook, place the baguette slices on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in a single, even layer and toast in the oven 4 to 6 minutes, or until golden brown. Remove from the oven. When cool enough to handle, carefully rub both cut sides of each toasted baguette slice with the whole garlic clove; discard the garlic clove.  "},{"img":"\/\/media.blueapron.com\/recipes\/1290\/recipe_steps\/5301\/20150708-2038-348-1640\/2P_062615_1_Lamb_20Meatballs_20with_20Garlic_20Toasts_20__20Summer_20Squash_20Salad_20-_207993_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cooked meatballs and sauce between 2 dishes. Top with the squash salad and remaining Parmesan cheese. Serve with the garlic toasts on the side. Enjoy!  "}]}