{"category":"Beef","link":"steak-fajitas-with-guacamole-roasted-zucchini-rounds","thumb":"\/\/media.blueapron.com\/recipes\/1186\/c_main_dish_images\/20150601-2051-112-5368\/FP_040315_2_20Steak_20Fajitas-2-7_20EDIT_high_also_thumb.jpg","title":" Steak Fajitas ","subtitle":" with Guacamole &amp; Roasted Zucchini Rounds ","headbg":"\/\/media.blueapron.com\/recipes\/1186\/c_main_dish_images\/20150601-2050-97-1215\/FP_040315_2_20Steak_20Fajitas-2-6_20Edit_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  595    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the 1930s, the fajita&mdash;a savory tortilla wrap of beef and vegetables&mdash;was born in the Texas ranch lands. There, the Mexican vaqueros (&ldquo;cowboys&rdquo; in Spanish) would prepare the simple, satisfying meal over an open campfire. Well, we&rsquo;re bringing the Tex-Mex standard into your kitchen with this gourmet spin. Our fajitas are made with sliced steak, saut&eacute;ed bell peppers and authentic spices, and we&rsquo;re serving them with zesty guacamole and crispy, roasted zucchini rounds. Just wrap them up and enjoy, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1186\/ingredient_images\/20150601-2053-144-9980\/steak-fajitas-fp-w_large_feature.png","ingredients":[" 1  Pound Stir-Fry Cut Beef "," 8  Corn Tortillas "," 2  Green Bell Peppers "," 2  Zucchinis "," 1  Avocado "," 1  Lime "," 1  Yellow Onion "," 1  Large Bunch Cilantro "," 2  Ounces Queso Fresco ","  2  Tablespoons Tomato Paste   "," 1  Tablespoon Steak Fajita Spice Blend (Chipotle Chile Powder, Cumin, Mexican Oregano & Garlic Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4759\/20150507-2022-261-6731\/FP_040315_2_20Steak_20Fajitas-2_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut out and discard the stems, ribs and seeds of the bell peppers; thinly slice the bell peppers. Cut the zucchinis into &frac12;-inch-thick rounds. Quarter the lime. Peel, halve and thinly slice the onion. Pick the cilantro off the stems; discard the stems. Crumble the queso fresco.  "},{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4760\/20150507-2022-639-7745\/FP_040315_2_20Steak_20Fajitas-2-4_high_feature.jpg","title":" Roast the zucchinis:  ","desc":" Place the zucchinis on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in a single, even layer and roast 18 to 20 minutes, or until browned and tender when pierced with a fork. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4761\/20150507-2022-272-1627\/FP_040315_2_20Steak_20Fajitas-2-3_high_feature.jpg","title":" Cook the bell peppers &amp; onion:  ","desc":" While the zucchinis roast, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the bell peppers, onion and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened. Add the tomato paste and cook, stirring frequently, 1 to 2 minutes, or until fragrant and thoroughly combined. Add &frac14; cup of water and cook, stirring frequently and scraping up any browned bits from the bottom of the pan, 30 to 45 seconds, or until well combined. Season with salt and pepper to taste. Transfer to a serving dish; loosely cover with foil and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4762\/20150507-2022-283-1612\/FP_040315_2_20Steak_20Fajitas-2-2_high_feature.jpg","title":" Make the guacamole:  ","desc":" While the zucchinis continue to roast and the bell peppers and onion cook, halve, pit and peel the avocado. Transfer to a medium bowl. Using a fork, mash the avocado just until smooth. Stir in half the cilantro (roughly chopping just before adding) and the juice of 2 lime wedges; season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4763\/20150507-2023-661-0779\/FP_040315_2_20Steak_20Fajitas-2-10_high_feature.jpg","title":" Cook the beef:  ","desc":" While the zucchinis finish roasting, pat the beef dry with paper towels. Season with salt, pepper and the remaining spice blend. In the same pan used to cook the bell peppers and onion, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned beef in a single, even layer and cook, stirring occasionally, 4 to 6 minutes, or until cooked through. Transfer to the serving dish of cooked bell peppers and onion; loosely cover with foil and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1186\/recipe_steps\/4764\/20150507-2023-294-5844\/FP_040315_2_20Steak_20Fajitas-2-5_high_feature.jpg","title":" Warm the tortillas &amp; serve your dish:  ","desc":" Stack the tortillas on a large piece of foil; wrap the foil around the tortillas. Place directly onto the oven rack and heat 2 to 3 minutes, or until warmed through. Carefully remove from the oven; unwrap and discard the foil. Transfer the warmed tortillas to the serving dish of cooked bell peppers, onion and beef. Garnish the cooked bell peppers, onion and beef and roasted zucchinis with the queso fresco and remaining cilantro and lime wedges. Serve with the guacamole on the side. Enjoy!  "}]}