{"category":"Poultry","link":"stir-fried-ginger-basil-chicken-with-coconut-rice","thumb":"\/\/media.blueapron.com\/recipes\/1272\/c_main_dish_images\/20150708-1624-478-3684\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-_high_also_thumb.jpg","title":" Stir-Fried Ginger-Basil Chicken ","subtitle":" with Tinkerbell Peppers &amp; Coconut Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1272\/c_main_dish_images\/20150708-1623-451-7055\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8124_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this gourmet take on a Thai classic, we&rsquo;re stir-frying chicken, aromatics and two beautiful, seasonal vegetables: Japanese eggplant and tinkerbell peppers (or miniature bell peppers). The stir-fry is completed by a powerfully flavorful sauce, made with tangy ponzu (a citrusy, soy-based sauce), sweet chili sauce and fragrant Thai basil. The sauce clings to the ingredients, deliciously glazing them and uniting their flavors. And on the side, we&rsquo;re serving hearty, easy coconut rice, for a traditional touch of sweetness. ","ingbg":"\/\/media.blueapron.com\/recipes\/1272\/ingredient_images\/20150804-1735-89-2065\/Stir-Fried-Ginger-Basil-Chicken-2P-W_large_feature.png","ingredients":[" 10  Ounces Chopped Chicken Thighs "," ½  Cup Jasmine Rice "," 3  Cloves Garlic "," 2  Scallions ","  1  Japanese Eggplant   "," ¼  Pound Tinkerbell Peppers "," 1  Large Bunch Thai Basil "," 2  Tablespoons Ponzu Sauce "," 1  1-Inch Piece Ginger "," ¼  Cup Coconut Milk Powder "," ¼  Cup Sweet Chili Sauce "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5302\/20150710-1659-139-3835\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken_20-_208109_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Cut off and discard the stem end of the eggplant; cut the eggplant into 1-inch-thick rounds on an angle. Cut out and discard the stems, ribs and seeds of the tinkerbell peppers; cut into &frac14;-inch-thick rings. Pick the Thai basil leaves off the stems; discard the stems. In a bowl, whisk together the coconut milk powder and &frac14; cup of water.  "},{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5303\/20150708-2038-374-0966\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8112_high_feature.jpg","title":" Make the coconut rice:  ","desc":" In a small pot, combine the rice, coconut milk mixture, a big pinch of salt and &frac34; cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 11 to 13 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and fluff the coconut rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5304\/20150708-2038-389-6924\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8110_high_feature.jpg","title":" Cook the eggplant:  ","desc":" While the rice cooks, in a large pan, heat 2 teaspoons of oil on medium-high until hot. Add the eggplant in a single, even layer; season with salt and pepper. Cook, flipping occasionally, 4 to 6 minutes, or until softened and browned. Transfer to a plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5305\/20150708-2038-400-8125\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8111_high_feature.jpg","title":" Start the stir-fry:  ","desc":" Pat the chicken dry with paper towels; season with salt and pepper. In the pan used to cook the eggplant, heat 2 teaspoons of oil on medium-high until hot. Add the seasoned chicken and cook, stirring occasionally, 5 to 7 minutes, or until browned and cooked through. Add the garlic, ginger, white bottoms of the scallions and tinkerbell peppers; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5306\/20150708-2039-422-1691\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8114_high_feature.jpg","title":" Finish the stir-fry:  ","desc":" To the pan of chicken and vegetables, add the cooked eggplant, sweet chili sauce, ponzu sauce, 1 tablespoon of water, half the Thai basil (tearing the leaves just before adding) and half the green tops of the scallions. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined and the liquid is slightly reduced in volume; remove from heat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1272\/recipe_steps\/5307\/20150708-2039-441-1075\/2P_063015_7_20Stir_20Fried_20Ginger_20Basil_20Chicken-8115_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the coconut rice and finished stir-fry between 2 dishes. Garnish with the remaining Thai basil and green tops of the scallions. Enjoy!  "}]}