{"category":"Beef","link":"sumac-spiced-steak-honeynut-squash-with-pickled-onion-apple-walnut-salad","thumb":"\/\/media.blueapron.com\/recipes\/1375\/c_main_dish_images\/20150921-1708-107-0708\/2P_091515_3_Sumac-SpicedSteak_20-_200719_high_also_thumb.jpg","title":" Sumac-Spiced Steak &amp; Honeynut Squash ","subtitle":" with Pickled Onion &amp; Apple-Walnut Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1375\/c_main_dish_images\/20150921-1709-116-2725\/2P_091515_3_Sumac-SpicedSteak_20-_200718_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  640    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" With this recipe, we&rsquo;re putting a spin on the traditional steak dinner by serving our steaks with roasted honeynut squash. A smaller, sweeter cousin of butternut squash, honeynut is delicious sprinkled with sumac, a versatile spice from the Middle East that adds vivid color and a tangy, lemony flavor. Served with pickled onion and a salad made from savory feta cheese, juicy apple and hearty walnuts, this is a bright and flavorful dinner that showcases fall&rsquo;s best produce. (For the perfect, juicy medium-rare steaks, be sure to flip the steaks only once, and to cook them just until pink in the center.) ","ingbg":"\/\/media.blueapron.com\/recipes\/1375\/ingredient_images\/20151020-1938-42-2431\/M-Sumac-Spiced-Steak-2P-W_large_feature.png","ingredients":[" 2  Steaks "," 1  Apple "," 1  Honeynut Squash ","  1  Lemon   ","  1  Red Onion   "," 1  Bunch Mint "," 1  Tablespoon Sugar "," ¼  Cup Crumbled Feta Cheese "," 2  Tablespoons Walnuts "," 2  Teaspoons Steak & Squash Spice Blend (Ground Sumac & Crushed Aleppo Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5868\/20150921-1726-347-3601\/2P_091515_3_Sumac-SpicedSteak_20-_200707_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut off and discard the top and bottom ends of the squash. Using a sharp, sturdy knife, peel the squash and cut into &frac12;-inch-thick rounds; cut out and discard the pulp and seeds. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel the onion and cut into &frac14;-inch-thick rings. Core and small dice the apple; toss with the juice of 1 lemon wedge to prevent browning. Roughly chop the walnuts. Pick the mint leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5869\/20150921-1726-360-3424\/2P_091515_3_Sumac-SpicedSteak_20-_200712_high_feature.jpg","title":" Roast the squash:  ","desc":" Place the squash on a sheet pan. Drizzle with olive oil and season with salt, pepper and half the spice blend; toss to thoroughly coat. Arrange in a single, even layer and roast, turning halfway through, 20 to 22 minutes, or until browned and tender when pierced with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5870\/20150921-1726-365-2706\/2P_091515_3_Sumac-SpicedSteak_20-_200708_high_feature.jpg","title":" Pickle the onion:  ","desc":" While the squash roasts, in a large pan, combine the onion, sugar, a big pinch of salt, the juice of the remaining lemon wedges and &frac14; cup of water. Heat to boiling on medium-high. Cook, stirring occasionally, 2 to 3 minutes, or until the onion has softened and the liquid is slightly reduced in volume. Transfer the mixture to a heatproof bowl and set aside to pickle for at least 10 minutes. Carefully rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5871\/20150921-1726-370-3561\/2P_091515_3_Sumac-SpicedSteak_20-_200711_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the squash continues to roast, pat the steaks dry with paper towels; season on both sides with salt, pepper and the remaining spice blend. In the pan used to pickle the onion, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned steaks and cook 2 to 4 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Transfer to a plate and loosely cover with aluminum foil. Let rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5872\/20150921-1727-380-2172\/2P_091515_3_Sumac-SpicedSteak_20-_200710_high_feature.jpg","title":" Make the apple-walnut salad:  ","desc":" While the steaks rest, in a medium bowl, combine the walnuts, apple, cheese, lemon zest and mint (finely chopping just before adding). Drizzle with olive oil and toss to coat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1375\/recipe_steps\/5873\/20150921-1727-385-5367\/2P_091515_3_Sumac-SpicedSteak_20-_200713_high_feature.jpg","title":" Plate your dish:  ","desc":" Find the lines of muscle (or grain) of the rested steaks; thinly slice crosswise against the grain. Divide the sliced steaks, roasted squash and pickled onions (draining just before adding) between 2 plates. Top with the apple-walnut salad. Enjoy!  "}]}