{"category":"Vegetarian","link":"summer-pepper-shakshuka-with-baked-eggs-za-atar-spiced-pitas","thumb":"\/\/media.blueapron.com\/recipes\/1319\/c_main_dish_images\/20150806-1815-45-0096\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0476_high_also_thumb.jpg","title":" Summer Pepper Shakshuka ","subtitle":" with Baked Eggs &amp; Za'atar-Spiced Pitas ","headbg":"\/\/media.blueapron.com\/recipes\/1319\/c_main_dish_images\/20150806-1815-131-9621\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0475_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  560    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Shakshuka is a popular North African dish featuring poached eggs. Instead of water, the eggs are poached in a flavorful sauce, usually comprised of tomatoes and peppers&mdash;both of which are at the height of ripeness in late summer. In this recipe, we&rsquo;re simmering the vegetables, then poaching the eggs by baking the dish, resulting in the perfect consistency. In step 6, if you don&rsquo;t have an oven-safe pan, don&rsquo;t worry! Simply transfer the mixture to a baking dish before cracking the eggs into the sauce. Served with spiced pitas, this beautiful, wholesome meal is an amazingly delicious way to celebrate the closing of the season. ","ingbg":"\/\/media.blueapron.com\/recipes\/1319\/ingredient_images\/20150811-1622-26-1628\/V2-shakshouka-pita-2P-W_large_feature.png","ingredients":[" 2  Farm Eggs "," 2  Pocketless Pitas "," 2  Red Bell Peppers "," 2  Sweet Peppers "," 1  Beefsteak Tomato ","  1  Red Onion   "," ½  Pound Fingerling Potatoes "," 1  Large Bunch Parsley "," 2  Tablespoons Tomato Paste "," ½  Cup Crumbled Feta Cheese "," 1  Tablespoon Shakshuka Spice Blend (Za'atar, Crushed Aleppo Pepper, Ground Sumac, Dried Thyme & Garlic Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5564\/20150806-1935-116-8834\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0456_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Cut each pita into small triangles. Cut out and discard the stems, ribs and seeds of the bell peppers; large dice. Cut out and discard the stems of the sweet peppers; remove and discard the seeds. Thinly slice the sweet peppers into rings. Core and large dice the tomato. Peel and small dice the onion. Cut the potatoes into &frac14;-inch-thick rounds. Pick the parsley leaves off the stems; discard the stems and roughly chop the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5565\/20150806-1935-36-5414\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0457_high_feature.jpg","title":" Cook the potatoes:  ","desc":" In a medium pan (nonstick and oven-safe, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the potatoes; season with salt and pepper. Cook, stirring occasionally, 5 to 7 minutes, or until browned and tender. Transfer to a bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5566\/20150806-1935-127-6015\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0459_high_feature.jpg","title":" Start the sauce:  ","desc":" In the pan used to cook the potatoes, heat 2 teaspoons of olive oil on medium-high until hot. Add the bell peppers and onion; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened. Add the tomato paste and &frac34; of the spice blend; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until the tomato paste is dark red and the spices are fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5567\/20150806-1935-16-7043\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0462_high_feature.jpg","title":" Finish the sauce:  ","desc":" Add the tomato, sweet peppers, cooked potatoes, 2\/3 of the parsley and 1&frac14; cups of water to the pan; season with salt and pepper. Cook, stirring occasionally, 5 to 7 minutes, or until thickened and saucy. Season with salt and pepper to taste. (If your pan is not oven-safe, transfer the finished sauce to a baking dish.)  "},{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5568\/20150806-1935-28-5642\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0460_high_feature.jpg","title":" Toast the pitas:  ","desc":" While the sauce cooks, place the pitas on a sheet pan. Drizzle with olive oil and season with salt, pepper and the remaining spice blend; toss to thoroughly coat. Arrange in a single, even layer and toast in the oven 5 to 7 minutes, or until lightly browned and fragrant. Remove from the oven and transfer to a serving dish, leaving the oven on.  "},{"img":"\/\/media.blueapron.com\/recipes\/1319\/recipe_steps\/5569\/20150806-1936-40-1218\/2P_071615_1_20R_080415_2_20Shakshuka_20Pita-0466_high_feature.jpg","title":" Bake the shakshuka &amp; serve your dish:  ","desc":" Using a spoon, create 2 wells in the finished sauce. Crack an egg into each well; season with salt and pepper. Sprinkle the cheese over the sauce and eggs. Bake 6 to 8 minutes, or until the egg whites are set. Remove from the oven and let cool for 2 minutes. Garnish the baked shakshuka with the remaining parsley. Serve with the toasted pitas on the side. Enjoy!  "}]}