{"category":"Poultry","link":"taiwanese-three-cup-chicken-with-choy-sum-jasmine-rice","thumb":"\/\/media.blueapron.com\/recipes\/1292\/c_main_dish_images\/20150817-1803-113-2920\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200957_high_also_thumb.jpg","title":" Taiwanese Three Cup Chicken ","subtitle":" with Choy Sum &amp; Jasmine Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1292\/c_main_dish_images\/20150817-1802-102-1564\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200956_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  675    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Three cup chicken is a popular Taiwanese dish named for the folk recipe used to make its sauce: one cup each of soy sauce, sesame oil and rice vinegar. Today, chefs typically adjust these proportions, to achieve the perfect balance of savory flavor. The essence of the dish, though, remains the same. The chicken is browned with aromatics, then finished in the sauce, which acts as a braising liquid. We&rsquo;re pairing our chicken with choy sum, a leafy green vegetable with a crunchy stem (similar to bok choy) and a side of jasmine rice. ","ingbg":"\/\/media.blueapron.com\/recipes\/1292\/ingredient_images\/20150818-1502-76-5085\/p-taiwanese-three-cup-chicken-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Breasts "," ½  Cup Jasmine Rice "," 3  Cloves Garlic "," 3  Scallions "," ½  Pound Choy Sum ","  1  Bunch Thai Basil   "," 3  Tablespoons Soy Sauce "," 2  Tablespoons Sesame Oil "," 1  1-Inch Piece Ginger ","  ¼  Cup Rice Vinegar   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5424\/20150817-1521-35-6659\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200950_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions; thinly slice the white bottoms and cut the green tops into &frac12;-inch pieces. Cut off and discard the ends of the choy sum stems; halve lengthwise. Pick the Thai basil leaves off the stems; discard the stems. Cut the chicken into 6 equal-sized pieces; thoroughly wash your hands, knife and cutting board after handling the chicken.  "},{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5425\/20150721-2127-498-5328\/2P_071415_5_Taiwanese3CupChicken_20-_208619_high_feature.jpg","title":" Cook the rice:  ","desc":" In a small pot, combine the rice, a big pinch of salt and 1 cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat. Fluff the cooked rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5426\/20150817-1522-46-4602\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200951_high_feature.jpg","title":" Cook the choy sum:  ","desc":" While the rice cooks, in a large pan, heat 2 teaspoons of oil on medium-high until hot. Add the choy sum and &frac12; cup of water; season with salt and pepper. Cook, turning occasionally, 5 to 7 minutes, or until the leaves have wilted and the stems are tender. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5427\/20150817-1522-57-4629\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200952_high_feature.jpg","title":" Brown the chicken &amp; cook the aromatics:  ","desc":" While the rice continues to cook, pat the chicken dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the choy sum, heat 2 teaspoons of oil on medium-high until hot. Add the seasoned chicken. Cook 2 to 3 minutes on the first side, or until browned. Flip the chicken and add the garlic, ginger, white bottoms of the scallions and sesame oil. Cook, stirring occasionally, 30 seconds to 1 minute, or until the aromatics are softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5428\/20150817-1522-76-5729\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200953_high_feature.jpg","title":" Make the sauce &amp; finish the chicken:  ","desc":" Add the vinegar and soy sauce to the pan of chicken and aromatics. Heat to boiling on medium-high. Once boiling, reduce the heat to medium-low. Cook, spooning the liquid over the chicken occasionally, 8 to 10 minutes, or until the chicken is cooked through. Stir in half the Thai basil and half the green top of the scallions. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1292\/recipe_steps\/5429\/20150817-1522-87-9088\/2P_071415_5_R081415_3_Taiwanese3CupChicken_20-_200954_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cooked rice, cooked choy sum and finished chicken between 2 plates. Garnish with the remaining Thai basil and green tops of the scallions. Enjoy!  "}]}