{"category":"Poultry","link":"tandoori-chicken-basmati-rice-with-coconut-tomato-broth-mint-yogurt","thumb":"\/\/media.blueapron.com\/recipes\/1378\/c_main_dish_images\/20151019-1641-37-2316\/FP_091615_4_R101615_1_TandooriChicken_20-_207360_high_also_thumb.jpg","title":" Tandoori Chicken &amp; Brown Rice ","subtitle":" with Coconut-Tomato Sauce &amp; Mint Yogurt ","headbg":"\/\/media.blueapron.com\/recipes\/1378\/c_main_dish_images\/20151019-1641-23-1138\/FP_091615_4_R101615_1_TandooriChicken_20-_207359_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Indian cooking is all about balancing diverse flavors. Sometimes&mdash;as in this recipe&mdash;all it takes are two deliciously contrasting ingredients to create that balance. The acidity of tomato sauce perfectly cuts the sweet richness of coconut milk. Simmered together with complex tandoori spices (including garam masala, turmeric and cardamom), they make a powerfully flavorful sauce for seared, spiced chicken and brown rice. Served on the side, a sauce of tart yogurt and fresh mint completes our unique spin on a traditional meal. ","ingbg":"\/\/media.blueapron.com\/recipes\/1378\/ingredient_images\/20151020-1939-127-8464\/FP-Tandoori-Chicken-2P-W_large_feature.png","ingredients":[" 4  Boneless, Skin-On Chicken Thighs "," ¾  Cup Brown Rice "," 1  8-Ounce Can Tomato Sauce "," 1¾  Cups Coconut Milk ","  ½  Cup Plain Greek Yogurt   "," 4  Cloves Garlic "," ¼  Pound Spinach "," 1  Bunch Mint "," 1  Large Bunch Cilantro "," 1  1-Inch Piece Ginger ","  2  Tablespoons Tandoori Chicken Spice Blend (Ground Turmeric, Ground Cardamom, Garam Masala, Ground Ginger, Whole Brown Mustard Seeds & Ground Cayenne Pepper)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1378\/recipe_steps\/5922\/20150924-2055-18-0299\/FP_091615_4_20Tandoori_20Chicken-4091_high_feature.jpg","title":" Cook the rice:  ","desc":" In a medium pot, combine the rice, a big pinch of salt and 1&frac12; cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to medium-low. Simmer 28 to 30 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and fluff with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1378\/recipe_steps\/5923\/20150924-2055-33-1027\/FP_091615_4_20Tandoori_20Chicken-4090_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Peel and mince the garlic and ginger. Pick the cilantro leaves off the stems; discard the stems. Pick the mint leaves of the stems; discard the stems and roughly chop the leaves. In a small bowl, combine the yogurt and mint; season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/1378\/recipe_steps\/5924\/20151019-1645-24-8367\/FP_091615_4_R101615_1_TandooriChicken_20-_207354_high_feature.jpg","title":" Start the chicken:  ","desc":" While the rice continues to cook, pat the chicken dry with paper towels; season on both sides with salt, pepper and half the spice blend. In a large, high-sided pan (or pot), heat 1 tablespoon of oil on medium-high until hot. Add the seasoned chicken, skin sides down. Cook 6 to 8 minutes on the first side, or until browned. Carefully drain off and discard any drippings from the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1378\/recipe_steps\/5925\/20151019-1645-33-4184\/FP_091615_4_R101615_1_TandooriChicken_20-_207355_high_feature.jpg","title":" Make the sauce:  ","desc":" Reduce the heat to medium. Flip the chicken and add the garlic, ginger and remaining spice blend; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the tomato sauce and coconut milk (shaking the can just before opening); season with salt and pepper. Stir until thoroughly combined. Simmer, stirring occasionally, 6 to 8 minutes, or until the chicken is cooked through and the liquid has thickened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1378\/recipe_steps\/5926\/20151019-1645-43-6445\/FP_091615_4_R101615_1_TandooriChicken_20-_207356_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Add the spinach to the pan of chicken and sauce; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until wilted. Remove from heat; season with salt and pepper to taste. Divide the cooked rice between 4 dishes. Top with the finished chicken and sauce. Garnish with the cilantro. Serve with the mint yogurt on the side. Enjoy!  "}]}