{"category":"Poultry","link":"vietnamese-chicken-wings-with-lemongrass-jasmine-rice","thumb":"\/\/media.blueapron.com\/recipes\/1239\/c_main_dish_images\/20150615-2202-1161-9791\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207149_high_also_thumb.jpg","title":" Vietnamese Chicken Wings ","subtitle":" with Lemongrass Brown Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1239\/c_main_dish_images\/20150615-2201-1146-1335\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207148_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  605    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chicken wings, a dish invented in the 1960s in Buffalo, New York, have become a national phenomenon. In the original recipe, the wings were deep fried and coated in a cayenne hot sauce. But today, there are hundreds of different takes on the classic. Our version features a tart sauce inspired by the cuisine of Vietnam, and for a lighter touch, we&rsquo;re roasting the wings instead of frying them. The result&mdash;paired with two nutritious sides brimming with authentic Vietnamese flavors&mdash;is a uniquely satisfying and delicious dinner. ","ingbg":"\/\/media.blueapron.com\/recipes\/1239\/ingredient_images\/20150626-1919-2573-9172\/Vietnamese-Chicken-Wings-with-Lemongrass-Long-Grain-Rice-2P-W_large_feature.png","ingredients":[" 1¼  Pounds Chicken Wings "," ¾  Cup Long Grain Brown Rice "," 1  Romaine Heart "," 1  Lime "," 1  Stalk Lemongrass "," 1  Large Bunch Cilantro "," 2  Tablespoons Soy Glaze ","  1  Shallot   "," 1  Tablespoon Sambal Oelek "," 1  Tablespoon Vegetarian Worcestershire Sauce "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5134\/20150616-2202-764-7180\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207131_high_feature.jpg","title":" Roast the chicken:  ","desc":" Preheat the oven to 475&deg;F. Line a sheet pan with foil. Pat the chicken wings dry with paper towels and place on the foil-lined sheet pan. Drizzle with oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast 22 to 24 minutes, or until lightly browned and cooked through. Remove from the oven and set aside in a warm place, leaving the oven on.  "},{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5135\/20150616-2202-775-0806\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207127_high_feature.jpg","title":" Prepare the ingredients &amp; make the sauce:  ","desc":" While the chicken roasts, wash and dry the fresh produce. Cut off and discard the lemongrass ends; peel off and discard the fibrous, outer layers until you reach the white, pliable core. Mince the core. Cut off and discard the root end of the lettuce. Pick the cilantro off the stems; discard the stems. Using a peeler, remove the rind of the lime, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter the lime.Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the juice of all 4 lime wedges. In a bowl, combine the soy glaze, Worcestershire sauce and as much of the sambal oelek as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be.  "},{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5136\/20150616-2202-790-4813\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207133_high_feature.jpg","title":" Cook the rice:  ","desc":" While the chicken continues to roast, in a small pot, heat 2 teaspoons of oil on medium-high until hot. Add the lemongrass; cook, stirring frequently, 2 to 4 minutes, or until fragrant. Add the rice, a big pinch of salt and 1&frac12; cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 18 to 20 minutes, or until the water has been absorbed and the rice is tender. Remove from heat. Stir in the lime zest; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5137\/20150616-2203-801-1385\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207130_high_feature.jpg","title":" Make the vinaigrette:  ","desc":" While the rice cooks, season the shallot-lime juice mixture with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5138\/20150616-2203-817-4519\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207132_high_feature.jpg","title":" Coat &amp; finish the chicken:  ","desc":" Transfer the roasted chicken wings to a large bowl. Add half the sauce; toss to thoroughly coat. Return to the foil-lined sheet pan and arrange in a single, even layer. Roast 6 to 8 minutes, or until browned. Remove from the oven. Top with the remaining sauce.  "},{"img":"\/\/media.blueapron.com\/recipes\/1239\/recipe_steps\/5139\/20150616-2203-828-0586\/2P_061015_3_Vietnamese_20Chicken_20Wings_20with_20Lemongrass_20Long_20Grain_20Rice_20-_207135_high_feature.jpg","title":" Make the salad &amp; plate your dish:  ","desc":" Place the lettuce in a large bowl; season with salt and pepper. Add enough of the vinaigrette to coat the salad (you may have extra vinaigrette); toss to mix and season with salt and pepper to taste. Divide the finished chicken wings, cooked rice and salad between 2 plates. Garnish with the cilantro. Enjoy!  "}]}