{"category":"Pork","link":"with-sauteed-vegetables-cheddar-scallion-cornbread","thumb":"\/\/media.blueapron.com\/recipes\/1161\/c_main_dish_images\/20150415-2115-2218-4712\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209980_high_also_thumb.jpg","title":" Center-Cut Pork Chops ","subtitle":" with Sautéed Vegetables &amp; Cheddar-Scallion Cornbread ","headbg":"\/\/media.blueapron.com\/recipes\/1161\/c_main_dish_images\/20150415-2114-1968-0417\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209983-2_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chefs, there aren&rsquo;t too many things better than cornbread hot out of the oven. Deliciously rich and crumbly, it&rsquo;s a down-home classic, with a uniquely satisfying taste and texture. But, well, we think we may have found a way to make it even better: adding savory cheddar cheese and aromatic scallions. That&rsquo;s what we&rsquo;re doing here, serving the cornbread as a side for pork chops and an array of delicious vegetables, from collard greens to tangy bell peppers and onion. ","ingbg":"\/\/media.blueapron.com\/recipes\/1161\/ingredient_images\/20150429-1809-826-1517\/pork-chops-cornbread-fp-w_large_feature.png","ingredients":[" 4  Center-Cut Pork Chops "," 1  Farm Egg "," 1½  Cups Cornbread Mix "," 3  Scallions "," 2  Cloves Garlic "," 2  Red Bell Peppers "," 1  Bunch Collard Greens "," 1  Yellow Onion ","  2  Ounces Cheddar Cheese   "," 2  Tablespoons Tomato Paste "," 1  Tablespoon Sherry Vinegar "," 2  Teaspoons Pork Chop Spice Blend (Smoked Sweet Paprika & Instant Flour) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4507\/20150415-2117-2006-0782\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209963_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 375&deg;F. Wash and dry the fresh produce. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions on an angle; cut the green tops into &frac12;-inch pieces on an angle. Peel and mince the garlic. Cut out and discard the stems, ribs and seeds of the bell peppers; thinly slice the bell peppers. Remove and discard the collard green stems; roughly chop the leaves. Peel and thinly slice the onion. Grate the cheese.  "},{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4508\/20150415-2117-2025-5609\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209968_high_feature.jpg","title":" Make the cornbread:  ","desc":" Lightly oil a baking dish. In a large bowl, combine the cornbread mix, egg, cheese, ⅓ cup of water and half the green tops of the scallions; season with salt and pepper. Transfer to the oiled baking dish. Bake 15 to 20 minutes, or until a knife inserted into the center of the cornbread comes out clean. Remove from the oven and set aside to cool slightly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4509\/20150415-2118-2447-4319\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209965_high_feature.jpg","title":" Cook the pork chops:  ","desc":" While the cornbread bakes, pat the pork chops dry with paper towels; season on both sides with salt, pepper and the spice blend. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the pork chops; cook 3 to 5 minutes per side, or until browned and cooked through. Transfer to a serving dish, leaving any browned bits (or fond) in the pan. Loosely cover the pork chops with foil. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4510\/20150415-2118-2746-2198\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209967_high_feature.jpg","title":" Start the bell peppers &amp; onion:  ","desc":" While the cornbread continues to bake, add 1 tablespoon of olive oil to the pan of reserved fond. Heat on medium-high until hot. Add the bell peppers and onion; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and lightly browned.  "},{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4511\/20150415-2118-2714-4925\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209969_high_feature.jpg","title":" Finish the bell peppers &amp; onion:  ","desc":" To the pan of bell peppers and onion, add the tomato paste, vinegar, half the garlic, half the white bottoms of the scallions and &frac12; cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until the liquid is slightly reduced in volume; season with salt and pepper to taste. Transfer to the serving dish of cooked pork chops. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1161\/recipe_steps\/4512\/20150415-2118-2389-1039\/FP_031014_1_20Pork_20Chops_20with_20Cheddar_20Scallion_20Cornbread_20-_209970_high_feature.jpg","title":" Cook the collard greens &amp; serve your dish:  ","desc":" In the same pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the remaining garlic and white bottoms of the scallions. Cook, stirring occasionally, 30 seconds to 1 minute, or until softened and fragrant. Add the collard greens and &frac14; cup of water; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until wilted. Transfer to a serving dish. Garnish the cooked pork chops and finished bell peppers and onion with the remaining green tops of the scallions. Serve with the cooked collard greens and cornbread on the side. Enjoy!  "}]}