{"category":"Poultry","link":"za-atar-chicken-farro-salad-with-beet-goat-cheese-pistachios","thumb":"\/\/media.blueapron.com\/recipes\/1371\/c_main_dish_images\/20150903-2049-16-0974\/2P_090115_6_Za_atarChicken_Farro_20-_200130_high_also_thumb.jpg","title":" Za'atar Chicken &amp; Farro Salad ","subtitle":" with Beet, Goat Cheese &amp; Pistachios ","headbg":"\/\/media.blueapron.com\/recipes\/1371\/c_main_dish_images\/20150903-2050-26-4494\/2P_090115_6_Za_atarChicken_Farro_20-_200131_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this elegant dish, we&rsquo;re taking the classic combination of tangy goat cheese and sweet red beet and giving it delicious Middle Eastern flair. Seasoned with za&rsquo;atar&mdash;a traditional Middle Eastern spice blend of oregano, sesame seeds and sumac&mdash;the pan-seared chicken is lightly smoky, crispy and succulent. For extra heartiness, we&rsquo;re serving it over nutty farro mixed with mildly bitter arugula. Lastly, we&rsquo;re garnishing the dish with the goat cheese and beet (marinated with red wine vinegar and shallot), along with a second classic pairing: fresh mint and earthy pistachios. ","ingbg":"\/\/media.blueapron.com\/recipes\/1371\/ingredient_images\/20151006-1748-27-9834\/P-Zaatar-Chicken-Farro-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Breasts "," ½  Cup Semi-Pearled Farro "," 2  Ounces Arugula ","  1  Red Beet   "," 1  Bunch Mint "," 1  Tablespoon Red Wine Vinegar ","  2  Tablespoons Pistachios   "," 1  Shallot "," 2  Tablespoons Crumbled Goat Cheese "," 2  Teaspoons Za'atar "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5600\/20150910-1449-16-4677\/2P_090115_6_Za_atarChicken_Farro_20-_200114_high_feature.jpg","title":" Cook the farro:  ","desc":" Heat 1 large pot of salted water and 1 small pot of salted water to boiling on high. Once the large pot of water is boiling, add the farro. Cook 16 to 18 minutes, or until tender. Turn off the heat. Drain thoroughly and return to the pot.   "},{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5602\/20150910-1449-22-3849\/2P_090115_6_Za_atarChicken_Farro_20-_200113_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the farro cooks, wash and dry the fresh produce. Cut off and discard the root ends of the beet; peel and medium dice. (To avoid staining, line your cutting board with paper towels.) Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a medium bowl with the vinegar. Finely chop the arugula. Pick the mint leaves off the stems; discard the stems. Roughly chop the pistachios.  "},{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5604\/20150910-1449-28-9564\/2P_090115_6_Za_atarChicken_Farro_20-_200116_high_feature.jpg","title":" Cook &amp; dress the beet:  ","desc":" While the farro continues to cook, add the beet to the small pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a knife. Drain thoroughly and rinse under cold water for 20 to 30 seconds to stop the cooking process. Transfer to the bowl of shallot-vinegar mixture. Toss to coat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5603\/20150910-1449-34-4802\/2P_090115_6_Za_atarChicken_Farro_20-_200117_high_feature.jpg","title":" Cook the chicken:   ","desc":" While the beet cooks, pat the chicken dry with paper towels; season on both sides with salt, pepper and the za&rsquo;atar. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken. Cook, loosely covering the pan with aluminum foil, 4 to 6 minutes per side, or until browned and cooked through. Transfer the cooked chicken to a cutting board.  "},{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5605\/20150910-1449-40-3373\/2P_090115_6_Za_atarChicken_Farro_20-_200115_high_feature.jpg","title":" Make the farro salad:  ","desc":" Add the arugula to the pot of cooked farro. Drizzle with olive oil and stir to combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1371\/recipe_steps\/5606\/20150910-1450-52-1395\/2P_090115_6_Za_atarChicken_Farro_20-_200126_high_feature.jpg","title":" Plate your dish:   ","desc":" Just before serving, slice the cooked chicken crosswise on an angle. Divide the farro salad between 2 plates. Top with the sliced chicken and dressed beet. Garnish with the mint (finely chopping just before adding), pistachios and goat cheese. Enjoy!  "}]}