{"category":"Pork","link":"5-spice-pork-buns-with-red-cabbage-carrot-thai-basil-salad","thumb":"\/\/media.blueapron.com\/recipes\/373\/c_main_dish_images\/20140808-2036-180-2673\/Pork_20Belly_20Buns-1535_high_also_thumb.jpg","title":" 5-Spice Pork Buns ","subtitle":" with Red Cabbage, Carrot &amp; Thai Basil Salad ","headbg":"\/\/media.blueapron.com\/recipes\/373\/c_main_dish_images\/20140808-2036-180-2673\/Pork_20Belly_20Buns-1535_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"For our 365th recipe, we’re choosing one of our favorites, an authentic pork bun. You’ll use traditional flavors to create a crunchy red cabbage salad with ribbons of peppery Thai basil. But the real show piece of this meal is the tender, seared pork belly nestled in pillowy, snowy white steam buns.","desc":" For our 365th recipe, we’re choosing one of our favorites, an authentic pork bun. You’ll use traditional flavors to create a crunchy red cabbage salad with ribbons of peppery Thai basil. But the real show piece of this meal is the tender, seared pork belly nestled in pillowy, snowy white steam buns. ","ingbg":"\/\/media.blueapron.com\/recipes\/373\/ingredient_images\/20140807-2214-1596-8335\/pork-buns-ing-P_large_feature.png","ingredients":[" 8  Ounces Pork Belly "," 2  Scallions "," 2  Teaspoons Brown Sugar "," 1  Bunch Cilantro "," 1  Bunch Thai Basil "," 1  Carrot "," 1  Lime "," ½  Teaspoon Chinese Five-Spice Powder "," ¼  Head Red Cabbage "," 2  Teaspoons Sesame Oil "," 6  Chinese Steam Buns "," 2  Tablespoons Hoisin Sauce "," 1  Tablespoon Sriracha "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2318\/20140723-2026-3570-7578\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":"   \tWash and dry the fresh produce. In a medium pot, heat 2 to 3 inches of water to boiling on high. Thinly slice the scallions on an angle, separating the white bottoms and green tops. Pick the Thai basil and cilantro leaves off the stems; discard the stems. Peel the carrot and cut into thin matchsticks. Using a peeler, remove the green rind of the lime, avoiding the white pith; mince the peel to get 2 teaspoons of zest. Quarter the lime. Remove and discard the core of the cabbage, then thinly slice the leaves. Cut the pork belly into 6 pieces. Coat each pork piece with the brown sugar, Chinese 5-spice, and a little salt and pepper.   "},{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2319\/20140723-2026-5712-7642\/step2_high_feature.jpg","title":" Make the lime vinaigrette:  ","desc":"   \tSqueeze the juice of all 4 lime wedges into a small bowl and season with salt and pepper. Whisk in the sesame oil and 1 tablespoon of olive oil until well combined.   "},{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2320\/20140723-2026-3576-8730\/step3_high_feature.jpg","title":" Dress the salad:  ","desc":"   \tIn a large bowl, combine the cabbage, carrot, white parts of the scallions and Thai basil (roughly chopping or tearing the leaves before adding, if you&rsquo;d like). Season with salt and pepper. Add enough of the vinaigrette to coat the salad (you may have extra vinaigrette) and toss to thoroughly mix.   "},{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2321\/20140723-2026-4734-2036\/step4_high_feature.jpg","title":" Cook the pork:  ","desc":"   \tIn a large pan (nonstick, if you have one), heat 1 teaspoon of oil on medium-high until hot. Add the seasoned pork and cook 3 to 4 minutes per side, or until browned and cooked through. Remove from heat, add the lime zest and stir to thoroughly combine. Spoon the oil over the pork for 30 seconds to 1 minute, or until fragrant. Transfer the cooked pork to a paper towel-lined plate and set aside in a warm place as you continue cooking.   "},{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2322\/20140723-2026-5718-7789\/step5_high_feature.jpg","title":" Steam the buns:  ","desc":"   \tPlace a colander on top of the pot of boiling water, making sure that the water isn&rsquo;t high enough to touch the colander. Place the steam buns into the colander and tightly cover with the lid of the pot. Steam 3 to 4 minutes, or until softened and puffy. Using tongs, transfer the steamed buns to a plate.   "},{"img":"\/\/media.blueapron.com\/recipes\/373\/recipe_steps\/2323\/20140723-2026-3582-1356\/step6_high_feature.jpg","title":" Assemble the pork buns &amp; plate your dish:  ","desc":"   \tGently open each steam bun and spread a little hoisin sauce and as much sriracha as you&rsquo;d like (depending on how spicy you&rsquo;d like the dish) onto the inside of the buns. Divide the cooked pork evenly between the buns and garnish with the cilantro and green parts of the scallions. To plate your dish, divide the assembled pork buns and salad between 2 plates. Enjoy!   "}]}