{"category":"Beef","link":"arepas-de-carne-molida-with-avocado-pickled-jalapeno","thumb":"\/\/media.blueapron.com\/recipes\/1108\/c_main_dish_images\/20150512-1738-123-1799\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209923_high_also_thumb.jpg","title":" Arepas de Carne Molida ","subtitle":" with Avocado &amp; Pickled Jalapeño ","headbg":"\/\/media.blueapron.com\/recipes\/1108\/c_main_dish_images\/20150512-1738-112-0701\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209922_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re celebrating South American cuisine with this delicious, age-old meal. Arepas, which can be traced back to the indigenous peoples of Venezuela and Colombia, are savory, round flatbreads made with cornmeal. They&rsquo;re typically topped with meat and varied other ingredients (though they&rsquo;re tasty on their own, too). We&rsquo;re stacking ours high with carne molida (Spanish for &ldquo;ground beef&rdquo;), creamy avocado, peppery radishes and, for an extra pop of bright flavor, pickled jalape&ntilde;o and onion. ","ingbg":"\/\/media.blueapron.com\/recipes\/1108\/ingredient_images\/20150602-1739-927-9202\/arepas-w-ground-beef-piccadillo-2p-w2_large_feature.png","ingredients":[" 8  Ounces Ground Beef "," 1  Cup Masarepa "," 3  Ounces Radishes "," 1  Avocado "," 1  Lime "," 1  Red Onion "," 1  Large Bunch Cilantro "," 2  Tablespoons Red Wine Vinegar "," 2  Tablespoons Sugar "," 1  Jalapeño Pepper "," 2  Teaspoons Carne Molida Spice Blend (Ancho Chile Powder, Chipotle Powder, Garlic Powder, Ground Cumin, Ground Coriander, Mexican Oregano, Cocoa Powder, Ground Nutmeg & Cornstarch) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4812\/20150512-1741-146-4300\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209909_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut off and discard the stem ends of the radishes; thinly slice the radishes into rounds. Quarter the lime. Pit, peel and slice the avocado; toss with the juice of 1 lime wedge to prevent browning. Peel, halve and thinly slice the onion. Pick the cilantro leaves off the stems; discard the stems. Thinly slice the jalape&ntilde;o into rounds. (For a milder dish, remove and discard the seeds and ribs, then thinly slice the jalape&ntilde;o). Immediately wash your hands and cutting board afterwards.  "},{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4813\/20150512-1741-145-5257\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209910_high_feature.jpg","title":" Pickle the jalapeño &amp; onion:  ","desc":" In a small pan, combine the jalape&ntilde;o, sugar, vinegar and half the onion. Heat to boiling on high. Once boiling, cook, stirring occasionally, 1 to 2 minutes, or until the liquid is slightly reduced in volume. Transfer to a bowl and set aside to cool.  "},{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4814\/20150512-1742-156-0470\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209911_high_feature.jpg","title":" Brown the beef:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the ground beef. Cook, frequently breaking the meat apart with a spoon, 2 to 3 minutes, or until just cooked through; season with salt and pepper. Transfer to a bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4815\/20150512-1742-167-5497\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209912_high_feature.jpg","title":" Cook the aromatics &amp; finish the beef:  ","desc":" In the pan used to cook the beef, heat 2 teaspoons of olive oil on medium-high until hot. Add the remaining onion and as much of the spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the cooked beef and the juice of 1 lime wedge. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined. Transfer to a bowl and set aside to cool slightly. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4816\/20150512-1742-157-9434\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209914_high_feature.jpg","title":" Form the arepas:  ","desc":" In a large bowl, combine the masarepa, a big pinch of salt and 1 cup of lukewarm water. Stir until just combined (the dough should be damp and easy to shape). Using wet hands, divide the dough into 4 equal-sized balls. On a clean work surface, carefully flatten into &frac14;-inch-thick rounds.  "},{"img":"\/\/media.blueapron.com\/recipes\/1108\/recipe_steps\/4817\/20150512-1742-168-6769\/2P_021815_3_20Arepas_20with_20ground_20beef_20piccadillo_20-_209915_high_feature.jpg","title":" Cook the arepas &amp; plate your dish:  ","desc":" In the pan used to cook the aromatics and beef, heat 1 tablespoon of olive oil on medium-high until hot. Add the arepas and cook 2 to 4 minutes per side, or until golden brown and cooked through. Divide between 2 dishes. Top with the finished beef and avocado. Garnish with the radishes, cilantro and as much of the pickled jalape&ntilde;o and onion as you&rsquo;d like. Serve with the remaining lime wedges on the side. Enjoy!  "}]}