{"category":"Pork","link":"bbq-roast-pork-with-corn-on-the-cob-potato-salad-quick-pickles","thumb":"\/\/media.blueapron.com\/recipes\/1313\/c_main_dish_images\/20150806-1708-122-5547\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0344-centered_high_also_thumb.jpg","title":" BBQ Roast Pork ","subtitle":" with Corn on the Cob, Potato Salad &amp; Quick Pickles ","headbg":"\/\/media.blueapron.com\/recipes\/1313\/c_main_dish_images\/20150806-1708-144-4366\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0344_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  610    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this late-summer recipe, we&rsquo;re serving up roast pork with the works. Deliciously seasoned and coated with barbecue sauce, our pork comes with corn on the cob, creamy potato salad and crunchy, homemade dill pickles. (We&rsquo;re using fresh dill stems, along with garlic, sugar and white wine vinegar, to quickly pickle the cucumber slices.) Roasting the corn in a foil packet with seasonings and a little water ensures that the kernels come out perfectly juicy and brightly flavorful&shy;&mdash;like the rest of this classic American meal. ","ingbg":"\/\/media.blueapron.com\/recipes\/1313\/ingredient_images\/20150826-1605-29-2084\/FM-BBQ-pork-corn-on-the-cob-F-W_large_feature.png","ingredients":[" 1  Pork Roast "," ¼  Cup Barbecue Sauce "," 3  Cloves Garlic ","  2  Ears Of Corn   "," 1¼  Pounds Prince Of Orange Potatoes "," 1  Kirby Cucumber "," 1  Bunch Dill "," 2  Tablespoons Sugar "," 2  Tablespoons White Wine Vinegar "," ¼  Cup Low-Fat Sour Cream ","  1  Tablespoon Bbq Pork Spice Blend (Smoked Sweet Paprika, Light Brown Sugar, Whole Dried Thyme & Garlic Powder)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5576\/20150807-1525-63-3788\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0327-EDIT_high_feature.jpg","title":" Roast the pork:  ","desc":" Preheat the oven to 450&deg;F. Line a sheet pan with aluminum foil. Cut off and discard any netting from the pork; place on the prepared sheet pan. Drizzle the pork with 2 teaspoons of olive oil; season with salt, pepper and the spice blend. Roast 24 to 26 minutes, or until browned. Remove from the oven, leaving the oven on. Coat the browned pork with ⅓ of the barbecue sauce. Roast for an additional 6 to 8 minutes, or until cooked through. (An instant-read thermometer should register 145&deg;F.) Remove from the oven and transfer to a cutting board. Let rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5577\/20150807-1443-50-3701\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0323-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the pork roasts, wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Remove and discard the husks and silks of the corn; cut each cob into thirds. Peel the garlic cloves. Mince 1 clove; using the flat side of your knife, smash until it resembles a paste. Leave the remaining cloves whole. Thinly slice the cucumber into rounds; place in a heatproof bowl. Cut the potatoes into bite-sized pieces. Pick the dill leaves off the stems; reserve the stems and roughly chop the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5578\/20150807-1446-45-8332\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0331_high_feature.jpg","title":" Roast the corn:  ","desc":" While the pork continues to roast, cut a piece of aluminum foil large enough to completely enclose the corn. Place the corn in the center of the foil in a single layer. Rub with the garlic paste. Drizzle with olive oil and 1 tablespoon of water; season with salt and pepper. Toss to coat. Tightly wrap the foil around the seasoned corn to create a packet. Carefully place directly onto the oven rack. Roast 14 to 16 minutes, or until tender. Remove from the oven and carefully unwrap. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5579\/20150807-1446-16-1538\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0326_high_feature.jpg","title":" Make the pickles:  ","desc":" While the corn roasts, in a small pot, combine the whole garlic cloves, dill stems, vinegar, sugar and ⅓ cup of water; season with salt and pepper to taste. Heat to boiling on high. Once boiling, remove from heat and carefully pour into the heatproof bowl of cucumber. Set aside to pickle, stirring occasionally, for at least 10 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5580\/20150807-1446-57-1182\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0329_high_feature.jpg","title":" Make the potato salad:  ","desc":" While the corn continues to roast, add the potatoes to the pot of boiling water. Cook 13 to 15 minutes, or until tender when pierced with a fork. Drain thoroughly; rinse under cold water. Return to the pot. Off the heat, stir in the sour cream, dill leaves and 2 tablespoons of the pickling liquid; season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1313\/recipe_steps\/5581\/20150807-1446-33-3484\/FP_072915_5_BBQ_Pork_with_corn_on_the_cob-0333_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Find the lines of muscle (or grain) of the rested pork; thinly slice against the grain. Transfer to a serving dish. Drain off and discard the remaining pickling liquid from the pickles; discard the whole garlic cloves and dill stems. Transfer to a serving dish. Serve the sliced pork with the roasted corn, potato salad, drained pickles and remaining barbecue sauce on the side. Enjoy!  "}]}