{"category":"Poultry","link":"blackened-chile-dusted-chicken-with-zucchini-rice-pilaf-corn-tomato-salsa-lime-crema","thumb":"\/\/media.blueapron.com\/recipes\/450\/c_main_dish_images\/20140912-1919-6346-0911\/A61A3554_high_also_thumb.jpg","title":" Blackened Chile-Dusted Chicken ","subtitle":" with Zucchini Rice &amp; Corn-Tomato Sauté ","headbg":"\/\/media.blueapron.com\/recipes\/450\/c_main_dish_images\/20140912-1919-8180-7638\/A61A3553_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The technique of blackening is a time-tested method for making things delicious. The practice originated in Cajun cuisine and is most often used for fish. But why stop there? In this dish, we&rsquo;re applying the technique to chicken: coating it in ancho chile powder (a mild spice made from dried poblano peppers) and searing it in a hot pan. This allows the spice to toast and char slightly, bringing out its flavor and creating an amazing, crispy crust. On the side, we&rsquo;re serving rice cooked with zucchini, a summer saut&eacute; of corn, cherry tomatoes and aromatics and lime-seasoned Mexican crema. ","ingbg":"\/\/media.blueapron.com\/recipes\/450\/ingredient_images\/20150918-1459-25-5880\/P-blackened-chile-chicken-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Breasts "," ⅓  Cup White Basmati Rice "," 3  Ounces Cherry Tomatoes "," 3  Cloves Garlic "," 2  Scallions "," 1  Ear Of Corn "," 1  Lime "," 1  Zucchini "," 1  Bunch Cilantro "," 2  Tablespoons Mexican Crema "," 2  Teaspoons Ancho Chile Powder "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3004\/20140912-1922-8417-7256\/A61A3547_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic. Cut off and discard the stem end of the zucchini; small dice. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Quarter the tomatoes. Roughly chop the cilantro leaves and stems. Quarter the lime. In a bowl, combine the crema and the juice of 2 lime wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3005\/20140912-1805-4547-4095\/Blackened_20Chicken-2415_high_feature.jpg","title":" Make the zucchini rice:  ","desc":" In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the zucchini and half the garlic; season with salt and pepper. Cook, stirring occasionally, 1 to 3 minutes, or until softened and fragrant. Stir in the rice and ⅔ cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 14 to 16 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and stir in the juice of the remaining lime wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3006\/20140912-1922-6431-9728\/A61A3549_high_feature.jpg","title":" Cook the chicken:  ","desc":" While the rice cooks, pat the chicken dry with paper towels; season on both sides with salt, pepper and the ancho chile powder. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken. Cook, loosely covering the pan with aluminum foil, 4 to 6 minutes per side, or until blackened, crispy and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan. Loosely cover the cooked chicken with aluminum foil.  "},{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3007\/20140912-1805-4584-2158\/Blackened_20Chicken-2414_high_feature.jpg","title":" Start the corn-tomato sauté:  ","desc":" While the rice continues to cook, heat the pan of reserved fond on medium-high until hot. Add the corn; season with salt and pepper. (If the pan seems dry, add 1 teaspoon of olive oil.) Cook, stirring occasionally, 1 to 2 minutes, or until slightly softened. Add the tomatoes, white bottoms of the scallions and remaining garlic; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3008\/20140912-1806-3864-1735\/Blackened_20Chicken-2416_high_feature.jpg","title":" Finish the corn-tomato sauté:  ","desc":" Off the heat, add half the cilantro and half the green tops of the scallions to the pan of vegetables. Stir to combine and season with salt and pepper to taste  "},{"img":"\/\/media.blueapron.com\/recipes\/450\/recipe_steps\/3009\/20140912-1922-8478-6862\/A61A3550_high_feature.jpg","title":" Plate your dish:  ","desc":" Transfer the cooked chicken to a cutting board; slice crosswise. Stir any juices from the cutting board into the pan of vegetables. Divide the zucchini rice, finished corn-tomato saut&eacute; and sliced chicken between 2 plates. Garnish with the remaining cilantro and green tops of the scallions. Serve with the lime crema on the side. Enjoy!  "}]}