{"category":"Fish","link":"catfish-piccata-with-fresh-fettuccine-spinach","thumb":"\/\/media.blueapron.com\/recipes\/1373\/c_main_dish_images\/20150921-1711-144-5563\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200703_high_also_thumb.jpg","title":" Catfish Piccata &amp; Fresh Fettuccine ","subtitle":" with Verjus Blanc &amp; Spinach ","headbg":"\/\/media.blueapron.com\/recipes\/1373\/c_main_dish_images\/20150921-1710-130-2857\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200702_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Piccata is a traditional Italian preparation that involves coating a thin cutlet of meat or fish in flour, then pan-frying it and pairing it with a lemon-caper sauce. Here, we&rsquo;re making catfish piccata by mixing the bright, briny sauce into a bed of fresh fettuccine and spinach, then serving the flaky catfish fillets on top. Rosemary, crushed red pepper flakes and a little verjus blanc (or the juice of tart white grapes) add herbaceous heat and gourmet complexity to the dish. ","ingbg":"\/\/media.blueapron.com\/recipes\/1373\/ingredient_images\/20151020-1938-69-7731\/F-Catfish-Piccata-Fresh-Fettucine-2P-W_large_feature.png","ingredients":[" 2  Catfish Fillets "," 8  Ounces Fresh Fettuccine Pasta "," 4  Ounces Spinach "," 3  Cloves Garlic "," 1  Lemon "," 1  Bunch Rosemary ","  2  Tablespoons Butter   "," 2  Tablespoons Verjus Blanc ","  1  Tablespoon Capers   "," ½  Teaspoon Crushed Red Pepper Flakes "," ¼  Cup All-Purpose Flour "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1373\/recipe_steps\/5874\/20150921-1728-428-8689\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200687_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Roughly chop the capers. Pick the rosemary leaves off the stems; discard the stems and roughly chop the leaves. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Roughly chop the spinach.  "},{"img":"\/\/media.blueapron.com\/recipes\/1373\/recipe_steps\/5875\/20150921-1728-437-7728\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200688_high_feature.jpg","title":" Cook the pasta:  ","desc":" Using your hands, carefully separate the strands of the pasta; add to the pot of boiling water. Cook 2 to 3 minutes, or until al dente (still slightly firm to the bite). Reserving &frac34; cup of the pasta cooking water, thoroughly drain the cooked pasta. Rinse under warm water to prevent sticking.  "},{"img":"\/\/media.blueapron.com\/recipes\/1373\/recipe_steps\/5876\/20150921-1728-442-6847\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200689_high_feature.jpg","title":" Cook the catfish:  ","desc":" Place the flour on a plate. Pat the catfish fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the flour (tapping off any excess). In a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Add the fillets, coated sides down. Cook 3 to 4 minutes on the first side, or until golden brown. Flip and cook 1 to 2 minutes, or until cooked through. Transfer to a plate and set aside in a warm place. Carefully wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1373\/recipe_steps\/5877\/20150921-1729-451-6102\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200691_high_feature.jpg","title":" Make the sauce:  ","desc":" In the pan used to cook the catfish, melt the butter on medium-high until hot. Add the garlic, capers, lemon zest, half the rosemary and as much of the crushed red pepper flakes as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Add the spinach, verjus blanc and the juice of 2 lemon wedges; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the spinach has wilted.  "},{"img":"\/\/media.blueapron.com\/recipes\/1373\/recipe_steps\/5879\/20150921-1729-480-7190\/2P_091515_2_CatfishPiccataWithFreshFettucine_20-_200693_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Add the cooked pasta and half the reserved pasta cooking water to the pan of sauce; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Remove from heat; season with salt and pepper to taste. Divide the finished pasta between 2 dishes. Top each with a cooked catfish fillet. Garnish with the remaining rosemary and lemon wedges. Enjoy!  "}]}