{"category":"Poultry","link":"chicken-tetrazzini-with-mushrooms-broccoli-parmesan-breadcrumbs","thumb":"\/\/media.blueapron.com\/recipes\/1363\/c_main_dish_images\/20150901-1918-84-1866\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204575_high_also_thumb.jpg","title":" Chicken Tetrazzini ","subtitle":" with Mushrooms, Broccoli &amp; Parmesan Breadcrumbs  ","headbg":"\/\/media.blueapron.com\/recipes\/1363\/c_main_dish_images\/20150901-1917-71-0923\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204574_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  515    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Tetrazzini is a hearty casserole of chicken, mushrooms and pasta, traditionally combined in a rich cream sauce and then baked under a layer of breadcrumbs. An American dish, tetrazzini was named for a famous Italian opera singer who frequented the hotel restaurant where it was invented. In this recipe, we&rsquo;re adding broccoli (quickly boiled alongside egg noodles, our pasta of choice), and swapping out cream for milk to lighten the sauce a bit. Finally, we&rsquo;re mixing Parmesan cheese and a little olive oil into the panko breadcrumbs for the toasty crust, topping off the casserole with extra savory flavor. ","ingbg":"\/\/media.blueapron.com\/recipes\/1363\/ingredient_images\/20150929-1609-26-1648\/FP-Chicken-Mushroom-Broccoli-Tetrazzini-F-W_large_feature.png","ingredients":[" 6  Boneless, Skinless Chicken Thighs "," ½  Pound Egg Noodles "," 1  Cup Low-Fat Milk "," 1  Yellow Onion "," ½  Pound Broccoli "," ½  Pound White Mushrooms "," 2  Tablespoons All-Purpose Flour "," ⅔  Cup Grated Parmesan Cheese ","  ½  Cup Panko Breadcrumbs   ","  1  Tablespoon Tetrazzini Spice Blend (Sweet Paprika, Whole Oregano, Garlic Powder, Ground Nutmeg & Whole Thyme)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5824\/20150904-1902-21-3430\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204541_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Cut the broccoli into small florets. Quarter the mushrooms. Peel, halve and thinly slice the onion. Chop the chicken into bite-sized pieces; place in a small baking dish or large bowl. Season the chopped chicken with salt, pepper and the spice blend; toss to thoroughly coat. Thoroughly wash your hands, knife and cutting board after handling the chicken.  "},{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5825\/20150904-1903-27-0041\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204544_high_feature.jpg","title":" Cook the noodles &amp; broccoli:  ","desc":" Add the noodles to the pot of boiling water. Cook 2 to 4 minutes, or until slightly tender. Add the broccoli. Cook 1 to 2 minutes, or until the broccoli is bright green and the noodles are al dente (still slightly firm to the bite). Remove from heat. Drain thoroughly; rinse under cool water for 20 to 30 seconds to stop the cooking process. Return the cooked noodles and broccoli to the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5826\/20150904-1903-33-6530\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204549_high_feature.jpg","title":" Start the filling:  ","desc":" While the noodles cook, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the mushrooms. Cook, stirring occasionally, 3 to 5 minutes, or until lightly browned and softened. Add the seasoned chicken and onion. Cook, stirring occasionally, 6 to 8 minutes, or until the chicken has browned and the onion has softened; season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5827\/20150904-1903-39-5046\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204553_high_feature.jpg","title":" Finish the filling:  ","desc":" Sprinkle the flour into the pan of vegetables and chicken. Cook, stirring frequently, 30 seconds to 1 minute, or until thoroughly combined. Slowly add the milk and 1&frac14; cups of water; season with salt and pepper. Simmer, stirring frequently, 4 to 6 minutes, or until the liquid has thickened and the chicken is cooked through. Stir in half the cheese; season with salt and pepper to taste. Transfer to the pot of cooked noodles and broccoli. Stir to thoroughly combine.  "},{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5828\/20150904-1903-45-7827\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204554_high_feature.jpg","title":" Assemble the tetrazzini:  ","desc":" Transfer the finished filling to a large baking dish. In a bowl, combine the breadcrumbs and remaining cheese; season with salt and pepper. Stir in enough olive oil to moisten the mixture. Evenly spoon the mixture over the filling.  "},{"img":"\/\/media.blueapron.com\/recipes\/1363\/recipe_steps\/5829\/20150904-1903-57-5218\/FP_082615_2_ChickenMushroom_BroccoliTetrazzini_20-_204566_high_feature.jpg","title":" Bake &amp; serve your dish:  ","desc":" Place the tetrazzini in the oven and bake 10 to 12 minutes, or until browned and crispy on top. Remove from the oven and let stand for 2 minutes before serving. Enjoy!  "}]}