{"category":"Poultry","link":"chicken-bolognese-pasta-with-mascarpone-cheese-summer-squash-arugula-salad","thumb":"\/\/media.blueapron.com\/recipes\/1263\/c_main_dish_images\/20150619-1850-111-7346\/FP_061015_6_Chicken_20Bolongese_20-_207231_high_also_thumb.jpg","title":" Chicken Bolognese &amp; Rigatoni Pasta ","subtitle":" with Mascarpone Cheese &amp; Summer Squash-Arugula Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1263\/c_main_dish_images\/20150619-1849-97-6808\/FP_061015_6_Chicken_20Bolongese_20-_207230_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  655    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this Italian-inspired recipe, we&rsquo;re giving delicious, hearty bolognese a summer makeover. Our spin on the traditional meat sauce features chicken, for a lighter touch. And we&rsquo;re making the base with seasonal, colorful cherry tomatoes. Their sweetness is accented perfectly by that of mascarpone cheese&mdash;an exquisitely creamy variety that enriches and balances the acidic sauce. Finally, a side salad of arugula and summer squash completes this picture of warm-weather elegance. ","ingbg":"\/\/media.blueapron.com\/recipes\/1263\/ingredient_images\/20150619-1851-126-7672\/chicken-bolongese-summer-squash-fp-w_large_feature.png","ingredients":[" 14  Ounces Ground Chicken ","  ¾  Pound Rigatoni Pasta   "," 4  Cloves Garlic "," 2½  Ounces Arugula "," 1  Lemon "," 1  Summer Squash "," 1  Yellow Onion "," ½  Pound Multicolored Cherry Tomatoes ","  1  Large Bunch Basil   ","  2  Tablespoons Tomato Paste   "," ⅓  Cup Grated Parmesan Cheese "," ¼  Cup Mascarpone Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5200\/20150619-1855-200-7071\/FP_061015_6_Chicken_20Bolongese_20-_207200_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Peel and thinly slice the garlic. Peel and small dice the onion. Halve the cherry tomatoes. Pick the basil leaves off the stems; discard the stems. Trim off and discard the ends of the squash; very thinly slice the squash into rounds. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5201\/20150619-1856-215-3019\/FP_061015_6_Chicken_20Bolongese_20-_207206_high_feature.jpg","title":" Cook the pasta:  ","desc":" Add the pasta to the pot of boiling water. Cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Reserving 1 cup of the pasta cooking water, thoroughly drain the cooked pasta.  "},{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5202\/20150619-1856-226-1466\/FP_061015_6_Chicken_20Bolongese_20-_207202_high_feature.jpg","title":" Cook the chicken:  ","desc":" While the pasta cooks, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the ground chicken; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 6 minutes, or until browned and cooked through. Transfer to a bowl, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5203\/20150619-1856-237-8902\/FP_061015_6_Chicken_20Bolongese_20-_207204_high_feature.jpg","title":" Make the sauce:  ","desc":" While the pasta continues to cook, add 2 teaspoons of olive oil to the pan of reserved fond. Heat on medium-high until hot. Add the garlic and onion; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and fragrant. Add the tomato paste and cook, stirring frequently, 1 to 2 minutes, or until dark red. Add the cherry tomatoes, cooked chicken and 1 cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until the sauce has thickened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5204\/20150619-1857-256-1120\/FP_061015_6_Chicken_20Bolongese_20-_207207_high_feature.jpg","title":" Finish the pasta:  ","desc":" To the pan of sauce, add the cooked pasta, mascarpone cheese, half the Parmesan cheese, half the basil (roughly chopping just before adding) and half the reserved pasta cooking water; season with salt and pepper. Cook, stirring frequently, 2 to 4 minutes, or until the pasta is thoroughly coated. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Remove from heat and season with salt and pepper to taste. Transfer to a serving dish and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1263\/recipe_steps\/5205\/20150619-1857-267-9341\/FP_061015_6_Chicken_20Bolongese_20-_207212_high_feature.jpg","title":" Make the salad &amp; serve your dish:  ","desc":" In a large bowl, combine the arugula and squash; season with salt and pepper. Add half the remaining Parmesan cheese, the juice of all 4 lemon wedges and a drizzle of olive oil. Toss to coat; season with salt and pepper to taste. Transfer to a serving dish. Garnish the finished pasta with the remaining Parmesan cheese and remaining basil (roughly chopping just before adding). Serve with the salad on the side. Enjoy!  "}]}