{"category":"Poultry","link":"chicken-pad-kee-mao-with-red-pepper-onion","thumb":"\/\/media.blueapron.com\/recipes\/1310\/c_main_dish_images\/20150729-1912-32-1882\/2P_072815_3_ChickenPadKeeMao_20-_200137_high_also_thumb.jpg","title":" Chicken Pad Kee Mao ","subtitle":" with Bell Pepper &amp; Thai Basil ","headbg":"\/\/media.blueapron.com\/recipes\/1310\/c_main_dish_images\/20150729-1911-16-9958\/2P_072815_3_ChickenPadKeeMao_20-_200136_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  630    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Pad kee mao (or &ldquo;drunken noodles&rdquo;) is a classic Thai dish. Though the origin of the name is contested, one theory states that the noodles were typically paired with rice wine in local restaurants. A stir-fry of vegetables, a spicy, savory sauce and broad, tender rice noodles, it&rsquo;s hearty and deliciously textured. In our version, we&rsquo;re poaching chicken, then shredding it before finishing it in the stir-fry with the noodles and sauce. And to complete the dish&rsquo;s flavor profile, we&rsquo;re drizzling fresh lime juice over top, and garnishing the pad kee mao with anise-like Thai basil. ","ingbg":"\/\/media.blueapron.com\/recipes\/1310\/ingredient_images\/20150818-1915-48-1493\/P-chicken-pad-kee-mao-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Breasts "," ½  Pound Wide Rice Noodles "," 3  Scallions "," 1  Lime "," 1  Red Bell Pepper "," 1  Yellow Onion "," 1  Bunch Thai Basil "," 2  Tablespoons Golden Mountain Sauce "," 1  1-Inch Piece Ginger ","  1  Tablespoon Rice Vinegar   "," 1  Tablespoon Sambal Oelek "," 2  Tablespoons Soy Glaze "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5502\/20150806-1427-16-4203\/2P_072815_3_ChickenPadKeeMao_20-_200129_high_feature.jpg","title":" Cook &amp; shred the chicken:  ","desc":" Heat 2 large pots of salted water to boiling on high. Season the chicken with salt and pepper on both sides. Once the first pot of water is boiling, add the seasoned chicken. Cook 9 to 11 minutes, or until cooked through. Drain thoroughly and transfer to a cutting board. Using 2 forks, shred the cooked chicken into bite-sized pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5541\/20150806-1427-28-9642\/2P_072815_3_ChickenPadKeeMao_20-_200128_high_feature.jpg","title":" Cook the noodles:  ","desc":" While the chicken cooks, add the noodles to the second pot of boiling water. Cook 7 to 9 minutes, or until tender. Drain thoroughly and set aside. Wipe out the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5542\/20150806-1427-40-5888\/2P_072815_3_ChickenPadKeeMao_20-_200127_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the chicken and noodles cook, wash and dry the fresh produce. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions; cut the green tops into &frac12;-inch pieces. Peel and mince the ginger. Peel, halve and thinly slice the onion. Cut out and discard the stem, ribs and seeds of the bell pepper; thinly slice. Pick the basil leaves off the stems; discard the stems. Quarter the lime.  "},{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5543\/20150806-1428-52-2067\/2P_072815_3_ChickenPadKeeMao_20-_200130_high_feature.jpg","title":" Start the stir-fry &amp; make the sauce:  ","desc":" In the pot used to cook the noodles, heat 2 teaspoons of oil on medium-high until hot. Add the ginger, onion, white bottoms of the scallions and bell pepper; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant. While the vegetables cook, in a bowl, combine the soy glaze, Golden Mountain sauce, rice vinegar and as much of the sambal oelek as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be.  "},{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5544\/20150806-1428-64-7557\/2P_072815_3_ChickenPadKeeMao_20-_200131_high_feature.jpg","title":" Finish the stir-fry:  ","desc":" Add the shredded chicken, cooked noodles and sauce to the pot of vegetables. Cook, stirring occasionally, 2 to 4 minutes, or until the chicken and noodles are thoroughly coated. Stir in half the basil (tearing the leaves just before adding) and the juice of 2 lime wedges. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1310\/recipe_steps\/5545\/20150806-1428-81-7358\/2P_072815_3_ChickenPadKeeMao_20-_200132_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the finished stir-fry between 2 dishes. Garnish with the remaining basil and lime wedges and the green tops of the scallions. Enjoy!  "}]}