{"category":"Poultry","link":"chicken-tortas-with-romaine-salad-queso-fresco-cilantro","thumb":"\/\/media.blueapron.com\/recipes\/1340\/c_main_dish_images\/20150826-1621-50-2890\/FP_081815_6_PressedChickenTortas_20-_201079_high_also_thumb.jpg","title":" Pressed Chicken Tortas ","subtitle":" with Romaine Salad, Queso Fresco &amp; Cilantro  ","headbg":"\/\/media.blueapron.com\/recipes\/1340\/c_main_dish_images\/20150826-1620-41-4836\/FP_081815_6_PressedChickenTortas_20-_201078_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  625    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In Mexican cuisine, pressed tortas are meat-and-vegetable sandwiches similar to paninis. Using a press turns the rolls perfectly crispy, while bringing together the flavors in the layers of filling. Here, we&rsquo;re simply using a heavy pot to press our pan-toasted tortas&mdash;filled with spiced chicken, avocado, tomato and queso fresco (a crumbly Mexican cheese). On the side, we&rsquo;re serving a refreshing romaine salad with a bit of a kick to it, thanks to the chile powder and cumin in the sour cream-lime juice dressing. ","ingbg":"\/\/media.blueapron.com\/recipes\/1340\/ingredient_images\/20150922-1527-68-9446\/FP-Pressed-Chicken-Tortas-FP-W_large_feature.png","ingredients":[" 4  Boneless, Skinless Chicken Thighs "," 4  Torta Rolls "," 2  Limes "," 1  Romaine Heart "," 1  Avocado "," 1  Tomato "," 1  Red Onion "," 1  Bunch Cilantro "," 3  Ounces Queso Fresco ","  3  Tablespoons Pepitas   "," ½  Cup Low-Fat Sour Cream ","  2  Teaspoons Chicken Torta Spice Blend (Ancho Chile Powder, Mexican Oregano, Smoked Sweet Paprika, Garlic Powder & Ground Cumin)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5901\/20150828-1852-21-6240\/FP_081815_6_PressedChickenTortas_20-_201067_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Wash and dry the fresh produce. Halve the rolls. Core, halve and thinly slice the tomato. Crumble the queso fresco. Pick the cilantro leaves off the stems; discard the stems. Cut off and discard the root end of the lettuce; roughly chop the leaves. Quarter the limes. Halve, pit, peel and thinly slice the avocado; top with the juice of 2 lime wedges to prevent browning. Peel and halve the onion; small dice 1 half and thinly slice the remaining half. In a medium bowl, combine the diced onion and the juice of 4 lime wedges.  "},{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5903\/20150922-1527-97-0915\/FP_081815_6_R_092215_PressedChickenTortas_20-_204222_high_feature.jpg","title":" Cook the chicken:   ","desc":" Pat the chicken dry with paper towels; season on both sides with salt, pepper and (reserving a pinch) as much of the spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned chicken. Cook 4 to 6 minutes per side, or until browned and cooked through. Transfer to a cutting board to cool slightly. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5906\/20150828-1852-33-1500\/FP_081815_6_PressedChickenTortas_20-_201068_high_feature.jpg","title":" Make the dressing:   ","desc":" While the chicken cooks, add the sour cream and remaining spice blend to the diced onion-lime juice mixture. Stir to thoroughly combine; season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5907\/20150828-1852-44-2311\/FP_081815_6_PressedChickenTortas_20-_201070_high_feature.jpg","title":" Assemble the tortas:   ","desc":" When cool enough to handle, thinly slice the cooked chicken. Place the bottoms of the rolls, cut sides up, on a clean, dry work surface. Divide the sliced chicken, avocado, as much of the sliced onion as you&rsquo;d like (you may have extra), the tomato, half the queso fresco and the cilantro between the roll bottoms; season with salt and pepper. Top with the juice of the remaining lime wedges and the roll tops.  "},{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5908\/20150828-1853-56-1447\/FP_081815_6_PressedChickenTortas_20-_201072_high_feature.jpg","title":" Toast the tortas:   ","desc":" In the pan used to cook the chicken, heat 2 teaspoons of olive oil on medium until hot. Working in 2 batches, add the tortas. Place a heavy pot on top of the tortas to press them down. Cook, occasionally pressing down on the pot, 3 to 4 minutes per side, or until lightly browned and slightly flattened. Transfer to a cutting board or plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1340\/recipe_steps\/5909\/20150828-1853-61-9968\/FP_081815_6_PressedChickenTortas_20-_201073_high_feature.jpg","title":" Make the salad &amp; serve your dish:   ","desc":" While the tortas toast, in a large bowl, combine the lettuce, pepitas, remaining queso fresco and as much of the dressing as you&rsquo;d like (you may have extra dressing). Toss to combine; season with salt and pepper to taste. Cut each toasted torta in half diagonally; divide between 4 plates. Serve with the salad on the side. Enjoy!  "}]}