{"category":"Shellfish","link":"chinese-5-spice-shrimp-with-pineapple-bok-choy-coconut-rice","thumb":"\/\/media.blueapron.com\/recipes\/615\/c_main_dish_images\/20150129-2256-27956-5117\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6928_high_also_thumb.jpg","title":" Chinese Five-Spice Shrimp ","subtitle":" with Pineapple, Bok Choy &amp; Coconut Rice ","headbg":"\/\/media.blueapron.com\/recipes\/615\/c_main_dish_images\/20150129-2255-27949-6330\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6927_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  600    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" This balanced dish is bursting with complexity, thanks in no small part to the Chinese five-spice powder that you&rsquo;ll use to marinate the shrimp. Five-spice powder is a traditional blend typically containing cloves, Chinese cinnamon, Sichuan pepper, star anise and fennel seeds. That means it&rsquo;s part sweet, part heat and inlaid with notes of licorice. We&rsquo;re pairing the spiced shrimp with an equally vibrant, tropical rice for a meal that&rsquo;s truly unforgettable. ","ingbg":"\/\/media.blueapron.com\/recipes\/615\/ingredient_images\/20150129-2257-12-0559\/pineapple-shrimp-FP-w_large_feature.png","ingredients":[" 1  Pound Shrimp "," 2  Cups Jasmine Rice "," 1  13.5-Ounce Can Coconut Milk "," 6  Ounces Cubed Pineapple "," 3  Scallions "," 1  Lime "," ¾  Pound Baby Bok Choy ","  1  Large Bunch Cilantro   ","  1  2-Inch Piece Ginger   "," 1  Tablespoon Five-Spice Shrimp Spice Blend (Chinese Five-Spice Powder, Black Sesame Seeds & White Sesame Seeds) "," ½  Cup Coconut Flakes "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3806\/20150129-2257-16-1416\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6913_high_feature.jpg","title":" Make the coconut rice:  ","desc":" In a medium pot, heat the rice, coconut milk (shaking the can before opening), a big pinch of salt and &frac34; cup of water to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 11 to 14 minutes, or until the water is absorbed and the rice is tender. Remove from heat and let rest for 5 minutes. Fluff the finished rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3807\/20150129-2257-12-7423\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6910_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Quarter the lime. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions on an angle; slice the green tops into &frac12;-inch pieces on an angle. Remove and discard the root end of the bok choy; roughly chop the leaves and stems. Pick the cilantro leaves off the stems; discard the stems. Peel and mince the ginger. Toss the shrimp with the spice blend; season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3808\/20150129-2257-19-7953\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6911_high_feature.jpg","title":" Toast the coconut flakes:  ","desc":" Heat a large, dry pan (nonstick, if you have one) on medium until hot. Add the coconut flakes and toast, stirring occasionally, 2 to 4 minutes, or until golden brown and fragrant. Transfer to a bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3809\/20150129-2257-16-7536\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6912_high_feature.jpg","title":" Cook the vegetables &amp; pineapple:  ","desc":" In the same pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the white bottoms of the scallions and ginger; season with salt and pepper. Cook, stirring frequently, 30 to 45 seconds, or until fragrant. Add the bok choy and pineapple; cook, stirring occasionally, 1 to 2 minutes, or until the bok choy is slightly wilted.  "},{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3810\/20150129-2257-19-8529\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6914_high_feature.jpg","title":" Add the shrimp:  ","desc":" Add the seasoned shrimp and &frac14; cup of water to the pan of vegetables and pineapple; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the shrimp are opaque and cooked through and the water has evaporated. Remove the pan from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/615\/recipe_steps\/3811\/20150129-2257-12-2607\/FP_121714_5_20Pineapple_20Shrimp_20Coconut_20Rice-6916_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Off the heat, stir the juice of all 4 lime wedges into the pan of shrimp; season with salt and pepper to taste. Transfer to a serving dish. Garnish the finished shrimp with the cilantro. Garnish both the finished shrimp and the coconut rice with the green tops of the scallions and toasted coconut flakes. Enjoy!  "}]}