{"category":"Shellfish","link":"cioppino-pasta-bay-scallops-bread-garlic-aioli","thumb":"\/\/media.blueapron.com\/recipes\/317\/c_main_dish_images\/20141211-2349-4660-9029\/cioppini_20pasta_20with_20scallops-6594_high_also_thumb.jpg","title":" Cioppino Tagliatelle ","subtitle":" with Bay Scallops, Toasted Baguette &amp; Garlic Aioli ","headbg":"\/\/media.blueapron.com\/recipes\/317\/c_main_dish_images\/20141211-2348-4653-8159\/CioppinoPasta_BlueApron_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  695    Per Serving ","time":"Cioppino is a classic seafood dish that originated in San Francisco. In the 19th Century, the city&rsquo;s North Beach neighborhood was settled by immigrants from Genoa, an Italian port town famous for its fresh fish. Originally, cioppino was made from the catch of the day by fishermen, who often cooked it right on their boats. As Italian food became more popular in the area, cioppino became a staple. Our version features bay scallops and traditional seasonings, retaining the simple, delicious flavors of the original.","desc":" Cioppino is a classic seafood dish that originated in San Francisco. In the 19th Century, the city&rsquo;s North Beach neighborhood was settled by immigrants from Genoa, an Italian port town famous for its fresh fish. Originally, cioppino was made from the catch of the day by fishermen, who often cooked it right on their boats. As Italian food became more popular in the area, cioppino became a staple. Our version features bay scallops and traditional seasonings, retaining the simple, delicious flavors of the original. ","ingbg":"\/\/media.blueapron.com\/recipes\/317\/ingredient_images\/20141216-2056-7653-0843\/cioppini-pasta-scallops-W_large_feature.png","ingredients":[" 8  Ounces Bay Scallops "," 8  Ounces Egg Tagliatelle "," 1  Mini Baguette "," 1  15-Ounce Can Diced Tomatoes "," 3  Cloves Garlic ","  1  Fennel Bulb With Fronds   "," 1  Lemon "," 1  Yellow Onion "," 1  Bunch Parsley ","  1  Tablespoon Tomato Paste   "," 1  Teaspoon Sweet Paprika "," ⅛  Teaspoon Red Pepper Flakes "," ¼  Cup Mayonnaise "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1821\/20140723-1953-4230-0231\/Step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Heat a medium pot of salted water to boiling on high. Wash and dry the produce. Mince the garlic. Pick the parsley off the stems; roughly chop. Pick off and reserve the fennel fronds. Separate the fennel bulb and stems; discard the stems. Small dice the bulb. Using a peeler, remove the lemon rind, avoiding the pith; mince to get 3 teaspoons of zest. Cut the lemon into 6 wedges; remove the seeds. Peel and small dice the onion.  "},{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1822\/20140723-1953-4092-9153\/Step2_high_feature.jpg","title":" Sear the scallops:  ","desc":" Pat the scallops dry with paper towels. Season with salt and pepper on all sides. In a large pan, heat 2 teaspoons of oil on high until hot. Add the scallops and cook, stirring frequently, 45 seconds to 1 minute, or until browned. (You&rsquo;ll finish cooking them in the sauce.) Transfer to a plate, leaving any browned bits in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1823\/20140723-1953-2712-6499\/Step_3_high_feature.jpg","title":" Make the sauce:  ","desc":" Add 2 teaspoons of olive oil to the pan of browned bits. Heat on medium until hot. Add the onion, fennel bulb and all but a pinch of the garlic; season with salt and pepper. Cook 2 to 3 minutes, or until softened. Stir in the tomato paste; cook, stirring frequently, 30 seconds to 1 minute, or until dark red in color. Add the diced tomatoes, lemon zest, half the parsley, half the fennel fronds, as much of the red pepper flakes as you&rsquo;d like and &frac12; cup of water. Season with salt and pepper. Cook, stirring occasionally, 10 to 12 minutes, or until slightly reduced in volume.  "},{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1824\/20140723-1954-4236-3726\/Step4_high_feature.jpg","title":" Cook the pasta:  ","desc":" While the sauce reduces, add the pasta to the pot of boiling water. Cook 2 to 3 minutes, or until just shy of al dente. Reserve 1 cup of the pasta cooking water; drain the pasta thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1825\/20140723-1954-2718-4994\/Step_5_high_feature.jpg","title":" Add the pasta &amp; scallops to the sauce:  ","desc":" Add the drained pasta and seared scallops to the pan of sauce. Gradually stir in the reserved pasta water until well combined. Cook 2 to 3 minutes, or until heated through and slightly thickened. Remove from heat and stir in the juice of 2 lemon wedges. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/317\/recipe_steps\/1826\/20140723-1954-4098-8266\/Step6_high_feature.jpg","title":" Make the aioli &amp; toast the baguette:  ","desc":" While the pasta and sauce cook, in a small bowl, combine the mayonnaise, remaining garlic, paprika and the juice of 2 lemon wedges; season with salt and pepper to taste. Halve the baguette horizontally, then quarter it crosswise; place on a sheet pan and drizzle with olive oil. Toast in the oven 2 to 4 minutes, or until golden brown. Divide the pasta and sauce between 2 bowls. Garnish with the remaining parsley, fennel fronds and lemon wedges. Spread the aioli onto the toasted baguette and serve on the side. Enjoy!  "}]}