{"category":"Fish","link":"cod-with-pickled-grapes-summer-succotash","thumb":"\/\/media.blueapron.com\/recipes\/232\/c_main_dish_images\/20150908-1512-54-6461\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0461_high_also_thumb.jpg","title":" Pan-Seared Cod ","subtitle":" with Pickled Grapes &amp; Summer Succotash ","headbg":"\/\/media.blueapron.com\/recipes\/232\/c_main_dish_images\/20150908-1511-45-2078\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0460_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Succotash is a Native American dish from the Northeastern United States. A combination of sweet corn, hearty summer beans and tomato, it&rsquo;s prized for its simple, delicious flavors. In our version, we&rsquo;re topping the succotash with flaky, pan-seared cod fillets and a uniquely tasty delicacy: pickled grapes. Tart and sweet in equal measure, the pickled grapes make an incredibly delicious topping for the mild, tender cod. And we&rsquo;re garnishing the dish with piquant chives to complete the flavor profile. ","ingbg":"\/\/media.blueapron.com\/recipes\/232\/ingredient_images\/20150908-1524-56-0348\/cod-succotash-W_large_feature.png","ingredients":[" 2  Cod Fillets "," 2  Cloves Garlic "," 1  Bunch Chives "," 1  Ear Of Corn "," 1  Tomato "," 1  Shallot "," 3  Ounces Green Beans "," 2  Ounces Red Seedless Grapes "," 2  Tablespoons White Wine Vinegar "," 1  Tablespoon Sugar "," ⅓  Cup Rice Flour "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/232\/recipe_steps\/2898\/20150908-1543-74-5641\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0452_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Pick the grapes off the stems; discard the stems and thinly slice the grapes. Peel and mince the garlic. Peel and thinly slice the shallot. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Trim off and discard the stem ends of the green beans; cut the green beans into &frac12;-inch pieces. Core and large dice the tomato. Cut the chives into &frac14;-inch pieces.  "},{"img":"\/\/media.blueapron.com\/recipes\/232\/recipe_steps\/2899\/20150908-1544-88-1723\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0453_high_feature.jpg","title":" Pickle the grapes:  ","desc":" In a small bowl, combine the vinegar, sugar and a big pinch of salt. Stir until thoroughly combined and the sugar has dissolved. Add the sliced grapes. Set aside to pickle, stirring occasionally, for at least 10 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/232\/recipe_steps\/2900\/20150908-1544-93-3857\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0454_high_feature.jpg","title":" Make the succotash:  ","desc":" While the grapes pickle, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the shallot and garlic; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Stir in the corn and green beans; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the green beans are bright green. Add the tomato; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until slightly softened. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/232\/recipe_steps\/2901\/20150908-1544-98-0207\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0455_high_feature.jpg","title":" Coat &amp; cook the cod:  ","desc":" While the grapes continue to pickle, place the rice flour on a plate. Pat the cod dry with paper towels; season with salt and pepper on both sides. Thoroughly coat in the rice flour (tapping off any excess). In the pan used to make the succotash, heat 2 teaspoons of olive oil on medium-high until hot. Add the coated cod and cook 3 to 4 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/232\/recipe_steps\/2902\/20150908-1544-103-1619\/R_090415_1_20Cod_20with_20Pickled_20Grapes-0456_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Divide the succotash and cooked cod between 2 plates. Spoon half the pickled grapes and as much of the pickling liquid as you&rsquo;d like over each cod fillet. Garnish with the chives. Enjoy!  "}]}