{"category":"Pork","link":"congee-caramelized-pork-with-crispy-shallots-and-black-garlic","thumb":"\/\/media.blueapron.com\/recipes\/481\/c_main_dish_images\/20141015-2120-16194-5137\/Soy_20Caramelized_20Pork-3734_high_also_thumb.jpg","title":" Congee &amp; Caramelized Pork  ","subtitle":" with Crispy Shallots and Black Garlic ","headbg":"\/\/media.blueapron.com\/recipes\/481\/c_main_dish_images\/20141015-2119-16188-6985\/Soy_20Caramelized_20Pork-3733_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"We&rsquo;re delighted to bring you the winning dish from Top Chef&rsquo;s Season 12 premiere in Boston! This recipe was created by contestant Mei Lin, currently sous chef at West Hollywood&rsquo;s ink. restaurant. Here, you&rsquo;ll be making congee (a traditional rice porridge) with soy-caramelized pork. It&rsquo;s a masterful balance of rich, tangy and sweet flavors!\r\n \r\n Don&rsquo;t miss Top Chef, Wednesdays at 10\/9c, only on Bravo.","desc":" We&rsquo;re delighted to bring you the winning dish from Top Chef&rsquo;s Season 12 premiere in Boston! This recipe was created by contestant Mei Lin, currently sous chef at West Hollywood&rsquo;s ink. restaurant. Here, you&rsquo;ll be making congee (a traditional rice porridge) with soy-caramelized pork. It&rsquo;s a masterful balance of rich, tangy and sweet flavors!\r\n \r\n Don&rsquo;t miss Top Chef, Wednesdays at 10\/9c, only on Bravo. ","ingbg":"\/\/media.blueapron.com\/recipes\/481\/ingredient_images\/20141020-1410-32709-1152\/top-chef-soy-pork-ing-W2_large_feature.png","ingredients":[" 10  Ounces Ground Pork "," ½  Cup Sushi Rice "," 2  Scallions "," 1  Bunch Cilantro ","  2  Cloves Black Garlic   "," 2  Tablespoons Soy Sauce ","  2  Teaspoons Chinese Black Vinegar   "," 2  Teaspoons Congee Spice Blend (Ground Galangal, Garlic Powder, Ground Ginger, Ground Lemongrass, Cayenne Pepper) "," 1  Shallot ","  ¼  Cup Coconut Palm Sugar   "," ¼  Cup All-Purpose Flour "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3170\/20141020-1410-32715-2981\/Soy-Caramelized-Pork-mise-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel the black garlic cloves. In a small bowl, using a fork, mash the black garlic cloves into a paste; add 1 tablespoon of water and stir to combine. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Pick the cilantro off the stems; discard the stems. Peel and thinly slice the shallot into rings; separate the rings and place in a bowl of cold water.  "},{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3171\/20141015-2122-331-4420\/Soy_20Caramelized_20Pork-3693_high_feature.jpg","title":" Make the congee:  ","desc":" In a large pot, heat 2 teaspoons of oil on medium-high until hot. Add half the white parts of the scallions and half the spice blend. Cook, stirring frequently, 30 seconds to 1 minute, or until fragrant. Add the rice; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until the rice is toasted and starts to crackle. Add 6 cups of water; cook, stirring occasionally, 23 to 26 minutes, or until the rice is tender and creamy. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3172\/20141015-2122-16236-3140\/Soy_20Caramelized_20Pork-3686_high_feature.jpg","title":" Start the pork:  ","desc":" After the rice has cooked for about 5 minutes, in a large pan (nonstick, if you have one), heat 2 teaspoons of oil on medium-high until hot. Add the ground pork and cook, frequently breaking the meat apart with a spoon, 1 to 3 minutes, or until browned. Add half the soy sauce and the remaining white parts of the scallions and the remaining spice blend. Cook, stirring occasionally, 2 to 4 minutes, or until the meat is cooked through. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3173\/20141015-2122-181-6078\/Soy_20Caramelized_20Pork-3688_high_feature.jpg","title":" Make the caramel &amp; finish the pork:  ","desc":" Place the coconut palm sugar in the same pan used to cook the pork. Heat on medium-high, without stirring, 2 to 3 minutes, or until melted and dark amber in color. Turn off the heat and add the black vinegar, mashed black garlic mixture and remaining soy sauce. Stir until well combined. Add the cooked pork (along with any juices on the plate) and &frac14; cup of water. Cook on medium-high, stirring occasionally, 1 to 2 minutes, or until well combined and heated through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3174\/20141015-2123-16242-4926\/Soy_20Caramelized_20Pork-3721_high_feature.jpg","title":" Cook the shallots:  ","desc":" Drain the shallot rings. Place the flour in a small bowl. Add the drained shallot rings to the bowl of flour and toss to thoroughly coat. In a small pan, heat a thin layer of oil on medium until hot. Tap any excess flour off the shallots. Add them to the pan in a single layer. (If necessary, work in batches to avoid overcrowding.) Cook 30 seconds to 1 minute, or until golden brown. Transfer to a paper towel-lined plate and immediately season with salt.  "},{"img":"\/\/media.blueapron.com\/recipes\/481\/recipe_steps\/3175\/20141015-2123-391-2519\/Soy_20Caramelized_20Pork-3722_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the congee and caramelized pork between 2 dishes. Top with the crispy shallots and green parts of the scallions. Garnish with the cilantro. Enjoy!  "}]}