{"category":"Fish","link":"cornmeal-crusted-catfish-with-cucumber-tomato-salad-remoulade-sauce","thumb":"\/\/media.blueapron.com\/recipes\/1226\/c_main_dish_images\/20150604-2231-321-0357\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206342_20Center_high_also_thumb.jpg","title":" Cornmeal-Crusted Catfish ","subtitle":" with Tomato-Cucumber Salad &amp; Creamy Potatoes ","headbg":"\/\/media.blueapron.com\/recipes\/1226\/c_main_dish_images\/20150604-2231-306-0789\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206341_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the South, fried catfish is at once a comfort food and a delicacy. The dish can be prepared simply, but it has the potential for gourmet variations. Here, we&rsquo;re coating our catfish in peppery mustard and naturally sweet cornmeal, then lightly pan-frying the fillets&mdash;resulting in a perfectly crunchy, flavorful crust. And for dipping, we&rsquo;re making a classic, creamy remoulade, a French sauce that has become a standard accompaniment for seafood in Southern cooking. ","ingbg":"\/\/media.blueapron.com\/recipes\/1226\/ingredient_images\/20150605-2213-165-4020\/Cornmeal-Crusted-Catfish-2P-W_large_feature.png","ingredients":[" 2  Catfish Fillets "," ½  Cup Cornmeal "," 5  Ounces Cherry Tomatoes "," 1  Cucumber "," 1  Red Onion ","  ½  Pound Fingerling Potatoes   "," 1  Large Bunch Parsley "," 2  Tablespoons Red Wine Vinegar "," ¼  Cup Dijon Mustard "," ¼  Cup Mayonnaise "," ¼  Cup Sweet Pickle Relish "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5060\/20150604-2232-353-7591\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206316_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Halve the tomatoes. Halve the cucumber lengthwise; using a spoon, scoop out and discard the seeds. Thinly slice the cucumber. Slice the potatoes into &frac14;-inch-thick rounds. Pick the parsley leaves off the stems; discard the stems and finely chop the leaves. Peel, halve and thinly slice the onion; place in a medium bowl with the vinegar.  "},{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5061\/20150604-2233-364-6084\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206318_high_feature.jpg","title":" Cook the potatoes:  ","desc":" Add the potatoes to the pot of boiling water. Cook 10 to 12 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5062\/20150604-2233-375-2653\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206320_high_feature.jpg","title":" Coat the catfish:  ","desc":" While the potatoes cook, in a large bowl, combine half the mustard and 3 tablespoons of water; season with salt and pepper. Place the cornmeal on a plate. Pat the catfish fillets dry with paper towels; season with salt and pepper on both sides. Working 1 at a time, thoroughly coat the seasoned fillets in the cornmeal (shaking off any excess), then dip in the mustard mixture (letting the excess drip off), then coat again in the cornmeal (shaking off any excess). Place the coated fillets on a plate or sheet pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5063\/20150604-2233-396-7027\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206325_high_feature.jpg","title":" Cook the catfish:  ","desc":" While the potatoes continue to cook, in a medium pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Add the coated catfish fillets. Cook 2 to 4 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5064\/20150604-2233-407-3381\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206322_high_feature.jpg","title":" Make the tomato-cucumber salad:  ","desc":" While the catfish cooks, in a large bowl, combine the tomatoes, cucumber, onion-vinegar mixture and half the parsley. Drizzle with olive oil and toss to coat; season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/1226\/recipe_steps\/5065\/20150604-2234-418-9454\/2P_052815_5_20Cornmeal_20Crusted_20Catfish_20-_206324_high_feature.jpg","title":" Make the potato salad &amp; plate your dish:  ","desc":" To make the remoulade sauce, in a medium bowl, combine the mayonnaise, relish, remaining mustard and all but a pinch of the remaining parsley; season with salt and pepper to taste. Add half the remoulade sauce to the pot of cooked potatoes. Stir to combine; season with salt and pepper to taste. Divide the cooked catfish fillets, tomato-cucumber salad and creamy potatoes between 2 dishes. Garnish with the remaining parsley. Serve with the remaining remoulade sauce on the side. Enjoy!  "}]}