{"category":"Fish","link":"crispy-cod-with-warm-cauliflower-mustard-green-salad","thumb":"\/\/media.blueapron.com\/recipes\/1346\/c_main_dish_images\/20150903-1734-117-8001\/2P_090115_1_CodWithHeirloomCauliflower_20-_200003_high_also_thumb.jpg","title":" Crispy Cod  ","subtitle":" with Warm Cauliflower &amp; Mustard Green Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1346\/c_main_dish_images\/20150903-1733-108-5684\/2P_090115_1_CodWithHeirloomCauliflower_20-_200002_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  580    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" When properly balanced, contrasting flavors produce incredibly delicious results. In this dish, as a side for crispy, pan-seared cod fillets, we&rsquo;re serving up a tasty salad that makes use of a classic, contrasting flavor pairing. Quick-pickled red onion and golden raisins join sweetness and tartness, brightening up everything they touch. To complement the pickles&rsquo; sweetness, we&rsquo;re tossing them with bitter mustard greens, saut&eacute;ed with briny capers, garlic and mildly earthy cauliflower. ","ingbg":"\/\/media.blueapron.com\/recipes\/1346\/ingredient_images\/20151006-1748-40-8648\/F-Cod-Heirloom-Cauliflower-2P-W_large_feature.png","ingredients":[" 2  Cod Fillets "," 3  Cloves Garlic "," ½  Bunch Mustard Greens "," 1  Head Cauliflower "," 1  Red Onion "," 2  Tablespoons Capers "," 2  Tablespoons Golden Raisins "," 2  Tablespoons Red Wine Vinegar ","  2  Tablespoons Rice Flour   "," 2  Tablespoons Sugar "," 2  Tablespoons Sliced Almonds "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5607\/20150903-1901-75-6928\/2P_090115_1_CodWithHeirloomCauliflower_20-_209980_high_feature.jpg","title":" Prepare the ingredients  ","desc":" Wash and dry the fresh produce. Peel and thinly slice the garlic. Remove and discard the stems of the mustard greens; roughly chop the leaves. Cut out and discard the core of the cauliflower; cut the head into small florets. Peel and medium dice the onion.  "},{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5608\/20150903-1901-85-9813\/2P_090115_1_CodWithHeirloomCauliflower_20-_209981_high_feature.jpg","title":" Toast the almonds  ","desc":" Heat a large, dry pan (nonstick, if you have one) on medium until hot. Add the almonds and toast, stirring frequently, 2 to 3 minutes, or until lightly browned and fragrant. Transfer to a large bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5609\/20150903-1901-90-3473\/2P_090115_1_CodWithHeirloomCauliflower_20-_209982_high_feature.jpg","title":" Pickle the onion &amp; raisins  ","desc":" In the pan used to toast the almonds, combine the onion, raisins, sugar, vinegar, a big pinch of salt and &frac14; cup of water. Heat to boiling on medium-high. Once boiling, cook, stirring occasionally, 2 to 3 minutes, or until the onion has softened and the liquid is slightly reduced in volume. Transfer the mixture to a heatproof bowl and set aside to pickle for at least 10 minutes. Carefully rinse and wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5610\/20150903-1901-95-3698\/2P_090115_1_CodWithHeirloomCauliflower_20-_209984_high_feature.jpg","title":" Cook the vegetables  ","desc":" In the pan used to pickle the onion and raisins, heat 2 teaspoons of olive oil on medium-high until hot. Add the cauliflower; season with salt and pepper. Cook, stirring occasionally, 8 to 10 minutes, or until lightly browned. Add the garlic, capers and mustard greens; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the mustard greens have wilted. Transfer to the bowl of toasted almonds. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5611\/20150903-1901-100-3352\/2P_090115_1_CodWithHeirloomCauliflower_20-_209985_high_feature.jpg","title":" Coat &amp; cook the cod  ","desc":" Place the rice flour on a plate. Pat the cod fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the rice flour (tapping off any excess). In the pan used to cook the vegetables, heat 2 teaspoons of olive oil on medium-high until hot. Add the fillets, coated sides down. Cook 3 to 5 minutes per side, or until golden brown. Flip and cook 2 to 3 minutes, or until cooked through. Remove from heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/1346\/recipe_steps\/5612\/20150903-1902-105-2357\/2P_090115_1_CodWithHeirloomCauliflower_20-_209987_high_feature.jpg","title":" Make the salad &amp; plate your dish  ","desc":" To the bowl of cooked vegetables and toasted almonds, add the pickled onion and raisins and as much of the pickling liquid as you&rsquo;d like (you may have extra); toss to thoroughly combine and season with salt and pepper to taste. Divide the salad and cooked cod fillets between 2 plates. Finish with a drizzle of olive oil, if desired. Enjoy!  "}]}