{"category":"Vegetarian","link":"crispy-ricotta-pierogi-with-warm-apple-cabbage-salad-browned-butter","thumb":"\/\/media.blueapron.com\/recipes\/1353\/c_main_dish_images\/20150903-1735-140-6050\/2P_090115_5_PierogiesWithWarmCabbage_20-_200109_high_also_thumb.jpg","title":" Crispy Ricotta Pierogi ","subtitle":" with Warm Apple-Cabbage Salad &amp; Browned Butter ","headbg":"\/\/media.blueapron.com\/recipes\/1353\/c_main_dish_images\/20150903-1736-149-8676\/2P_090115_5_PierogiesWithWarmCabbage_20-_200108_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" With this dish, we&rsquo;re welcoming in the season by preparing one of our favorite comfort foods&mdash;pierogi. The national dish of Poland, these stuffed dumplings have been enjoyed since the 13th Century. To save time without sacrificing flavor, we&rsquo;re using pre-made dumpling wrappers and crimping the dough around a delicious filling of ricotta cheese and classic spices. Smothered in nutty browned butter and served with a warm salad of sweet apple, aromatic fennel and hearty cabbage, these crispy pierogi make for the perfect early-autumn dinner. ","ingbg":"\/\/media.blueapron.com\/recipes\/1353\/ingredient_images\/20151006-1750-14-3831\/V3-Pierogies-Warm-Cabbage-WEDGE-2P-W_large_feature.png","ingredients":[" 12  Dumpling Wrappers "," 1  Cup Part-Skim Ricotta Cheese "," 1  Apple "," 1  Baby Fennel Bulb "," ¾  Pound Cabbage ","  2  Tablespoons Butter   ","  2  Tablespoons Champagne Vinegar   "," ⅓  Cup Sour Cream "," 2  Teaspoons Pierogi Spice Blend (Poppy Seeds, White Granulated Sugar, Ground Nutmeg & Whole Dried Caraway Seeds) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5693\/20150903-1902-114-1119\/2P_090115_5_PierogiesWithWarmCabbage_20-_200099_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Wash and dry the fresh produce. Remove the dumpling wrappers from their package and stack on a plate; cover with a damp paper towel. Pick off and reserve some of the fennel fronds (the green, thread-like tops of the plant); cut off and discard the fennel stems. Trim off and discard the root end of the fennel bulb; thinly slice. Core the cabbage and thinly slice. Core the apple and cut into matchsticks; place in a bowl and toss with the vinegar.  "},{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5694\/20150903-1902-123-4002\/2P_090115_5_PierogiesWithWarmCabbage_20-_200102_high_feature.jpg","title":" Form the pierogi:  ","desc":" To make the filling, in a medium bowl, combine the cheese and half the spice blend; season with salt and pepper to taste. Fill a small bowl with lukewarm water. Lay the dumpling wrappers on a clean, dry work surface. Spoon about 1 tablespoon of the filling into the center of each dumpling wrapper. Using your fingers, lightly moisten the edges of the wrappers with water; carefully fold the wrappers in half over the filling. Using a fork, press down on the edges down to crimp and seal the pierogi. Transfer to a plate and cover with a damp paper towel.  "},{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5695\/20150903-1902-128-5381\/2P_090115_5_PierogiesWithWarmCabbage_20-_200103_high_feature.jpg","title":" Start the vegetables:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the fennel and cabbage; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until slightly softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5696\/20150903-1902-133-5329\/2P_090115_5_PierogiesWithWarmCabbage_20-_200104_high_feature.jpg","title":" Finish the vegetables:  ","desc":" Add the apple, remaining spice blend and 2 tablespoons of water to the pan of vegetables; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until the cabbage has wilted; season with salt and pepper to taste. Transfer to a large bowl and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5697\/20150903-1903-138-1953\/2P_090115_5_PierogiesWithWarmCabbage_20-_200105_high_feature.jpg","title":" Cook the pierogi &amp; brown the butter:  ","desc":" In the pan used to cook the vegetables, heat a thin layer of oil on medium-high until hot. Add the pierogi in a single, even layer. Cook 1 to 3 minutes on the first side, or until lightly browned. Flip and add the butter. Cook, occasionally spooning the butter over the pierogi, 1 to 3 minutes, or until the pierogi are golden brown and crispy and the butter is dark brown and fragrant. Remove from heat, reserving the browned butter in the pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/1353\/recipe_steps\/5698\/20150903-1903-143-6421\/2P_090115_5_PierogiesWithWarmCabbage_20-_200106_high_feature.jpg","title":" Plate your dish:   ","desc":" Divide the pierogi between 2 plates. Top with the finished vegetables and a few spoonfuls of the browned butter from the pan. Garnish with the fennel fronds. Season the sour cream with salt and pepper to taste and serve on the side for dipping. Enjoy!  "}]}