{"category":"Fish","link":"crispy-catfish-with-corn-heirloom-tomato-freekeh-salad","thumb":"\/\/media.blueapron.com\/recipes\/1300\/c_main_dish_images\/20150728-1516-161-0385\/2P_072115_3_CrispyCatfishwithCorn_20-_209757_high_also_thumb.jpg","title":" Crispy Catfish &amp; Freekeh ","subtitle":" with Corn-Cherry Tomato Sauté &amp; Marjoram ","headbg":"\/\/media.blueapron.com\/recipes\/1300\/c_main_dish_images\/20150728-1529-421-3841\/2P_072115_3_CrispyCatfishwithCorn_20-_209756_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" As a side for crispy catfish, we&rsquo;re saut&eacute;ing two of our favorite summer vegetables. Both at the peak of ripeness late in the season, corn and cherry tomatoes are a natural and delicious pairing. Here, we&rsquo;re only cooking them briefly, to maintain the corn&rsquo;s tender, crunchy sweetness and to slightly soften the cherry tomatoes, preserving their juiciness and slightly tart acidity. The result is a gorgeous, balanced side that perfectly complements the flaky catfish and nutty freekeh. And we&rsquo;re garnishing the dish with marjoram, a savory herb popular in the Mediterranean. ","ingbg":"\/\/media.blueapron.com\/recipes\/1300\/ingredient_images\/20150825-1813-86-5891\/F-crispy-catfish-corn-freekeh-2P-W-MARJORAM_large_feature.png","ingredients":[" 2  Catfish Fillets ","  ½  Cup Cracked Freekeh   "," 4  Ounces Multicolored Cherry Tomatoes "," 2  Cloves Garlic ","  1  Ear Of Corn   "," 1  Bunch Marjoram "," 1  Large Bunch Parsley "," 2  Tablespoons All-Purpose Flour "," 1  Tablespoon White Wine Vinegar "," 1  Shallot "," 1  Tablespoon Butter "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5478\/20150728-1620-225-0127\/2P_072115_3_CrispyCatfishwithCorn_20-_209745_high_feature.jpg","title":" Cook the freekeh:  ","desc":" Heat a medium pot of salted water to boiling on high. Once boiling, add the freekeh. Cook 22 to 24 minutes, or until tender. Turn off the heat. Drain thoroughly and return to the pot. Stir in the butter until thoroughly combined; season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5479\/20150728-1621-236-6287\/2P_072115_3_CrispyCatfishwithCorn_20-_209742_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the freekeh cooks, wash and dry the fresh produce. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Halve the tomatoes. Peel and mince the garlic. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the vinegar. Finely chop the parsley leaves and stems. Pick the marjoram leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5480\/20150728-1621-247-7176\/2P_072115_3_CrispyCatfishwithCorn_20-_209743_high_feature.jpg","title":" Cook the corn &amp; tomatoes:  ","desc":" While the freekeh continues to cook, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the corn; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until lightly browned. Add the garlic and tomatoes; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Transfer to a bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5481\/20150728-1621-258-7696\/2P_072115_3_CrispyCatfishwithCorn_20-_209744_high_feature.jpg","title":" Coat &amp; cook the catfish:  ","desc":" While the freekeh finishes cooking, place the flour on a large plate. Pat the catfish fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the flour (shaking off any excess). In the pan used to cook the corn and tomatoes, heat a thin layer of oil on medium-high until hot. Add the fillets, coated sides down. Cook 2 to 3 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5482\/20150728-1621-277-8850\/2P_072115_3_CrispyCatfishwithCorn_20-_209746_high_feature.jpg","title":" Finish the freekeh:  ","desc":" To the pot of cooked freekeh, add the shallot-vinegar mixture and parsley; stir to thoroughly combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1300\/recipe_steps\/5483\/20150728-1621-288-0657\/2P_072115_3_CrispyCatfishwithCorn_20-_209747_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the finished freekeh between 2 plates. Top with the cooked catfish and cooked corn and tomatoes. Garnish with the marjoram. Enjoy!  "}]}