{"category":"Fish","link":"crispy-fish-sandwiches-with-tartar-sauce-iceberg-salad","thumb":"\/\/media.blueapron.com\/recipes\/1315\/c_main_dish_images\/20150806-1709-163-5593\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0264-centered_high_also_thumb.jpg","title":" Crispy Cod Sandwiches ","subtitle":" with Tartar Sauce &amp; Iceberg Wedge Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1315\/c_main_dish_images\/20150806-1709-186-6771\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0264-print_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  525    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the mid-20th Century, America fell in love with a salad that was both elegant and incredibly easy to prepare: the wedge. It features large wedges of iceberg lettuce, whose broad, sturdy, deliciously crisp leaves create a perfect base for varied toppings. We&rsquo;re using juicy cherry tomatoes, oniony chives and a drizzle of peppery vinaigrette. It&rsquo;s the ultimate refreshing side for sandwiches of panko-breaded, pan-fried cod and creamy tartar sauce (a mayo-based condiment traditionally served with fish). ","ingbg":"\/\/media.blueapron.com\/recipes\/1315\/ingredient_images\/20150826-1611-72-2264\/FF-fish-sandwich-iceburg-lettuce-F-W_large_feature.png","ingredients":[" 4  Cod Fillets "," 4  Potato Buns ","  1  Cup Panko Breadcrumbs   "," 4  Ounces Cherry Tomatoes "," 1  Head Iceberg Lettuce "," 1  Large Bunch Chives ","  2  Tablespoons Champagne Vinegar   ","  2  Tablespoons Capers   "," 1  Shallot "," ⅓  Cup Mayonnaise "," ¼  Cup Dijon Mustard "," 2  Tablespoons Crispy Cod Sandwich Spice Blend (All-Purpose Flour, Italian Seasoning, Garlic Powder & Smoked Sweet Paprika) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5588\/20150807-1500-146-5016\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0235_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Halve the buns. Roughly chop the capers. Cut the chives into &frac14;-inch pieces. Remove and discard the outer layer of the lettuce head. Quarter the lettuce head, keeping each wedge intact; remove and discard the core. Separate 4 large leaves from the wedges. Quarter the tomatoes. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the vinegar.  "},{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5589\/20150807-1502-16-1335\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0238_high_feature.jpg","title":" Bread the cod:  ","desc":" In a medium bowl, combine half the mustard and 2 tablespoons of water; season with salt and pepper to taste. Place the spice blend and breadcrumbs in 2 separate medium bowls; season each with salt and pepper. Pat the cod fillets dry with paper towels; season with salt and pepper on both sides. Working 1 at a time, thoroughly coat the seasoned fillets in the spice blend (shaking off any excess), then dip in the mustard-water mixture (letting the excess drip off), then coat in the breadcrumbs (pressing to adhere). Place the breaded fillets on a plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5590\/20150807-1502-33-8535\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0245_high_feature.jpg","title":" Cook the cod:  ","desc":" In a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Add the breaded cod fillets. Cook 3 to 4 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate; immediately season with salt and pepper. Carefully discard the oil and wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5591\/20150807-1508-126-3790\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0239_high_feature.jpg","title":" Make the tartar sauce:  ","desc":" While the cod cooks, in a bowl, combine the capers, mayonnaise, half the chives, half the shallot-vinegar mixture and half the remaining mustard. Stir to thoroughly combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5592\/20150807-1508-115-1651\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0243_high_feature.jpg","title":" Make the vinaigrette &amp; salad:  ","desc":" While the cod continues to cook, stir the remaining mustard into the remaining shallot-vinegar mixture; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Place the lettuce wedges on a serving dish, cut sides up; season with salt and pepper. Top with the tomatoes and remaining chives. Drizzle with as much of the vinaigrette as you&rsquo;d like (you may have extra); season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1315\/recipe_steps\/5593\/20150807-1508-104-5352\/FP_072915_2_Crispy_Fish_Sandwiches_with_Iceberg_Salad-0246_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" In the pan used to cook the cod, heat 2 teaspoons of olive oil on medium-high until hot. Add the buns, cut sides down. Toast 1 to 2 minutes, or until golden brown. Transfer to a clean, dry work surface. Place a lettuce leaf and a cooked cod fillet on each toasted bun bottom. Top with a spoonful of the tartar sauce and a toasted bun top. Transfer to a serving dish. Serve with the salad and remaining tartar sauce on the side. Enjoy!  "}]}