{"category":"Fish","link":"crispy-cajun-catfish-with-dirty-rice-spicy-remoulade","thumb":"\/\/media.blueapron.com\/recipes\/1335\/c_main_dish_images\/20150824-1510-138-4796\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201017_high_also_thumb.jpg","title":" Crispy Cajun Catfish ","subtitle":" with Dirty Rice &amp; Spicy Remoulade  ","headbg":"\/\/media.blueapron.com\/recipes\/1335\/c_main_dish_images\/20150824-1509-133-8026\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201014_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" This dish, inspired by generations of backyard fish fries in the heart of Cajun Louisiana, is rustic Southern fare at its best. We&rsquo;re pan-frying catfish, a Southern staple, and serving it over &ldquo;dirty rice,&rdquo; or brown rice simmered with traditional Cajun spices, onion, celery and green bell pepper. To spoon over the crispy fillets, we&rsquo;re making zesty, creamy remoulade. Originally a French sauce, remoulade is incredibly popular in the region. For a little extra heat, we&rsquo;re infusing ours with Tabasco. ","ingbg":"\/\/media.blueapron.com\/recipes\/1335\/ingredient_images\/20150922-1434-96-2226\/F-Crispy-Cajun-Catfish-Rice-2P-W_large_feature.png","ingredients":[" 2  Catfish Fillets "," ½  Cup Long Grain Brown Rice "," 2  Stalks Celery "," 1  Green Bell Pepper "," 1  Yellow Onion "," 1  Large Bunch Parsley "," 1  Mini Bottle Tabasco Hot Sauce ","  ¼  Cup Rice Flour   "," ¼  Cup Sweet Pickle Relish "," ¼  Cup Mayonnaise "," 1½  Tablespoons Cajun Spice Blend (Smoked Paprika, Ground Yellow Mustard, Onion Powder, Garlic Powder, Dried Oregano, Dried Thyme & Cayenne Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5782\/20150824-1536-461-1952\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201007_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Small dice the celery. Cut out and discard the stem, ribs and seeds of the bell pepper; small dice. Peel and small dice the onion. Pick the parsley leaves off the stems; discard the stems and thinly slice the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5783\/20150824-1536-466-1639\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201010_high_feature.jpg","title":" Make the dirty rice:  ","desc":" In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the celery, bell pepper, onion and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and fragrant. Add the rice, a big pinch of salt and 1 cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 18 to 20 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5784\/20150824-1536-475-7318\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201009_high_feature.jpg","title":" Make the remoulade:  ","desc":" While the rice cooks, in a small bowl, combine the mayonnaise, sweet pickle relish, half the parsley and as much of the hot sauce as you&rsquo;d like, depending on how spicy you&rsquo;d like the remoulade to be; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5785\/20150824-1537-484-1057\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201008_high_feature.jpg","title":" Coat the catfish:  ","desc":" While the rice continues to cook, combine the rice flour and remaining spice blend on a plate. Pat the catfish fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the rice flour-spice blend mixture (tapping off any excess). Transfer to a separate plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5786\/20150824-1537-489-4671\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201011_high_feature.jpg","title":" Cook the catfish:  ","desc":" While the rice continues to cook, in a medium pan (nonstick, if you have), heat 2 teaspoons of olive oil on medium-high until hot. Add the coated catfish fillets, coated sides down, and cook 3 to 4 minutes on the first side, or until browned and crispy. Flip and cook 1 to 2 minutes, or until golden brown and cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1335\/recipe_steps\/5787\/20150824-1537-494-3935\/2P_081815_2_CrispyCajunCatfishwithCajunRice_20-_201012_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the dirty rice between 2 plates. Top with the cooked catfish fillets. Garnish with the remaining parsley. Serve with the remoulade on the side. Enjoy!  "}]}