{"category":"Vegetarian","link":"delicata-squash-red-curry-with-black-rice-thai-basil","thumb":"\/\/media.blueapron.com\/recipes\/1376\/c_main_dish_images\/20150921-1718-253-0089\/2P_091615_3_DelicataSquashRedCurry_20-_204081_high_also_thumb.jpg","title":" Delicata Squash Red Curry ","subtitle":" with Black Rice &amp; Thai Basil ","headbg":"\/\/media.blueapron.com\/recipes\/1376\/c_main_dish_images\/20150921-1717-244-1158\/2P_091615_3_DelicataSquashRedCurry_20-_204080_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The cooler months bring their own bounty of delicious produce, including some of our favorite hard squashes&mdash;like delicata, the highlight of this dish. We love the rich flavor and smooth texture of delicata, and we love that&mdash;thanks to its thin skin&mdash;there&rsquo;s no need to peel it before cooking. We&rsquo;re roasting the squash first to brown it, then we&rsquo;re simmering it with mustard greens in a broth of red curry paste and coconut milk. Served with black rice, a purplish variety with an almost fruity flavor, this warming, Thai-inspired meal is perfect for the autumn weather. ","ingbg":"\/\/media.blueapron.com\/recipes\/1376\/ingredient_images\/20151020-1939-100-0477\/v3-Delicata-Squash-Red-Curry-2P-W_large_feature.png","ingredients":[" 1  Cup Black Rice "," 1¾  Cups Coconut Milk "," 3  Scallions "," 1  Delicata Squash "," 1  Bunch Mustard Greens "," 1  Lime "," 1  Bunch Thai Basil "," 2  Tablespoons Peanuts "," 2  Tablespoons Red Curry Paste ","  1  1-Inch Piece Ginger   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5880\/20150921-1731-582-9450\/2P_091615_3_DelicataSquashRedCurry_20-_204072_high_feature.jpg","title":" Cook the rice:  ","desc":" Preheat the oven to 475&deg;F. Heat a medium pot of salted water to boiling on high. Once boiling, add the rice. Cook 27 to 29 minutes, or until tender. Drain thoroughly and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5881\/20150921-1731-587-6634\/2P_091615_3_DelicataSquashRedCurry_20-_204071_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Using a sturdy knife, cut off and discard the ends of the squash. Slice the squash crosswise into &frac12;-inch-thick rounds; cut out and discard the pulp and seeds. Peel and mince the ginger. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops. Remove and discard the stems of the mustard greens; roughly chop. Pick the basil leaves off the stems; discard the stems. Roughly chop the peanuts. Quarter the lime.  "},{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5882\/20150921-1732-601-6977\/2P_091615_3_DelicataSquashRedCurry_20-_204075_high_feature.jpg","title":" Roast the squash:   ","desc":" While the rice continues to cook, place the squash on a sheet pan. Drizzle with oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer and roast 18 to 20 minutes, or until browned and tender when pierced with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5883\/20150921-1732-596-2880\/2P_091615_3_DelicataSquashRedCurry_20-_204074_high_feature.jpg","title":" Start the curry:  ","desc":" Once the squash has roasted for about 15 minutes, in a large, high-sided pan (or pot), heat 2 teaspoons of oil on medium-high until hot. Add the ginger, white bottoms of the scallions and as much of the curry paste as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5884\/20150921-1732-606-0796\/2P_091615_3_DelicataSquashRedCurry_20-_204076_high_feature.jpg","title":" Finish the curry:  ","desc":" Add the mustard greens to the pan; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the mustard greens have wilted. Add the coconut milk (shaking the can before opening) and roasted squash. Cook, stirring occasionally, 2 to 4 minutes, or until thoroughly combined. Turn off the heat and stir in the juice of 2 lime wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1376\/recipe_steps\/5885\/20150921-1732-620-2202\/2P_091615_3_DelicataSquashRedCurry_20-_204077_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cooked rice between 2 dishes. Top with the finished curry. Garnish with the basil, peanuts, green tops of the scallions and remaining lime wedges. Enjoy!  "}]}