{"category":"Vegetarian","link":"eggplant-parmesan-with-gomiti-pasta-tomato-sauce","thumb":"\/\/media.blueapron.com\/recipes\/1316\/c_main_dish_images\/20150806-1710-189-5409\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200226_high_also_thumb.jpg","title":" Eggplant Parmesan ","subtitle":" with Gomiti Pasta &amp; Fresh Oregano ","headbg":"\/\/media.blueapron.com\/recipes\/1316\/c_main_dish_images\/20150806-1710-197-6081\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200225_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" There&rsquo;s nothing quite like eggplant Parmesan. An Italian classic, it consists of eggplant slices fried lightly in a pan, then baked under layers of savory tomato sauce and cheeses (mild mozzarella and sharp Parmesan). It&rsquo;s rich with traditional flavors, as well as varying textures&mdash;including, here, the delicious crispiness of panko breadcrumbs. On the side, we&rsquo;re serving whole grain gomiti pasta (better known as &ldquo;elbows&rdquo;). And we&rsquo;re garnishing the dish with potent, fresh oregano leaves. ","ingbg":"\/\/media.blueapron.com\/recipes\/1316\/ingredient_images\/20150826-1654-137-0002\/FV-eggplant-parm-F-W_large_feature.png","ingredients":[" 2  Farm Eggs "," ¾  Pound Gomiti Pasta "," 1  28-Ounce Can Crushed Tomatoes "," 1  Cup Panko Breadcrumbs ","  ½  Pound Fresh Mozzarella Cheese   "," 4  Cloves Garlic "," 1  Yellow Onion "," 1  Eggplant "," 1  Bunch Oregano "," ¼  Cup All-Purpose Flour ","  ¼  Cup Grated Parmesan Cheese   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5594\/20150807-1549-112-5808\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200192-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Crack the eggs into a medium bowl; beat until smooth. Tear the mozzarella cheese into bite-sized pieces. Peel and mince the garlic. Peel and small dice the onion. Cut off and discard both ends of the eggplant; slice into &frac12;-inch-thick rounds. Pick the oregano leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5595\/20150807-1519-266-0271\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200195_high_feature.jpg","title":" Make the sauce:  ","desc":" In a large pot, heat 1 tablespoon of olive oil on medium until hot. Add the garlic and onion; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened. Add the tomatoes. Cook, stirring occasionally, 8 to 10 minutes, or until thickened. Remove from heat; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Rinse and dry the pot; refill with salted water and heat to boiling on high.  "},{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5596\/20150807-1520-16-8980\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200194_high_feature.jpg","title":" Bread the eggplant:  ","desc":" While the sauce cooks, place the flour and breadcrumbs in 2 separate medium bowls; season each with salt and pepper. Working 1 at a time, thoroughly coat the eggplant rounds in the flour (shaking off the excess), then in the beaten eggs (letting the excess drip off), then in the breadcrumbs (pressing to adhere). Place the breaded eggplant on a plate or sheet pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5597\/20150807-1519-281-5660\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200201_high_feature.jpg","title":" Brown the eggplant:  ","desc":" In a large pan (nonstick, if you have one), heat a thin layer of oil on medium-high until hot. Once hot enough that a few breadcrumbs sizzle immediately when added to the pan, add the breaded eggplant in a single layer. (If necessary, work in batches.) Cook 2 to 4 minutes per side, or until golden brown. Transfer to a paper towel-lined plate; immediately season with salt.  "},{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5598\/20150807-1519-255-5455\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200208_high_feature.jpg","title":" Make the eggplant Parmesan:  ","desc":" Spread a thin layer of the sauce into the bottom of a baking dish. Evenly top with the browned eggplant, overlapping the rounds if necessary. Evenly top with &frac14; of the remaining sauce. Add the mozzarella cheese and ⅓ of the Parmesan cheese; season with salt and pepper. Bake 14 to 16 minutes, or until the cheese is lightly browned and bubbly. Remove from the oven and let stand for at least 2 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1316\/recipe_steps\/5599\/20150807-1518-225-4563\/FP_072915_1_Eggplant_Parmesan_with_Gomiti_Pasta_20-_200211_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" While the eggplant Parmesan bakes, add the pasta to the pot of boiling water. Cook 5 to 7 minutes, or until al dente (still slightly firm to the bite). Reserving &frac12; cup of the pasta cooking water, thoroughly drain the cooked pasta; return to the pot. Off the heat, add the remaining sauce and Parmesan cheese and half the reserved pasta cooking water. Stir to thoroughly combine; season with salt and pepper to taste. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Transfer the finished pasta to a serving dish. Serve with the eggplant Parmesan. Garnish with the oregano. Enjoy!  "}]}