{"category":"Beef","link":"flat-iron-steaks-with-romano-beans-roasted-potatoes","thumb":"\/\/media.blueapron.com\/recipes\/1257\/c_main_dish_images\/20150709-1701-166-1112\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208294_high_also_thumb.jpg","title":" Sirloin Steaks &amp; Roasted Potatoes ","subtitle":" with Green Beans &amp; Cherry Tomatoes ","headbg":"\/\/media.blueapron.com\/recipes\/1257\/c_main_dish_images\/20150709-1659-150-6344\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208293_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  550    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Green beans are a summertime delight, robust in taste and crisp in texture. Though they&rsquo;re great when cooked only briefly, they also stand up well to techniques like braising, which further develops their flavor. Here, we&rsquo;re braising our green beans with cherry tomatoes, aromatics and thyme in a silky lemon-butter sauce, softening them up a bit while preserving their distinctive snap. These seasonal legumes are the perfect addition to roasted Yukon Gold potatoes and butter-basted sirloin steaks. ","ingbg":"\/\/media.blueapron.com\/recipes\/1257\/ingredient_images\/20150721-1528-57-7928\/steaks-beans-fp-w_large_feature.png","ingredients":[" 4  Sirloin Steaks "," 10  Ounces Green Beans "," 6  Ounces Cherry Tomatoes "," 3  Cloves Garlic "," 1  Lemon "," 1  Pound Yukon Gold Potatoes ","  1  Bunch Basil   "," 1  Bunch Thyme ","  4  Tablespoons Butter   "," 1  Shallot "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5218\/20150709-1846-110-5583\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208281_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Medium dice the potatoes. Pick the thyme and basil leaves off the stems; discard the stems. Trim off and discard the stem ends of the green beans. Halve the cherry tomatoes. Peel and mince the garlic. Peel and thinly slice the shallot. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5219\/20150709-1847-121-0697\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208287_high_feature.jpg","title":" Roast the potatoes:  ","desc":" Place the potatoes and half the thyme on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange the seasoned potatoes in a single, even layer and roast 22 to 24 minutes, or until browned and tender when pierced with a fork. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5220\/20150709-1847-140-0051\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208283_high_feature.jpg","title":" Cook the steaks:   ","desc":" While the potatoes roast, pat the steaks dry with paper towels; season with salt and pepper on both sides. In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steaks. Cook 2 to 4 minutes on the first side. Flip and add half the butter. Cook, occasionally tilting the pan and spooning the butter over the steaks, 2 to 4 minutes, or until browned and cooked to your desired degree of doneness. Drain off and discard the drippings from the pan. Transfer the cooked steaks to a cutting board, leaving any browned bits (or fond) in the pan. Let the steaks rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5221\/20150709-1847-151-9932\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208286_high_feature.jpg","title":" Start the vegetables:  ","desc":" While the potatoes continue to roast, add the green beans and &frac12; cup of water to the pan of reserved fond; season with salt and pepper. Cook, occasionally stirring and scraping up any fond from the bottom of the pan, 7 to 9 minutes, or until the green beans are tender and the liquid has evaporated.  "},{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5222\/20150709-1848-162-2294\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208288_high_feature.jpg","title":" Finish the vegetables:  ","desc":" While the potatoes finish roasting, add the cherry tomatoes, garlic, shallot and remaining thyme to the pan of green beans; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the tomatoes have softened. Add the remaining butter, the juice of all 4 lemon wedges and 2 tablespoons of water. Cook, stirring frequently, 1 to 2 minutes, or until thoroughly combined. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1257\/recipe_steps\/5223\/20150709-1848-173-1295\/FP_061715_1_R_070715_3_BastedSirloinSteakswithRomanoBeans_20-_208289_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished vegetables, roasted potatoes and rested steaks between 4 plates. Garnish with the basil. Enjoy!  "}]}