{"category":"Vegetarian","link":"fresh-gnocchi-maitake-mushrooms-with-sweet-corn-thyme-brown-butter--2","thumb":"\/\/media.blueapron.com\/recipes\/426\/c_main_dish_images\/20150806-1814-113-6299\/Gnochi__20Corn__20Thyme_20Brown_20Butter-9780_high_also_thumb.jpg","title":" Fresh Gnocchi &amp; Maitake Mushrooms ","subtitle":" with Corn, Thyme &amp; Browned Butter  ","headbg":"\/\/media.blueapron.com\/recipes\/426\/c_main_dish_images\/20150806-1814-119-0985\/Gnochi__20Corn__20Thyme_20Brown_20Butter-9779_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, you&rsquo;ll be making an incredibly delicious sauce by browning butter. Browning butter is a simple process with amazing results. It consists of toasting the butter to release its deep, nutty flavor. Dark brown flecks appear as the butter foams and becomes fragrant in the pan. Once this happens, the butter is ready. (Be careful not to overcook it! Adding the shallot and corn will stop the browning process.) You&rsquo;ll finish the gnocchi in the sauce of browned butter, delicate maitake mushrooms, corn and savory thyme&mdash;coating the dumplings&rsquo; tender surface. ","ingbg":"\/\/media.blueapron.com\/recipes\/426\/ingredient_images\/20150811-1638-30-1722\/gnocchi-corn-thyme-WEB_large_feature.png","ingredients":[" 10  Ounces Fresh Gnocchi "," 3½  Ounces Maitake Mushrooms "," 1  Ear Of Corn "," 1  Bunch Thyme "," 2  Tablespoons Butter ","  1  Shallot   "," ⅓  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2819\/a09bd03a-e458-4ed7-850e-e5abbb6dcf63\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Using your hands, break the mushrooms into bite-sized pieces. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Pick the thyme leaves off the stems; discard the stems and roughly chop the leaves. Peel and thinly slice the shallot.  "},{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2820\/1e3e71e6-64b4-48f3-b778-e38cf6804e35\/step2_high_feature.jpg","title":" Cook the mushrooms:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the mushrooms and cook, stirring occasionally, 3 to 4 minutes, or until browned and softened.  "},{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2821\/8c3f13c6-b94b-49d3-a55a-e934b7158b2b\/step3_high_feature.jpg","title":" Add &amp; brown the butter:  ","desc":" Reduce the heat to medium and add the butter to the pan of mushrooms. Cook, stirring occasionally, 15 to 30 seconds, or until the butter foams. Once the foam subsides, continue cooking, stirring occasionally and swirling the pan, 2 to 3 minutes, or until the butter is deep golden brown and nuttily fragrant. (Be careful not to overcook, as the butter can burn easily.)  "},{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2822\/b0fac985-c82b-4d95-974b-bd49adf62056\/step4_high_feature.jpg","title":" Add the shallot, corn &amp; thyme:  ","desc":" Add the shallot to the pan of mushrooms and browned butter. Cook, stirring occasionally, 30 seconds to 1 minute, or until softened and fragrant. Add the corn and all but a pinch of the thyme; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until softened.  "},{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2823\/13ebf3c8-6953-4bbc-ac7d-d46e499e9e04\/step5_high_feature.jpg","title":" Cook &amp; add the gnocchi:  ","desc":" While the corn and thyme cook, add the gnocchi to the pot of boiling water. Cook 2 to 3 minutes, or until the gnocchi float to the top of the pot. Reserve &frac12; cup of the gnocchi cooking water. Using a slotted spoon or strainer, transfer the cooked gnocchi to the pan of vegetables and browned butter.  "},{"img":"\/\/media.blueapron.com\/recipes\/426\/recipe_steps\/2824\/d18d7cd6-88c8-4eba-8e5b-4ff39a9c9c93\/step6_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Add all but a pinch of the Parmesan cheese and &frac14; cup of the reserved gnocchi cooking water to the pan. Cook, stirring frequently to coat the gnocchi, 1 to 2 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining gnocchi cooking water to achieve your desired consistency.) Remove from heat and season with salt and pepper to taste. Divide the finished gnocchi between 2 dishes. Garnish with the remaining Parmesan cheese and thyme. Enjoy!  "}]}