{"category":"Shellfish","link":"grilled-shrimp-cocktail-with-asparagus-eggplant","thumb":"\/\/media.blueapron.com\/recipes\/224\/c_main_dish_images\/20140808-2008-90-7638\/Grilled_20Shrimp_20Caponata-1328_high_also_thumb.jpg","title":" Grilled Shrimp Cocktail ","subtitle":" with Eggplant Caponata &amp; Asparagus ","headbg":"\/\/media.blueapron.com\/recipes\/224\/c_main_dish_images\/20140808-2008-90-7638\/Grilled_20Shrimp_20Caponata-1328_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"During Prohibition, as the nation went dry, restaurants were left with an array of unusable glassware. Ingenious chefs, in true chef form, began repurposing. Martini glasses, with their elegant stems and wide mouths, were perfect for balancing and presenting shrimp. Thus, the shrimp “cocktail” was born. We’re serving up this classic with a spicy cocktail sauce and rounding it out with a flavorful, seasonal caponata. Cheers!","desc":" During Prohibition, as the nation went dry, restaurants were left with an array of unusable glassware. Ingenious chefs, in true chef form, began repurposing. Martini glasses, with their elegant stems and wide mouths, were perfect for balancing and presenting shrimp. Thus, the shrimp “cocktail” was born. We’re serving up this classic with a spicy cocktail sauce and rounding it out with a flavorful, seasonal caponata. Cheers! ","ingbg":"\/\/media.blueapron.com\/recipes\/224\/ingredient_images\/20140807-2200-726-9937\/grilled-shrimp-caponata-ing-WEB_large_feature.png","ingredients":[" 2  Cloves Garlic "," 2  Tablespoons Capers "," 1  Bunch Basil "," 1  Bunch Parsley "," 1  Holland Eggplant "," 1  Lemon "," ½  Bunch Asparagus "," 10  Ounces Peeled, Deveined Shrimp "," ¼  Cup Ketchup "," 1  Tablespoon Prepared Horseradish "," 4  Wooden Skewers "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2671\/20140723-2052-144-1488\/Step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Soak the skewers in a bowl of water until ready to use. Peel and mince the garlic; then, using the flat side of your knife, smash until it resembles a paste. Roughly chop the capers. Pick the basil and parsley leaves off the stems; discard the stems. Finely chop the parsley leaves. Halve the eggplant lengthwise; then, using the tip of a knife, score a crosshatch pattern into the cut sides. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest. Quarter the lemon and remove the seeds. Trim off the woody stems of the asparagus.  "},{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2672\/20140723-2052-222-0782\/Step2_high_feature.jpg","title":" Marinate the shrimp &amp; vegetables:  ","desc":" Thread the shrimp onto the skewers. Place the skewered shrimp, eggplant and asparagus onto sheet pans. Evenly top the shrimp and vegetables with the lemon zest, garlic paste, the juice of 2 lemon wedges and half the basil (roughly chopping the leaves just before adding). Drizzle with olive oil and season with salt and pepper. Gently rub the seasonings into the shrimp and vegetables. Let stand to marinate as you continue cooking.  "},{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2673\/20140723-2052-108-3360\/Step3_high_feature.jpg","title":" Make the cocktail sauce:  ","desc":" While the shrimp and vegetables marinate, in a small bowl, combine the ketchup, horseradish, the juice of 1 lemon wedge and half the parsley. Stir in a 1 teaspoon of olive oil and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2674\/20140723-2052-189-2235\/Step4_high_feature.jpg","title":" Grill the shrimp &amp; vegetables:  ","desc":" Preheat your broiler or grill on a medium-high flame. (Or use a stovetop grill pan on medium-high. If broiling, use a broiler pan or broiler-safe dish set at least 4 inches away from the heat source.) Grill the marinated eggplant, cut side down first, 4 to 6 minutes per side, or until grill marks appear and the eggplant is tender. Grill both the marinated shrimp and asparagus 3 to 5 minutes, turning over once, or until grill marks appear and the shrimp are cooked through. Transfer the grilled shrimp and vegetables to a plate.  "},{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2675\/20140723-2052-183-7454\/Step5_high_feature.jpg","title":" Make the caponata:  ","desc":" When cool enough to handle, using a spoon, scrape the flesh of the eggplant from the skins; discard the skins and roughly chop the flesh. In a bowl, combine the chopped eggplant, capers, the remaining parsley and basil (roughly chopping the leaves just before adding) and the juice of the remaining lemon wedge. Stir in a drizzle of olive oil and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/224\/recipe_steps\/2676\/20140723-2052-84-2557\/Step6_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the grilled shrimp, asparagus and caponata between 2 plates. Serve with the cocktail sauce for dipping. Enjoy!   "}]}