{"category":"Beef","link":"heirloom-tomato-burgers-with-olive-aioli-green-bean-tomato-salad","thumb":"\/\/media.blueapron.com\/recipes\/1291\/c_main_dish_images\/20150818-1501-16-2546\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208609_high_also_thumb.jpg","title":" Tomato-Basil Burgers ","subtitle":" with Olive Aioli &amp; Green Bean-Tomato Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1291\/c_main_dish_images\/20150818-1502-28-7032\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208607_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this unique spin on the classic burger, we&rsquo;re serving succulent beef patties nestled between tart tomato slices on one side, and fresh basil leaves and creamy aioli on the other. A sauce popular in Southern France and Northern Italy, aioli is served alongside a wide array of dishes. We&rsquo;re using ours as a spread, and flavoring it with briny Kalamata olives and lemon juice. On the side, we&rsquo;re serving an herbaceous salad of blanched green beans and fresh tomato dressed in a simple vinaigrette of mustard, lemon juice and shallot. ","ingbg":"\/\/media.blueapron.com\/recipes\/1291\/ingredient_images\/20150818-1502-61-4440\/m-heirloom-tomato-burger-2P-W_large_feature.png","ingredients":[" 8  Ounces Ground Beef "," 2  Sesame Seed Buns "," 6  Ounces Green Beans "," 2  Cloves Garlic "," 1  Tomato "," 1  Lemon ","  1  Bunch Basil   "," 2  Tablespoons Dijon Mustard "," 2  Tablespoons Mayonnaise "," 1  Ounce Kalamata Olives "," 1  Shallot "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5418\/20150721-2124-375-0609\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208587_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Trim off and discard the stem ends of the green beans. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the juice of 3 lemon wedges. Halve and core the tomato; thinly slice 1 half and medium dice the other. Pick the basil leaves off the stems; discard the stems. Pit and roughly chop the olives. Halve the buns.  "},{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5419\/20150721-2124-386-9936\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208588_high_feature.jpg","title":" Blanch the beans:  ","desc":" Add the green beans to the pot of boiling water. Cook 3 to 5 minutes, or until bright green and slightly tender. Drain thoroughly and rinse under cold water for 30 seconds to 1 minute to stop the cooking process. Pat dry with paper towels.  "},{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5420\/20150721-2124-397-0250\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208590_high_feature.jpg","title":" Cook the burgers:  ","desc":" In a medium bowl, combine the ground beef, all but a pinch of the garlic paste and half the mustard; season with salt and pepper. Mix until just combined. Form the mixture into two &frac12;-inch-thick burgers. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the burgers. Cook 2 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5421\/20150721-2124-408-1752\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208589_high_feature.jpg","title":" Make the olive aioli &amp; vinaigrette:  ","desc":" While the burgers cook, in a small bowl, combine the olives, mayonnaise, remaining garlic paste and the juice of the remaining lemon wedge; stir to combine and season with salt and pepper to taste. Set aside. Add the remaining mustard to the shallot-lemon juice mixture; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5422\/20150721-2125-431-4899\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208591_high_feature.jpg","title":" Make the salad:  ","desc":" While the burgers continue to cook, in a large bowl, combine the blanched green beans, diced tomato and half the basil (tearing the leaves just before adding); season with salt and pepper. Add as much of the vinaigrette as you&rsquo;d like (you may have extra); toss to coat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1291\/recipe_steps\/5423\/20150721-2126-442-6882\/2P_071415_4_NEWHeirloomTomatoBURGER_20-_208593_high_feature.jpg","title":" Toast the buns &amp; plate your dish:  ","desc":" Heat the pan of reserved fond on medium until hot. Add the buns, cut sides down. Toast 1 to 2 minutes, or until lightly browned. Transfer to a clean, dry work surface. Top each toasted bun bottom with half the sliced tomato, a cooked burger, half the olive aioli, half the remaining basil and a toasted bun top. Divide the finished burgers and salad between 2 plates. Enjoy!  "}]}