{"category":"Beef","link":"hoisin-ponzu-glazed-steaks-with-roasted-carrots-aromatic-rice","thumb":"\/\/media.blueapron.com\/recipes\/1144\/c_main_dish_images\/20150403-2148-15230-1114\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200031_high_also_thumb.jpg","title":" Hoisin &amp; Ponzu-Glazed Steaks ","subtitle":" with Roasted Carrots &amp; Garlic-Ginger Rice  ","headbg":"\/\/media.blueapron.com\/recipes\/1144\/c_main_dish_images\/20150403-2148-15492-7179\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200029_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  505    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re bringing classic Chinese and Japanese flavors together in this succulent steak dinner. Sweet and savory hoisin sauce is a go-to ingredient in Chinese cuisine, particularly in the Province of Guangdong. Japanese ponzu sauce is delectably tart, made with soy sauce, vinegar and the juice of citrus fruits native to Asia, including yuzu. We&rsquo;re combining the two sauces here to make a balanced, delicious glaze that cuts the richness of the steaks and complements the natural sweetness of the roasted carrots. ","ingbg":"\/\/media.blueapron.com\/recipes\/1144\/ingredient_images\/20150423-1955-260-6288\/steaks-w-roasted-carrots_lime-rice-fp-w_large_feature.png","ingredients":[" 4  Flat Iron Steaks "," 1½  Cups Jasmine Rice "," 2  Cloves Garlic "," 2  Scallions "," 1  Lime "," 4  Carrots "," 4  Tablespoons Butter "," 2  Tablespoons Cornstarch ","  1  2-Inch Piece Ginger   "," ¼  Cup Hoisin Sauce "," ¼  Cup Ponzu Sauce "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4453\/20150403-2154-15695-4814\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200018_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Remove the steaks from the refrigerator to bring to room temperature. Wash and dry the fresh produce. Peel the carrots; quarter the carrots lengthwise, then cut into 2-inch pieces. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions. Thinly slice the white bottoms of the scallions on an angle; cut the green tops into 1-inch pieces on an angle. Quarter the lime.  "},{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4454\/20150403-2155-16831-7406\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200025_high_feature.jpg","title":" Roast the carrots:  ","desc":" Place the carrots on a sheet pan. Drizzle with oil and season with salt and pepper; toss to coat. Arrange in a single, even layer and roast 18 to 20 minutes, or until tender. Transfer to a serving dish. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4455\/20150403-2156-15850-8449\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200020_high_feature.jpg","title":" Make the garlic-ginger rice:  ","desc":" While the carrots roast, in a medium pot, heat 1 tablespoon of oil on medium-high until hot. Add the garlic, ginger and white bottoms of the scallions; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Add the rice, a big pinch of salt and 1&frac12; cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 12 to 14 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the garlic-ginger rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4456\/20150403-2155-14649-4081\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200021_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the rice cooks, pat the steaks dry with paper towels; season with salt and pepper on both sides. Place the cornstarch in a medium bowl. Working 1 at a time, coat both sides of each seasoned steak in the cornstarch (tapping off any excess). In a large pan (nonstick, if you have one), heat 1 tablespoon of oil on medium-high until hot. Add the coated steaks. Cook 4 to 6 minutes per side, or until cooked to your desired degree of doneness. Transfer to the serving dish of roasted carrots, leaving any browned bits (or fond) in the pan. Loosely cover the steaks and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4457\/20150403-2156-14221-4391\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200022_high_feature.jpg","title":" Make the hoisin-ponzu sauce:  ","desc":" Add &frac14; cup of water to the pan of reserved fond. Heat on medium until hot, stirring to scrape up any browned bits from the bottom of the pan. Add the hoisin sauce, ponzu sauce and half the butter. Cook, stirring frequently, 1 to 2 minutes, or until thoroughly combined and slightly reduced in volume. Remove from heat and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1144\/recipe_steps\/4458\/20150403-2156-16962-2765\/FP_030315_4_20Hoisin-Ponzu_20Steaks_20with_20Roasted_20Carrots_20__20Lime_20Rice_20-_200024_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Add the remaining butter to the pot of garlic-ginger rice; stir until melted and season with salt and pepper to taste. Transfer to a serving dish. Top the cooked steaks and roasted carrots with the hoisin-ponzu glaze. Garnish with the green tops of the scallions. Serve with the lime wedges. Enjoy!  "}]}