{"category":"Lamb","link":"korean-bulgogi-style-lamb-beef-with-long-beans-sticky-rice","thumb":"\/\/media.blueapron.com\/recipes\/1281\/c_main_dish_images\/20150630-2007-1632-4172\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207901_high_also_thumb.jpg","title":" Korean Bulgogi-Style Lamb &amp; Beef ","subtitle":" with Sticky Rice &amp; Long Beans ","headbg":"\/\/media.blueapron.com\/recipes\/1281\/c_main_dish_images\/20150630-2006-1611-6085\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207900_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  530    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The word &ldquo;bulgogi&rdquo; translates to &ldquo;fire meat.&rdquo; Traditionally, it refers to a Korean barbecue favorite: beef prepared with flavorful sauces, then grilled over a flame. But &ldquo;bulgogi&rdquo; has come to describe&mdash;more generally&mdash;those authentic, delicious flavors. Here, in our stovetop recipe, we&rsquo;re cooking lamb and beef in a complex, rich sauce of deeply savory soy glaze, subtly nutty sesame oil and gochujang (a spicy-sweet chile paste). And we&rsquo;re adding seasonal, crisp long beans to the mix, as well as a side of aromatic sticky rice. ","ingbg":"\/\/media.blueapron.com\/recipes\/1281\/ingredient_images\/20150701-1727-615-2805\/pork-bulgogi_long-beans-fp-w_large_feature.png","ingredients":[" 1⅛  Pounds Ground Lamb & Beef Blend "," 1  Cup Sushi Rice "," 4  Cloves Garlic "," 3  Scallions "," ¾  Pound Long Beans ","  1  Bunch Thai Basil   "," 3  Tablespoons Peanuts ","  1  2-Inch Piece Ginger   "," 1  Tablespoon Gochujang Paste ","  1  Tablespoon Sesame Oil   "," ¼  Cup Soy Glaze "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5284\/20150701-1654-161-4906\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207873_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and finely chop the garlic and ginger. Trim off and discard the ends of the long beans; cut the long beans in half. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Pick the Thai basil leaves off the stems; discard the stems. Roughly chop the peanuts.  "},{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5285\/20150701-1655-179-9705\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207878_high_feature.jpg","title":" Cook the rice:  ","desc":" In a small pot, heat 2 teaspoons of oil on medium-high until hot. Add half the garlic and half the ginger; season with salt and pepper. Cook, stirring occasionally, 30 seconds to 1 minute, or until fragrant. Add the rice, a big pinch of salt and 1&frac12; cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 15 to 17 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5286\/20150701-1656-206-0977\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207874_high_feature.jpg","title":" Cook the meat:  ","desc":" While the rice cooks, in a large pan, heat 1 tablespoon of oil on medium-high until hot. Add the ground lamb and beef; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 3 to 5 minutes, or until browned and cooked through. Carefully drain off and discard the drippings. Transfer the cooked lamb and beef to a bowl, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5287\/20150701-1656-217-3814\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207875_high_feature.jpg","title":" Cook the vegetables:  ","desc":" While the rice continues to cook, add 1 tablespoon of oil to the pan of reserved fond. Heat on medium-high until hot. Add the long beans; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and lightly browned. Add the white bottoms of the scallions and remaining garlic and ginger; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5288\/20150701-1657-236-8165\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207877_high_feature.jpg","title":" Finish the bulgogi:  ","desc":" To the pan of vegetables, add the cooked lamb and beef, soy glaze, sesame oil, &frac12; cup of water and as much of the gochujang paste as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Cook, stirring frequently, 2 to 3 minutes, or until thoroughly combined and the sauce has thickened; season with salt and pepper to taste. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1281\/recipe_steps\/5289\/20150701-1657-258-3118\/FP_062515_1__20Pork_20Bulgogi_20w-_20Long_20Beans_20-_207882_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the cooked rice and finished bulgogi between 4 plates. Garnish with the Thai basil, green tops of the scallions and peanuts. Enjoy!  "}]}