{"category":"Lamb","link":"lamb-meatball-shawarma-with-chickpea-salad","thumb":"\/\/media.blueapron.com\/recipes\/633\/c_main_dish_images\/20150213-1922-23480-6466\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207619_high_also_thumb.jpg","title":" Lamb &amp; Beef Shawarma ","subtitle":" with Creamy Radish Salad ","headbg":"\/\/media.blueapron.com\/recipes\/633\/c_main_dish_images\/20150213-1921-23473-4373\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207618_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Shawarma-style meat is traditionally roasted on a vertical, rotating spit. (&ldquo;Shawarma&rdquo; comes from the Turkish word for &ldquo;turning.&rdquo;) In our kitchen-friendly take on the dish, we&rsquo;re making meat patties and wrapping them with pocketless pitas for equally delicious spiced sandwiches. They&rsquo;re completed by a rich, zesty Greek yogurt sauce&mdash;which is so good that we&rsquo;re using it again, as a dressing for  a crunchy side salad of radishes and sunflower seeds. ","ingbg":"\/\/media.blueapron.com\/recipes\/633\/ingredient_images\/20150213-1923-19-9458\/lamb-meatball-shawarma-2p-w_large_feature.png","ingredients":[" 8  Ounces Ground Lamb & Beef Blend "," 2  Plain Pocketless Pitas "," ½  Cup Plain Greek Yogurt "," 8  Ounces Radishes "," 2  Cloves Garlic "," 1  Lemon "," 1  Persian Cucumber ","  1  Red Onion   "," 1  Large Bunch Mint "," 2  Tablespoons Sunflower Seeds "," 2  Teaspoons Shawarma Spice Blend (Za'atar, Ground Cumin, Ground Sweet Paprika, Ground Coriander & White Sesame Seeds) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3973\/20150213-1924-23599-8823\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207611_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 400&deg;F. Wash and dry the fresh produce. Trim off and discard the stem ends of the radishes; cut the radishes into bite-sized wedges. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Trim off and discard the ends of the cucumber; thinly slice the cucumber on an angle. Peel and small dice the onion. Pick the mint leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3974\/20150213-1924-76-5850\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207459_high_feature.jpg","title":" Cook the aromatics:  ","desc":" In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the onion, &frac34; of the garlic paste and &frac34; of the spice blend; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until the onion and garlic have softened and the spice blend is fragrant. Remove from heat; transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3975\/20150213-1924-498-9074\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207461_high_feature.jpg","title":" Form &amp; cook the patties:  ","desc":" Add the lamb and beef blend to the bowl of cooked aromatics; season with salt and pepper. Using a spoon, gently mix until just combined. Form the mixture into 6 oval-shaped patties. In the same pan used to cook the aromatics, heat 2 teaspoons of olive oil on medium-high until hot. Add the patties and cook 2 to 3 minutes per side, or until browned and cooked through. Remove from heat and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3976\/20150213-1924-23610-0121\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207460_high_feature.jpg","title":" Make the yogurt sauce:  ","desc":" While the patties cook, in a medium bowl, combine the Greek yogurt, lemon zest, remaining garlic paste, the juice of all 4 lemon wedges and half the mint (chopping just before adding).Season with salt and pepper to taste; set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3977\/20150213-1924-529-9700\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207612_high_feature.jpg","title":" Make the salad:  ","desc":" In a large bowl, combine the radishes, sunflower seeds, half the yogurt sauce and all but a pinch of the remaining spice blend; toss to coat. Season with salt and pepper to taste.    "},{"img":"\/\/media.blueapron.com\/recipes\/633\/recipe_steps\/3978\/20150213-1924-119-5383\/2P_010715_7_20Lamb_20Meatball_20Shawarma_20-_207469_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Carefully place the pitas directly onto the oven rack. Toast 2 to 3 minutes, or until warm and pliable. Remove from the oven. Divide the cucumber, remaining mint, cooked patties and remaining yogurt sauce between the warmed pitas. Place each finished pita on a plate. Serve with the salad on the side. Garnish the salad with the remaining spice blend. Enjoy!  "}]}