{"category":"Lamb","link":"lamb-ragu-with-mezzi-rigatoni","thumb":"\/\/media.blueapron.com\/recipes\/476\/c_main_dish_images\/20141010-1707-4978-6524\/Lamb_20Ragu-9640_high_also_thumb.jpg","title":" Lamb Ragu ","subtitle":" with Rigatoni &amp; Purple Top Turnips ","headbg":"\/\/media.blueapron.com\/recipes\/476\/c_main_dish_images\/20141010-1706-4969-4098\/Lamb_20Ragu-9638_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Ragu, a meat-based sauce usually served with pasta, is actually a relatively new addition to Italian cuisine. Following Napoleon&rsquo;s invasion of Italy in 1796, the cuisine of the northern provinces was heavily influenced by the French. Though meat and vegetable stews had been popular in the region since the Renaissance, using them as a pasta sauce was unheard of. The Italian ragu (from the French &quot;rago&ucirc;t&quot;) was born. Our version uses classic techniques and seasonal ingredients to create a delicious fall pasta dish.","desc":" Ragu, a meat-based sauce usually served with pasta, is actually a relatively new addition to Italian cuisine. Following Napoleon&rsquo;s invasion of Italy in 1796, the cuisine of the northern provinces was heavily influenced by the French. Though meat and vegetable stews had been popular in the region since the Renaissance, using them as a pasta sauce was unheard of. The Italian ragu (from the French &quot;rago&ucirc;t&quot;) was born. Our version uses classic techniques and seasonal ingredients to create a delicious fall pasta dish. ","ingbg":"\/\/media.blueapron.com\/recipes\/476\/ingredient_images\/20141014-1840-3289-6872\/lamb-ragu-W3_large_feature.png","ingredients":[" 8  Ounces Ground Lamb ","  6  Ounces Rigatoni Pasta   "," 3  Cloves Garlic "," 2  Ounces Mustard Greens "," 6  Ounces Purple Top Turnip "," 1  Carrot "," 1  Stalk Celery "," 1  Yellow Onion "," 1  Bunch Parsley "," 1  Bunch Rosemary "," 2  Tablespoons Grated Pecorino Cheese ","  2  Tablespoons Tomato Paste   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3141\/20141014-1623-5168-8964\/Lamb_20Ragu-9622_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Cut off and discard the stems and thin roots of the turnips. Cut the turnips bulbs into wedges. Roughly chop the mustard greens. Peel and small dice the carrot and onion. Small dice the celery. Pick the parsley leaves off the stems; discard the stems and roughly chop the leaves. Pick the rosemary leaves off the stems. Roughly chop the leaves to get about 1 tablespoon of chopped rosemary.  "},{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3142\/20141010-1713-5326-7724\/Lamb_20Ragu-9623_high_feature.jpg","title":" Cook the turnips:  ","desc":" In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the turnip wedges and season with salt and pepper. Cook, stirring occasionally, 5 to 7 minutes, or until browned and tender. Transfer to a bowl and set aside. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3143\/20141010-1714-5414-8336\/Lamb_20Ragu-9624_high_feature.jpg","title":" Cook the lamb:  ","desc":" In the same pan used to cook the turnips, heat 2 teaspoons of olive oil on medium-high until hot. Add the lamb and season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 6 minutes, or until browned. Transfer to a bowl, leaving the drippings in the pan. Set the bowl aside in a warm place. Carefully drain off and discard half the drippings, leaving the remaining drippings in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3144\/20141010-1713-5338-2556\/Lamb_20Ragu-9626_high_feature.jpg","title":" Make the sauce:  ","desc":" Heat the pan of reserved drippings on medium until hot. Add the garlic, carrot, celery, onion and rosemary; season with salt and pepper. Cook, stirring occasionally, 7 to 9 minutes, or until tender. Add the tomato paste and cook, stirring frequently, 3 to 4 minutes, or until slightly caramelized and fragrant. Add the cooked lamb, cooked turnip wedges and 1 cup of water. Cook, stirring occasionally, 7 to 9 minutes, or until thickened and reduced in volume. Turn off the heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3145\/20141010-1713-5332-5352\/Lamb_20Ragu-9628_high_feature.jpg","title":" Cook the pasta &amp; add it to the sauce:  ","desc":" While the sauce reduces, add the rigatoni pasta to the pot of boiling water. Cook 9 to 11 minutes, or until just shy of al dente (still slightly firm to the bite). Reserve &frac12; cup of the pasta cooking water. Drain the pasta thoroughly and add it directly to the pan of sauce.   "},{"img":"\/\/media.blueapron.com\/recipes\/476\/recipe_steps\/3146\/20141010-1714-5420-3430\/Lamb_20Ragu-9630_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Add the mustard greens and &frac14; cup of the reserved pasta water to the pan of sauce. Cook on medium, stirring occasionally to coat the pasta, 2 to 3 minutes, or until wilted. (If the sauce looks dry, slowly add the remaining pasta cooking water until the sauce reaches your desired consistency.) Remove from heat. Stir in the Pecorino cheese and all but a pinch of the parsley; season with salt and pepper to taste. Divide the pasta between 2 dishes. Garnish with the remaining parsley. Enjoy!  "}]}