{"category":"Pork","link":"late-summer-pork-bolognese-with-wheat-linguine-cherry-tomatoes","thumb":"\/\/media.blueapron.com\/recipes\/1309\/c_main_dish_images\/20150831-1907-37-4203\/2P_072815_3_R_082815_5_LateSummerPorkBolognese_20-_209953_high_also_thumb.jpg","title":" Late Summer Pork Bolognese ","subtitle":" with Whole Grain Linguine &amp; Cherry Tomatoes ","headbg":"\/\/media.blueapron.com\/recipes\/1309\/c_main_dish_images\/20150831-1906-21-9542\/2P_072815_3_R_082815_5_LateSummerPorkBolognese_20-_209955_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Bolognese, the classic Italian meat sauce, is perfectly suited to the end of summertime. It&rsquo;s traditionally made with a trio of aromatic vegetables called &ldquo;soffrito&rdquo;: onion, celery and carrot (a cool-weather vegetable that begins our transition toward early fall). Saut&eacute;ed together, they provide an exceptional base of flavor. To brighten our delicious pork bolognese, we&rsquo;re using juicy cherry tomatoes. And we&rsquo;re finishing the whole grain linguine in the sauce, then topping the dish with sharp Parmesan and fresh parsley. ","ingbg":"\/\/media.blueapron.com\/recipes\/1309\/ingredient_images\/20150831-1919-37-5178\/M-late-summer-bolognese-2P-W_large_feature.png","ingredients":[" 10  Ounces Ground Pork "," 6  Ounces Whole Grain Linguine Pasta "," 3  Ounces Cherry Tomatoes "," 3  Cloves Garlic "," 1  Carrot "," 1  Stalk Celery "," 1  Yellow Onion "," 1  Bunch Parsley ","  2  Tablespoons Tomato Paste   "," ¼  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5535\/20150831-1919-96-0346\/2P_072815_3_R_082815_5_LateSummerPorkBolognese_20-_209948_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Peel and mince the garlic. Peel and small dice the carrot and onion. Small dice the celery. Finely chop the parsley leaves and stems. Halve the cherry tomatoes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5536\/20150806-1425-53-6244\/2P_072815_3_Late_Summer_Bolognese-0144_high_feature.jpg","title":" Cook the pork:  ","desc":" In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the ground pork; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 6 minutes, or until browned and cooked through. Transfer to a bowl, leaving any drippings and browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5537\/20150806-1425-64-5234\/2P_072815_3_Late_Summer_Bolognese-0145_high_feature.jpg","title":" Start the sauce:  ","desc":" Heat the pan of reserved fond on medium until hot. Add the garlic, carrot, onion and celery; season with salt and pepper. (If the pan seems dry, add 1 teaspoon of olive oil.) Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5538\/20150806-1425-75-6503\/2P_072815_3_Late_Summer_Bolognese-0146_high_feature.jpg","title":" Finish the sauce:  ","desc":" Add the tomato paste to the pan of vegetables. Cook, stirring frequently, 1 to 2 minutes, or until dark red. Add the cooked pork and 1 cup of water; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until thickened and saucy.  "},{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5539\/20150806-1425-86-1541\/2P_072815_3_Late_Summer_Bolognese-0147_high_feature.jpg","title":" Cook the pasta:  ","desc":" While the sauce cooks, add the pasta to the pot of boiling water. Cook 4 to 6 minutes, or until just shy of al dente (still slightly firm to the bite). Reserving &frac12; cup of the pasta cooking water, drain the pasta thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1309\/recipe_steps\/5540\/20150831-1919-110-0892\/2P_072815_3_R_082815_5_LateSummerPorkBolognese_20-_209949_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" To the pan of sauce, add the cooked pasta, cherry tomatoes, all but a pinch of the Parmesan cheese and &frac14; cup of the reserved pasta cooking water; season with salt and pepper. Cook, stirring frequently to coat the pasta, 1 to 3 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Remove from heat; season with salt and pepper to taste. Divide the finished pasta between 2 dishes. Garnish with the parsley and remaining Parmesan cheese. Enjoy!  "}]}