{"category":"Shellfish","link":"latin-spiced-shrimp-in-butter-lettuce-cups-with-kaniwa-poblano-jicama-and-orange-salad","thumb":"\/\/media.blueapron.com\/recipes\/348\/c_main_dish_images\/20140808-2032-282-8872\/forcard_high_also_thumb.jpg","title":" Latin-Spiced Shrimp in Butter Lettuce Cups ","subtitle":" with Red Quinoa &amp; Poblano, Jicama and Orange Salad ","headbg":"\/\/media.blueapron.com\/recipes\/348\/c_main_dish_images\/20140808-2032-282-8872\/forcard_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  680    Per Serving ","time":"Jicama is an edible tuber native to Mexico. It’s crispy and slightly sweet, making it a perfect complement to the juiciness the orange and slightly spicy freshness of the poblano pepper in this salad. You’ll serve it, topped with tender shrimp, in a crunchy lettuce cup. Finger food has never been better. Grab a bite!","desc":" Jicama is an edible tuber native to Mexico. It’s crispy and slightly sweet, making it a perfect complement to the juiciness the orange and slightly spicy freshness of the poblano pepper in this salad. You’ll serve it, topped with tender shrimp, in a crunchy lettuce cup. Finger food has never been better. Grab a bite! ","ingbg":"\/\/media.blueapron.com\/recipes\/348\/ingredient_images\/20140807-2211-1446-9880\/latin-shrimp-lettuce-wrap-updated_large_feature.png","ingredients":[" 1  Bunch Cilantro "," 1  Clove Garlic "," 1  Head Butter Lettuce "," 1  Poblano Pepper "," 1  Lime "," 1  Orange "," 1  Red Onion "," ½  Bulb Jicama "," ½  Cup Red Quinoa "," 2  Tablespoons Golden Raisins "," 10  Ounces Shrimp, Tails Off "," 1  Tablespoon Agave Syrup "," 2  Tablespoons Pepitas "," 1  Tablespoon Latin Spice Blend (Cumin, Oregano, Sweet Paprika, Coriander, Chile Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2067\/20140723-2008-3120-2817\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":"   \tWash and dry the fresh produce. Heat a small pot of salted water to boiling on high. Roughly chop the cilantro. Peel and mince the garlic; with the side of a knife, smash it until it resembles a paste. Medium dice the poblano. Peel the orange and cut into 1-inch pieces. Using a peeler, remove the rind of the lime (avoiding the pith); mince the peel to get 2 teaspoons of zest. Quarter the lime. Peel the jicama; cut into thin matchsticks. Cut off the root of the lettuce; separate the leaves. Peel and thinly slice the red onion.   "},{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2068\/20140723-2008-4938-7495\/Step2-redquinoa_high_feature.jpg","title":" Cook the red quinoa:  ","desc":"   \tOnce the water is boiling, add the quinoa. Cook 15 to 17 minutes, or until tender and cooked through. Drain thoroughly and return to the pot.   "},{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2069\/20140723-2008-4944-9902\/step3_high_feature.jpg","title":" Make the dressing &amp; salad:  ","desc":"   \tIn a small bowl, combine the garlic paste, agave and the juice of all 4 lime wedges. Slowly whisk in 2 tablespoons of olive oil and season with salt and pepper. In a large bowl, combine the orange, jicama, poblano, &frac34; of the cilantro and as much of the red onion as you&rsquo;d like (you may have extra onion). Add enough of the dressing (you may have extra dressing) to coat the greens and toss to thoroughly mix. Season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2070\/20140723-2008-3126-4152\/step4_high_feature.jpg","title":" Toast the pepitas:  ","desc":"   \tIn a large pan (nonstick, if you have one) heat 1 teaspoon of olive oil on medium-high until hot. Add the pepitas and cook, stirring occasionally, 3 to 4 minutes, or until fragrant and toasted. (Be careful as the pepitas may pop as they cook.) Transfer to a paper towel-lined plate and wipe out the pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2071\/20140723-2009-4950-1508\/step5_high_feature.jpg","title":" Cook the shrimp:  ","desc":"   \tPlace the shrimp in a small bowl and season with salt and pepper, the lime zest and as much of the Latin spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Toss to mix. In the pan used to toast the pepitas, heat 2 teaspoons of olive oil on medium until hot. Add the shrimp and cook 2 to 3 minutes per side, or until cooked through and opaque. Transfer the cooked shrimp to a plate.   "},{"img":"\/\/media.blueapron.com\/recipes\/348\/recipe_steps\/2072\/20140723-2009-3132-7969\/step6_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":"   \tTo the pot with the cooked quinoa, add the raisins, toasted pepitas, and remaining dressing. Stir to thoroughly mix. To plate your dish, place a few lettuce leaves on each plate, fill each with a little orange-jicama salad and top with the cooked shrimp. Garnish with the remaining cilantro. Serve with the dressed quinoa on the side. Enjoy!   "}]}