{"category":"Shellfish","link":"lemon-butter-shrimp-with-tomato-rice-arugula-and-orange-salad","thumb":"\/\/media.blueapron.com\/recipes\/1070\/c_main_dish_images\/20150217-2240-12-3160\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208613_high_also_thumb.jpg","title":" Lemon-Butter Shrimp ","subtitle":" with Tomato Rice &amp; Arugula-Orange Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1070\/c_main_dish_images\/20150217-2240-12-3782\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208612_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  675    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Simmering rice with tomatoes and spices turns it a beautiful orange-yellow. It also infuses the rice with flavor, as the grains absorb the juices of the tomatoes and the essential oils of the spices. In this recipe, one of those spices is dried, ground orange peel. Fresh orange slices in the salad and lemon juice squeezed over the saut&eacute;ed shrimp bring this bright, delicious meal together. ","ingbg":"\/\/media.blueapron.com\/recipes\/1070\/ingredient_images\/20150302-2100-782-8894\/inglemon-butter-shrimp-fp-w2_large_feature.png","ingredients":[" 1  Pound Shrimp "," 2  Cups Long Grain White Rice "," 1  15-Ounce Can Diced Tomatoes "," 2  Ounces Pecorino Romano Cheese "," 4  Cloves Garlic "," 4  Ounces Arugula "," 2  Navel Oranges "," 2  Scallions "," 1  Lemon "," 1  Red Onion "," 4  Tablespoons Butter ","  2  Tablespoons Sherry Vinegar   "," 1  Tablespoon Tomato Rice Spice Blend (Smoked Paprika, Ground Turmeric, Ground Bay Leaf & Dried Orange Peel) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4014\/20150217-2248-1118-1822\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208587_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and thinly slice the garlic. Peel and small dice the onion. Cut off and discard the root ends of the scallions; thinly slice the scallions on an angle, separating the white bottoms and green tops. Quarter and deseed the lemon. Cut off the tops and bottoms of the oranges so that they sit flat on a cutting board; cut off and discard their rinds and white piths. Slice the oranges into thin rounds. Using a peeler, shave the Pecorino Romano cheese into thin strips.  "},{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4015\/20150217-2249-1140-6272\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208590_high_feature.jpg","title":" Make the tomato rice:  ","desc":" In a medium pot, heat 1 tablespoon of olive oil on medium-high until hot. Add the onion, white bottoms of the scallions, spice blend and half the garlic; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened and fragrant. Stir in the tomatoes, rice and 3 &frac12; cups of water; season with salt and pepper. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 14 to 16 minutes, or until the liquid is absorbed and the rice is tender. Remove from heat and fluff the finished tomato rice with a fork. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4016\/20150217-2249-629-7405\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208589_high_feature.jpg","title":" Make the vinaigrette:  ","desc":" While the rice cooks, pour the vinegar into a medium bowl; season with salt and pepper to taste. Slowly whisk in 3 tablespoons of olive oil until well combined. Set aside.  "},{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4017\/20150217-2249-537-8963\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208591_high_feature.jpg","title":" Cook the shrimp:  ","desc":" Once the rice has cooked for about 10 minutes, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the remaining garlic and cook, stirring frequently, 1 to 2 minutes, or until lightly browned and fragrant. Add the shrimp; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the shrimp are slightly opaque. Add the butter and the juice of all 4 lemon wedges; cook, stirring occasionally, 30 seconds to 1 minute, or until well combined and the shrimp are opaque and cooked through. Season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4018\/20150217-2249-1147-4961\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208594_high_feature.jpg","title":" Make the salad:  ","desc":" In a large bowl, combine the arugula, oranges and Pecorino Romano cheese. Add enough of the vinaigrette to coat the salad (you may have extra vinaigrette); toss to combine and season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1070\/recipe_steps\/4019\/20150217-2249-17711-1981\/FP_012315_1_20Lemon-Butter_20Shimp_20with_20Tomato_20Rice_20-_208596_high_feature.jpg","title":" Serve your dish:  ","desc":" Garnish the cooked shrimp and tomato rice with the green tops of the scallions. Serve with the salad on the side. Enjoy!  "}]}