{"category":"Shellfish","link":"mexican-inspired-shrimp-fried-rice-with-radishes-avocado-mexican-crema","thumb":"\/\/media.blueapron.com\/recipes\/1200\/c_main_dish_images\/20150520-1525-390-0923\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203273_high_also_thumb.jpg","title":" Mexican Shrimp Fried Rice ","subtitle":" with Radishes, Avocado &amp; Sugar Snap Peas ","headbg":"\/\/media.blueapron.com\/recipes\/1200\/c_main_dish_images\/20150520-1524-379-7004\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203272_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  580    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Fried rice is an endlessly customizable Chinese stir-fry dish, in which cooked rice is finished in a pan of sauce and vegetables. As the dish&rsquo;s popularity has grown, countless variations have appeared across the world. One of our favorites uses traditional ingredients from south of the border. Here, we&rsquo;re making Mexican-inspired shrimp fried rice, seasoned with authentic spices and garnished with cilantro, crema, lime juice and avocado, as well as seasonal vegetables. Bright, easy and amazingly satisfying, this gourmet meal is the perfect way to begin the summer. ","ingbg":"\/\/media.blueapron.com\/recipes\/1200\/ingredient_images\/20150605-1952-156-3446\/mexican-style-shrimp-fried-rice-fp-w_large_feature.png","ingredients":[" 16  Ounces Shrimp "," 1½  Cups Long Grain Brown Rice "," 3  Ounces Sugar Snap Peas "," 3  Ounces Radishes "," 2  Limes "," 1  Avocado "," 1  Red Onion "," 1  Large Bunch Cilantro "," 3  Tablespoons Tomato Paste ","  ¼  Cup Mexican Crema   "," 1  Tablespoon Mexican Fried Rice Spice Blend (Ancho Chile Powder, Ground Smoked Sweet Paprika, Ground Cumin Seeds, Dried Mexican Oregano & Garlic Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4860\/20150520-1530-581-0081\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203262_high_feature.jpg","title":" Cook the rice:  ","desc":" In a medium pot, combine the rice, a big pinch of salt and 2 cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 23 to 25 minutes, or until the water has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4861\/20150520-1530-555-0802\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203260_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Peel the onion and cut into 1-inch-wide wedges; separate the layers. Quarter the limes. Trim off and discard the root ends of the radishes; thinly slice the radishes into rounds. Pit, peel and medium dice the avocado; toss with the juice of 2 lime wedges to prevent browning. Snap off and discard the stems of the sugar snap peas; pull off and discard the tough string that runs the length of each pod. Cut the snap peas in half on an angle. Pick the cilantro leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4862\/20150520-1537-88-9676\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203261_high_feature.jpg","title":" Start the fried rice:  ","desc":" In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the onion and as much of the spice blend as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until softened and fragrant. Add the tomato paste and cook, stirring frequently, 1 to 2 minutes, or until dark red. Add &frac12; cup of water and cook, stirring constantly, 30 seconds to 1 minute, or until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4863\/20150520-1537-99-3206\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203263_high_feature.jpg","title":" Add the shrimp:  ","desc":" Add the shrimp and the juice of 2 lime wedges to the pan; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until the shrimp are opaque and cooked through.  "},{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4864\/20150520-1537-114-6561\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203264_high_feature.jpg","title":" Finish the fried rice:  ","desc":" Add the sugar snap peas and cooked rice to the pan. Cook, stirring frequently, 2 to 4 minutes, or until well combined and the sugar snap peas are bright green. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1200\/recipe_steps\/4865\/20150520-1537-129-8495\/FP_040715_4_20Mexican_20Style_20Shrimp_20Fried_20Rice_20-_203265_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished fried rice between 4 dishes. Garnish with the radishes, avocado, cilantro and remaining lime wedges. Serve with the Mexican crema on the side. Enjoy!  "}]}