{"category":"Vegetarian","link":"mixed-mushroom-risotto-with-porcini-broth-leek-chives","thumb":"\/\/media.blueapron.com\/recipes\/1352\/c_main_dish_images\/20150911-1545-54-5727\/2P_090915_3_MixedMushroomRisotto_20-_200505_high_also_thumb.jpg","title":" Mixed Mushroom Risotto ","subtitle":" with Porcini Broth, Leek &amp; Chives ","headbg":"\/\/media.blueapron.com\/recipes\/1352\/c_main_dish_images\/20150911-1546-68-6279\/2P_090915_3_MixedMushroomRisotto_20-_200504_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Fall mushrooms come in a bewitching array of shapes, colors, sizes and textures. Here, we&rsquo;re using four unique varieties that add tremendous, woodsy complexity to our creamy, Parmesan-laden risotto: ruffled maitake, meaty oyster, mild cremini and the highly prized dried porcini. The drying process enhances the flavor of the porcini, making it intense, concentrated and perfect for infusing the dish with deep umami notes. To make the broth for the risotto, we&rsquo;re cooking leek with thyme and garlic, then adding both the porcini and the enriched water used to rehydrate them. ","ingbg":"\/\/media.blueapron.com\/recipes\/1352\/ingredient_images\/20151013-1442-23-9404\/V2-Mixed-Mushroom-Risotto-2P-W_large_feature.png","ingredients":[" 1  Cup Arborio Rice "," 9  Ounces Mixed Mushrooms "," 3  Cloves Garlic ","  1  Leek   "," 1  Bunch Chives "," 1  Bunch Thyme "," 2  Tablespoons Butter "," ½  Cup Grated Parmesan Cheese "," ½  Ounce Dried Porcini Mushrooms "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5729\/20150911-1618-152-8274\/2P_090915_3_MixedMushroomRisotto_20-_200494_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut the maitake, cremini and oyster mushrooms into bite-sized pieces. Pick the thyme leaves off the stems; discard the stems. Peel and mince the garlic. Trim off and discard the root end and upper, dark-green leaves of the leek. Halve the leek lengthwise; thoroughly rinse the layers under cold water, keeping them as intact as possible. Small dice the leek. Cut the chives into &frac14;-inch pieces. In a medium bowl, combine the dried porcini mushrooms and 4 cups of hot water. Let stand for at least 10 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5730\/20150911-1618-157-1636\/2P_090915_3_MixedMushroomRisotto_20-_200495_high_feature.jpg","title":" Brown the maitake, cremini &amp; oyster mushrooms:\u2028   ","desc":" In a large, high-sided pan (or pot), heat 2 teaspoons of olive oil on medium-high until hot. Add the maitake, cremini and oyster mushrooms. Cook, stirring occasionally, 5 to 7 minutes, or until golden brown and crispy. Add half the thyme. Cook, stirring occasionally, 1 to 2 minutes, or until fragrant. Transfer to a paper towel-lined plate and immediately season with salt and pepper. Set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5731\/20150911-1618-162-2593\/2P_090915_3_MixedMushroomRisotto_20-_200496_high_feature.jpg","title":" Start the risotto:  ","desc":" In the pan used to brown the mushrooms, heat 2 teaspoons of olive oil on medium until hot. Add the garlic, leek and remaining thyme; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Increase the heat to medium-high and stir in the rice. Cook, stirring frequently, 1 to 2 minutes, or until toasted and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5732\/20150911-1618-171-9633\/2P_090915_3_MixedMushroomRisotto_20-_200497_high_feature.jpg","title":" Add the porcini mushrooms &amp; make the broth:  ","desc":" While the vegetables cook, transfer the porcini mushrooms to a cutting board, reserving the bowl of porcini water. Roughly chop the porcini mushrooms and add to the pan with the reserved porcini water; season with salt and pepper. Heat to boiling on high. Once boiling, reduce the heat to medium-high and simmer, stirring frequently, 14 to 16 minutes, or until most of the liquid has been absorbed and the rice is al dente (still slightly firm to the bite). (If the mixture seems dry, add up to &frac14; cup of water to achieve your desired consistency.) Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5733\/20150911-1618-176-4736\/2P_090915_3_MixedMushroomRisotto_20-_200498_high_feature.jpg","title":" Finish the risotto:  ","desc":" Off the heat, add the cheese, butter and ⅔ of the browned maitake, cremini and oyster mushrooms to the pan. Stir to thoroughly combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1352\/recipe_steps\/5734\/20150911-1619-181-8185\/2P_090915_3_MixedMushroomRisotto_20-_200499_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the finished risotto between 2 dishes. Top with the remaining browned maitake, cremini and oyster mushrooms. Garnish with the chives. Enjoy!  "}]}