{"category":"Shellfish","link":"one-pot-shrimp-perloo","thumb":"\/\/media.blueapron.com\/recipes\/1347\/c_main_dish_images\/20150915-1914-80-3731\/2P_091015_2_SouthernShrimpPerloo_20-_200563_high_also_thumb.jpg","title":" One-Pot Shrimp Perloo ","subtitle":"  ","headbg":"\/\/media.blueapron.com\/recipes\/1347\/c_main_dish_images\/20150915-1913-75-7430\/2P_091015_2_SouthernShrimpPerloo_20-_200562_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  665    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the Lowcountry region (the coastal areas of the Carolinas and Georgia), perloo is a beloved rice dish often made with the region&rsquo;s plentiful shellfish. Similar to jambalaya, perloo starts with a flavorful base of rice simmered with tomato, bell pepper, celery, garlic and onion. We&rsquo;re making ours with hearty, absorbent bomba rice&mdash;a Spanish variety traditionally used for paella&mdash;and cooking it risotto-style before stirring in the shrimp right at the end. The heat of the perloo will cook the shrimp, even without a flame, for the perfect, crisp texture. Enjoy, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1347\/ingredient_images\/20151016-1759-22-2052\/F-Southern-Shrimp-Perloo-2P-W_large_feature.png","ingredients":[" 10  Ounces Shrimp "," 1  Cup Bomba Rice "," 1  15-Ounce Can Diced Tomatoes "," 3  Cloves Garlic "," 2  Scallions ","  1  Stalk Celery   "," 1  Green Bell Pepper "," 1  Lemon "," 1  Yellow Onion "," 1  Bunch Parsley "," 1½  Tablespoons Cajun Spice Blend (Smoked Sweet Paprika, Mustard Powder, Onion Powder, Garlic Powder, Dried Oregano, Dried Thyme & Ground Cayenne Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5686\/20150915-2054-39-6578\/2P_091015_2_SouthernShrimpPerloo_20-_200554_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic. Halve the celery lengthwise; slice crosswise into &frac12;-inch-thick pieces. Cut out and discard the stem, ribs and seeds of the bell pepper; medium dice. Peel and small dice the onion. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Quarter and deseed the lemon. Finely chop the parsley leaves and stems.   "},{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5687\/20150915-2055-44-1714\/2P_091015_2_SouthernShrimpPerloo_20-_200555_high_feature.jpg","title":" Start the perloo:  ","desc":" In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the garlic, celery, bell pepper, onion and white bottoms of the scallions; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5688\/20150915-2055-49-8473\/2P_091015_2_SouthernShrimpPerloo_20-_200557_high_feature.jpg","title":" Add the rice:  ","desc":" Add the rice and &frac34; of the spice blend to the pot; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until toasted and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5689\/20150915-2055-59-7401\/2P_091015_2_SouthernShrimpPerloo_20-_200558_high_feature.jpg","title":" Add the tomatoes &amp; water:  ","desc":" Add the diced tomatoes and 3 &frac12; cups of water to the pot; season with salt and pepper. Heat to boiling on high. Once boiling, reduce the heat to medium-low. Simmer, stirring occasionally, 14 to 16 minutes, or until the rice is tender and the mixture has thickened. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5691\/20150915-2055-64-4580\/2P_091015_2_SouthernShrimpPerloo_20-_200559_high_feature.jpg","title":" Add the shrimp &amp; finish the perloo:  ","desc":" While the perloo simmers, pat the shrimp dry with paper towels; season with salt, pepper and the remaining spice blend. Toss to thoroughly coat. Off the heat, add the seasoned shrimp, half the parsley and the juice of all 4 lemon wedges to the pot; stir to thoroughly combine. Let stand 2 to 3 minutes, or until the shrimp are opaque and cooked through. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1347\/recipe_steps\/5692\/20150915-2055-69-9959\/2P_091015_2_SouthernShrimpPerloo_20-_200560_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished perloo between 2 dishes. Garnish with the green tops of the scallions and remaining parsley. Enjoy!  "}]}