{"category":"Fish","link":"pan-seared-cod-with-curried-basmati-rice-english-peas-mint","thumb":"\/\/media.blueapron.com\/recipes\/1182\/c_main_dish_images\/20150508-1912-299-8190\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5247_high_also_thumb.jpg","title":" Pan-Seared Cod ","subtitle":" with Curried Basmati Rice, Snow Peas &amp; Mint ","headbg":"\/\/media.blueapron.com\/recipes\/1182\/c_main_dish_images\/20150508-1912-482-2832\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5246_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re serving this beautifully-seared cod on a bed of incredible rice. Named for the Sanskrit word meaning &ldquo;fragrant,&rdquo; basmati rice is uniquely aromatic&mdash;hence its popularity throughout India and the Middle East, where it has become a staple of many cuisines. To enhance its natural qualities, we&rsquo;re currying the rice, or cooking it with traditional aromatics and spices. It&rsquo;s a delightfully fluffy and flavorful addition to this dish. ","ingbg":"\/\/media.blueapron.com\/recipes\/1182\/ingredient_images\/20150526-1833-1966-8339\/pan-seared-cod-curried-basmati-2p-w_large_feature.png","ingredients":[" 2  Cod Fillets "," ¾  Cup White Basmati Rice "," 6  Ounces Snow Peas "," 1  Lime "," 1  Red Onion "," 1  Bunch Mint ","  1  Large Bunch Cilantro   ","  2  Tablespoons Ghee   "," 1  1-Inch Piece Ginger "," 2  Teaspoons Curried Rice Spice Blend (Madras Curry Powder, Cumin Seeds, Brown Mustard Seeds, Fennel Seeds, Nigella Seeds & Fenugreek Seeds) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4800\/20150508-2056-128-9468\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5240_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Snap off the stem of each snow pea and pull off the tough string that runs the length of the pod. Halve each pod on an angle. Using a peeler, remove the green rind of the lime, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Peel and small dice the onion. Pick the cilantro and mint leaves off the stems; discard the stems. Peel and mince the ginger.  "},{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4801\/20150508-2056-142-2791\/2P_040815_3_20Pan-Seared_20Cod_20with_20Curried_20Basmati_20Rice_20-_203372_high_feature.jpg","title":" Cook the aromatics:  ","desc":" In a medium pot, heat half the ghee on medium-high until hot. Add half the onion, half the ginger and the spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant.   "},{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4802\/20150508-2057-139-2039\/2P_040815_3_20Pan-Seared_20Cod_20with_20Curried_20Basmati_20Rice_20-_203375_high_feature.jpg","title":" Add the rice:  ","desc":" Add the rice and 1&frac12; cups of water to the pot of aromatics; heat to boiling on high. Once boiling, reduce the heat to low. Cover and simmer 14 to 16 minutes, or until the liquid has been absorbed. Remove from heat and fluff the finished rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4803\/20150508-2057-153-6215\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5242_high_feature.jpg","title":" Cook the snow peas:  ","desc":" While the rice cooks, in a medium pan (nonstick, if you have one), heat the remaining ghee on medium-high until hot. Add the remaining onion and ginger; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened and fragrant. Add the snow peas and half the lime zest. Cook, stirring occasionally, 1 to 2 minutes, or until the peas are bright green. Transfer to a bowl and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4804\/20150508-2057-150-7617\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5243_high_feature.jpg","title":" Cook the cod:  ","desc":" Pat the cod fillets dry with paper towels; season with salt, pepper and the remaining lime zest on both sides. In the pan used to cook the peas, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned fillets and cook 3 to 4 minutes per side, or until cooked through. Remove from heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/1182\/recipe_steps\/4805\/20150508-2057-164-0737\/2P_040815_3_20R050815_20Cod_20Curry_20Rice_20Snow_20Peas-5244_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Add the mint (roughly chopping just before adding) and the juice of 2 lime wedges to the bowl of cooked snow peas; toss to thoroughly combine. Divide the cooked rice and finished snow peas between 2 dishes. Top with the cod fillets and the juice of the remaining lime wedges. Garnish with the cilantro. Enjoy!  "}]}