{"category":"Pork","link":"pork-chops-fall-vegetable-hash-with-wild-rice","thumb":"\/\/media.blueapron.com\/recipes\/1366\/c_main_dish_images\/20150901-1916-53-2272\/FP_082615_3_SearedPorkChops_20-_204594_high_also_thumb.jpg","title":" Pork Chops &amp; Fall Vegetable Hash ","subtitle":" with Wild Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1366\/c_main_dish_images\/20150901-1915-43-3166\/FP_082615_3_SearedPorkChops_20-_204593_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Brussels sprouts, just coming into season with the cooler weather, are a magnificent vegetable. The buds resemble miniature heads of cabbage, which they&rsquo;re related to&mdash;but their earthy taste and crunchy texture are unique. Here, we&rsquo;re saut&eacute;ing Brussels sprouts with onion, sweet potato and apple (tossed with a little apple cider vinegar), bringing together fall&rsquo;s delicious flavors in a wholesome hash. Along with nutty wild rice, it makes savory, saucy pork chops all the more satisfying. ","ingbg":"\/\/media.blueapron.com\/recipes\/1366\/ingredient_images\/20150929-1603-22-3340\/FM-Seared-Pork-Chops-F-W_large_feature.png","ingredients":[" 4  Boneless, Center-Cut Pork Chops "," ¾  Cup Wild Rice Blend "," 6  Ounces Brussels Sprouts "," 1  Apple "," 1  Red Onion "," 1  Sweet Potato "," 4  Tablespoons Butter "," 3  Tablespoons Pork Demi-Glace "," 1  Tablespoon Apple Cider Vinegar ","  1  Tablespoon Seared Pork Spice Blend (Whole Yellow Mustard Seeds, Sweet Paprika, Thyme, Oregano & Ground Fennel Seeds)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5831\/20150904-1856-45-0553\/FP_082615_3_SearedPorkChops_20-_204587_high_feature.jpg","title":" Cook the rice:  ","desc":" Heat a medium pot of salted water to boiling on high. Once boiling, add the rice. Cook 25 to 27 minutes, or until tender. Drain thoroughly and return to the pot. Off the heat, stir in half the butter until melted and thoroughly combined; season with salt and pepper to taste. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5830\/20150904-1856-50-4349\/FP_082615_3_SearedPorkChops_20-_204583_20EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Peel and medium dice the sweet potato. Cut off and discard the stem ends of the Brussels sprouts; quarter the Brussels sprouts lengthwise. Peel and medium dice the onion. Peel, core and medium dice the apple; place in a bowl and toss with the vinegar to prevent browning.   "},{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5832\/20150904-1856-55-9617\/FP_082615_3_SearedPorkChops_20-_204584_high_feature.jpg","title":" Start the hash:  ","desc":" While the rice continues to cook, in a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the sweet potato; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until lightly browned and slightly tender when pierced with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5833\/20150904-1856-65-9078\/FP_082615_3_SearedPorkChops_20-_204585_high_feature.jpg","title":" Finish the hash:  ","desc":" Add the Brussels sprouts and onion to the pan of sweet potato; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the onion has softened. Add the apple. Cook, stirring occasionally, 2 to 4 minutes, or until the Brussels sprouts are lightly browned and softened; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5834\/20150904-1856-70-2078\/FP_082615_3_SearedPorkChops_20-_204586_high_feature.jpg","title":" Cook the pork chops:  ","desc":" Pat the pork chops dry with paper towels; season on both sides with salt, pepper and the spice blend. In the pan used to make the hash, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned pork chops. Cook 3 to 4 minutes per side, or until browned and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan. Loosely cover the cooked pork chops with aluminum foil and set aside in warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1366\/recipe_steps\/5835\/20150904-1856-75-7017\/FP_082615_3_SearedPorkChops_20-_204589_high_feature.jpg","title":" Make the pan sauce &amp; serve your dish:  ","desc":" To the pan of reserved fond, add the demi-glace, remaining butter and &frac14; cup of water. Cook on medium, stirring frequently and scraping up any fond from the bottom of the pan, 1 to 2 minutes, or until thoroughly combined and slightly reduced in volume. Remove from heat and season with salt and pepper to taste. Divide the cooked rice, finished hash and cooked pork chops between 4 plates. Top each with a spoonful of the pan sauce. Enjoy!  "}]}