{"category":"Pork","link":"pork-tsukune-ramen-with-baby-bok-choy-sweet-dumpling-squash","thumb":"\/\/media.blueapron.com\/recipes\/1380\/c_main_dish_images\/20150923-1811-14-9105\/FP_091715_2_20Tsukune_20Squash_20Ramen-4137_high_also_thumb.jpg","title":" Pork Tsukune Ramen ","subtitle":" with Baby Bok Choy &amp; Sweet Dumpling Squash ","headbg":"\/\/media.blueapron.com\/recipes\/1380\/c_main_dish_images\/20150923-1811-46-3706\/FP_091715_2_20Tsukune_20Squash_20Ramen-4136_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" One of the most exciting things about ramen is its incredible versatility. The soft, springy noodles and flavorful broth are fixtures of the traditional Japanese dish&mdash;but when it comes to the rest of the ingredients, nearly anything goes! We&rsquo;re making our ramen with authentically seasoned pork tsukune (or meatballs), as well as baby bok choy and sweet dumpling squash, a delicate variety that ripens as temperatures drop. A garnish of crunchy Asian pear completes the deliciously hearty soup. Happy slurping, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1380\/ingredient_images\/20151020-1939-118-2791\/FM-Tsukune-Squash-Ramen-F-W_large_feature.png","ingredients":[" 1⅛  Pounds Ground Pork "," 1½  Pounds Fresh Ramen Noodles "," 6  Ounces Baby Bok Choy "," 3  Scallions ","  1  Asian Pear   "," 1  Sweet Dumpling Squash "," 1  1-Inch Piece Ginger "," ¼  Cup Panko Breadcrumbs "," ¼  Cup Soy Glaze ","  ¼  Cup White Miso Paste   "," 2  Teaspoons Ramen Spice Blend (Black Sesame Seeds, White Sesame Seeds, Ground Sansho Pepper & Kibbled Nori) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5892\/20150924-2035-14-8334\/FP_091715_2_20Tsukune_20Squash_20Ramen-4127_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut off and discard both ends of the squash. Halve the squash lengthwise; remove and discard the pulp and seeds, then cut crosswise into &frac14;-inch-thick pieces. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops. Peel and mince the ginger. Cut off and discard the root ends of the bok choy; separate the leaves. Core the pear and cut into thin sticks.  "},{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5893\/20150924-2035-19-6029\/FP_091715_2_20Tsukune_20Squash_20Ramen-4128_high_feature.jpg","title":" Roast the squash:  ","desc":" Place the squash on a sheet pan. Drizzle with oil and season with salt and pepper; toss to thoroughly coat. Arrange the seasoned squash in a single, even layer. Roast 18 to 20 minutes, or until tender when pierced with a fork. Remove from the oven and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5894\/20150924-2105-23-0803\/FP_091715_2_20Tsukune_20Squash_20Ramen-4129_20EDIT_high_feature.jpg","title":" Form &amp; cook the meatballs:  ","desc":" While the squash roasts, in a large bowl, combine the ground pork, breadcrumbs, half the ginger, half the white bottoms of the scallions and all but a pinch of the spice blend; season with salt and pepper. Gently mix to combine. Using your hands, form into 24 equal-sized meatballs. In a large, high-sided pan (or pot), heat 1 tablespoon of oil on medium-high until hot. Add the meatballs; loosely cover the pan with foil. Cook, turning occasionally, 6 to 8 minutes, or until browned on all sides and cooked through.  "},{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5902\/20150924-2035-33-0795\/FP_091715_2_20Tsukune_20Squash_20Ramen-4139_high_feature.jpg","title":" Make the sauce:  ","desc":" While the meatballs cook, in a small bowl, combine the miso paste, soy glaze and &frac12; cup of warm water. Whisk until smooth.  "},{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5904\/20150924-2105-28-8960\/FP_091715_2_20Tsukune_20Squash_20Ramen-4130_20EDIT_high_feature.jpg","title":" Make the vegetable broth:  ","desc":" While the squash continues to roast, add the remaining ginger and white bottoms of the scallions to the pan of meatballs. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Add the bok choy, sauce and 3 &frac12; cups of water. Simmer, stirring occasionally, 4 to 6 minutes, or until thoroughly combined and the bok choy has wilted. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1380\/recipe_steps\/5905\/20150924-2035-52-3176\/FP_091715_2_20Tsukune_20Squash_20Ramen-4131_high_feature.jpg","title":" Cook the noodles &amp; serve your dish:  ","desc":" Add the noodles to the pot of boiling water, stirring gently to separate. Cook, stirring occasionally, 2 to 3 minutes, or until tender. Drain thoroughly and rinse under warm water to prevent sticking. Divide the cooked noodles, vegetable broth, cooked meatballs and roasted squash between 4 bowls. Garnish with the pear, green tops of the scallions and remaining spice blend. Enjoy!  "}]}