{"category":"Pork","link":"pork-hominy-pozole-with-avocado-crispy-tortilla-strips","thumb":"\/\/media.blueapron.com\/recipes\/1063\/c_main_dish_images\/20150212-2212-15715-9179\/FP_012115_4_20Pork_20Pozole--2_high_also_thumb.jpg","title":" Pork &amp; Hominy Pozole ","subtitle":" with Avocado &amp; Crispy Tortilla Strips ","headbg":"\/\/media.blueapron.com\/recipes\/1063\/c_main_dish_images\/20150212-2212-9153-8765\/FP_012115_4_20Pork_20Pozole--3_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" At the heart of pozole, a traditional Mexican soup, is hominy&mdash;an ancient preparation of maize with a unique texture. Hominy is maize treated with natural minerals in a process that unlocks its flavors and puffs it up to several times its original size. When simmered in the broth for pozole, it&rsquo;s incredibly tender and delicious. We&rsquo;re serving our version of the soup with an array of toppings, so you can customize it yourself: crunchy, homemade tortilla strips, lime, creamy avocado and crumbly queso fresco (a Mexican favorite). ","ingbg":"\/\/media.blueapron.com\/recipes\/1063\/ingredient_images\/20150220-2019-3528-6344\/pork-pozole-fp-w3_large_feature.png","ingredients":[" 1  Pound Ground Pork "," 4  Corn Tortillas ","  1  14.5-Ounce Can Hominy   "," 1  28-Ounce Can Whole Peeled Tomatoes "," 3  Cloves Garlic "," 2  Limes "," 1  Avocado "," 1  Red Onion "," ½  Bunch Kale "," 1  Large Bunch Cilantro "," 2  Ounces Queso Fresco "," 1½  Tablespoons Pozole Spice Blend (Chipotle Powder, Ground Cumin, Mexican Oregano, Smoked Paprika, Cocoa Powder & Ground Cinnamon) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3967\/20150220-1917-21110-6753\/FP_011215_4-Pork-Pozole-8340-EDIT_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Stack the tortillas; cut them in half, then into thin strips. Drain and rinse the hominy. Place the tomatoes in a bowl; using your hands, gently break the tomatoes apart. Peel and thinly slice the garlic. Peel and thinly slice the onion. Remove and discard the kale stems; roughly chop the leaves. Crumble the queso fresco. Pick the cilantro leaves off the stems; discard the stems. Quarter the limes. Pit, peel and medium dice the avocado; toss with the juice of 2 lime wedges.  "},{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3968\/20150212-2224-16576-5643\/FP_012115_4_20Pork_20Pozole-8341_high_feature.jpg","title":" Cook the pork:  ","desc":" In a large pot, heat 1 tablespoon of olive oil on medium-high until hot. Add the ground pork; season with salt and pepper. Cook, stirring frequently and breaking the meat apart with a spoon, 4 to 6 minutes, or until browned and cooked through. Transfer to a bowl and set aside. Carefully drain off and discard the drippings, leaving any browned bits (or fond) in the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3969\/20150212-2224-16591-2834\/FP_012115_4_20Pork_20Pozole-8342_high_feature.jpg","title":" Cook the aromatics:  ","desc":" Add 1 tablespoon of olive oil to the pot of reserved fond and heat on medium until hot. Add the garlic, onion and spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3970\/20150212-2224-16622-7822\/FP_012115_4_20Pork_20Pozole-8343_high_feature.jpg","title":" Add the kale:  ","desc":" Add the kale to the pot of aromatics. Stir to combine and season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until wilted. Add 1 cup of water; cook, scraping up any browned bits from the bottom of the pot with a spoon, 1 to 2 minutes, or until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3971\/20150212-2225-16629-3473\/FP_012115_4_20Pork_20Pozole-8345_high_feature.jpg","title":" Finish the soup:  ","desc":" Add the hominy, tomatoes, cooked pork and 1 cup of water to the pot of aromatics and kale; season with salt and pepper. Heat to boiling on high. Once boiling, reduce the heat to medium and simmer, stirring occasionally, 6 to 8 minutes, or until slightly reduced in volume. Remove from heat; stir in the juice of 2 lime wedges and season with salt and pepper to taste. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1063\/recipe_steps\/3972\/20150212-2225-9922-7379\/FP_012115_4_20Pork_20Pozole-8344_high_feature.jpg","title":" Toast the tortilla soup &amp; serve your dish:  ","desc":" While the soup cooks, place the tortilla strips on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in a single, even layer and toast 9 to 11 minutes, or until golden brown and crispy. Transfer to a serving dish. Serve the finished soup with the crispy tortilla strips, avocado, cilantro, queso fresco and remaining lime wedges on the side. Enjoy!  "}]}