{"category":"Beef","link":"rice-beef-stuffed-poblano-peppers-with-lime-crema-sauce","thumb":"\/\/media.blueapron.com\/recipes\/418\/c_main_dish_images\/20150615-2200-1105-6868\/Beef_20Stuffed_20Poblanos-6857_high_also_thumb.jpg","title":" Rice &amp; Beef-Stuffed Poblano Peppers ","subtitle":" with Lime-Crema Sauce ","headbg":"\/\/media.blueapron.com\/recipes\/418\/c_main_dish_images\/20150615-2159-1089-8763\/Beef_20Stuffed_20Poblanos-6856_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  625    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" The poblano pepper (named after the Mexican state of Puebla) is a relatively large, mild variety of chile popular in Mexican cuisine. Combining complex sweetness and subtle heat, the poblano is amazingly versatile. When roasted, its skin softens, blistering and taking on notes of smokiness. But the pepper also retains its shape, making it a wonderful choice for stuffing and finishing in the oven. Here, we&rsquo;re doing just that, using a hearty beef and rice filling&mdash;perfectly complemented by tart, lime-seasoned Mexican crema. ","ingbg":"\/\/media.blueapron.com\/recipes\/418\/ingredient_images\/20150626-1948-3030-7736\/beef-stuffed-poblanos-ing-w_large_feature.png","ingredients":[" 8  Ounces Ground Beef "," ½  Cup Long Grain White Rice "," 3  Cloves Garlic "," 2  Poblano Peppers "," 1  Lime "," 1  Yellow Onion "," 1  Bunch Cilantro "," 3  Tablespoons Dried Zante Currants "," 3  Tablespoons Roasted Pepitas "," 2  Tablespoons Tomato Paste "," 2  Teaspoons Ground Cumin "," ¼  Cup Mexican Crema "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2789\/05633a5b-20f8-41ac-ba1f-4f92bc80b162\/step1_high_feature.jpg","title":" Cook the rice:  ","desc":" In a small pot, combine the rice, 1 cup of water and a big pinch of salt. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 14 to 16 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat. Fluff the cooked rice with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2790\/78149552-42d9-474a-ad23-0051680ba72f\/step2_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, preheat the oven to 500&deg;F. Wash and dry the fresh produce. Peel and mince the garlic. Peel and small dice the onion. Pick the cilantro leaves off the stems; discard the stems. Quarter the lime.  "},{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2791\/68dfe77b-03f9-41cd-8a66-ff3480a1e63a\/step3_high_feature.jpg","title":" Roast &amp; prepare the poblano peppers:  ","desc":" Place the poblano peppers on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Roast in the oven 5 to 7 minutes, or until the skin is browned and blistered. Remove from the oven and set aside to cool, leaving the oven on. When cool enough to handle, make a lengthwise slit in each poblano pepper. Using your hands, carefully open each poblano pepper; remove and discard the ribs and seeds. Immediately wash your hands after handling.  "},{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2792\/355e7489-370b-4081-a5ff-6c91853a8463\/step4_high_feature.jpg","title":" Make the filling:  ","desc":" While the poblano peppers cool, in a large pan, heat 2 teaspoons of olive oil on medium until hot. Add the garlic and onion. Cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Stir in the tomato paste and cumin. Cook, stirring frequently, 2 to 3 minutes, or until toasted and fragrant. Increase the heat to medium-high. Add the ground beef and season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 2 to 4 minutes, or until browned and cooked through. Stir in the currants, pepitas, cooked rice and &frac14; cup of water. Cook, stirring occasionally, 1 to 2 minutes, or until well combined; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2793\/b64b86ba-22f0-46e8-a58b-850e5bcc41ba\/step5_high_feature.jpg","title":" Stuff &amp; bake the poblano peppers:  ","desc":" Stuff each prepared poblano pepper with as much of the filling as possible (you may have extra filling). Bake 4 to 6 minutes, or until heated through. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/418\/recipe_steps\/2794\/11cc9da8-bb28-44dc-9435-d8e7a4a21795\/step6_high_feature.jpg","title":" Make the lime-crema sauce &amp; plate your dish:  ","desc":" While the stuffed poblano peppers bake, in a small bowl, combine the Mexican crema, the juice of 2 lime wedges, half the cilantro and 1 tablespoon of water. Season with salt and pepper to taste. Divide the finished poblano peppers and any remaining filling between 2 plates. Top with the lime-crema sauce. Garnish with the remaining cilantro and lime wedges. Enjoy!  "}]}