{"category":"Vegetarian","link":"roasted-spaghetti-squash-with-chunky-marinara-sauce-black-cerignola-olives","thumb":"\/\/media.blueapron.com\/recipes\/345\/c_main_dish_images\/20150917-1907-103-6619\/forcard_high_also_thumb.jpg","title":" Roasted Spaghetti Squash ","subtitle":" with Marinara Sauce &amp; Black Cerignola Olives ","headbg":"\/\/media.blueapron.com\/recipes\/345\/c_main_dish_images\/20140808-2031-276-4742\/forcard_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  565    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" A cold-weather variety, spaghetti squash is known for its unique flesh. Once cooked, it can be pulled apart into delicately sweet, spaghetti-like strands. The thin golden &ldquo;noodles&rdquo; (you can even twirl them with a fork!) have a tender bite. They make a light base for a flavorful sauce of bright tomatoes, briny Cerignola olives, cremini mushrooms and nutty Parmesan. The result is a delicious, seasonal twist on the classic spaghetti and marinara. ","ingbg":"\/\/media.blueapron.com\/recipes\/345\/ingredient_images\/20150917-1907-94-2338\/spaghetti-squash-with-marinara-2P-W_large_feature.png","ingredients":[" 4  Ounces Cremini Mushrooms "," 2  Ounces Black Cerignola Olives "," 4  Cloves Garlic "," 1  Bunch Fresh Oregano "," 1  Yellow Onion "," 1  Spaghetti Squash "," 1  15-Ounce Can Diced Tomatoes "," ⅔  Cup Grated Parmesan Cheese "," 4  Tablespoons Butter "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2055\/20140723-2007-4890-5038\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Using a sharp, sturdy knife, carefully halve the squash lengthwise. Cut off and discard the mushroom stems; medium dice the caps. Peel and mince the garlic. Peel and small dice the onion. Pick the oregano leaves off the stems; discard the stems and roughly chop the leaves. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop.  "},{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2056\/20140723-2008-4896-9728\/step2_high_feature.jpg","title":" Roast the squash:  ","desc":" Place the squash halves on a high-sided sheet pan (or baking dish). Drizzle the cut sides with olive oil and season with salt and pepper. Arrange the squash halves cut sides down and drizzle the skin sides with olive oil. Fill the pan with &frac14; inch of water. Roast 28 to 32 minutes, or until the cut sides are tender when pierced with a knife. Remove from the oven and set aside to cool.  "},{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2057\/20140723-2008-3102-2082\/step3_high_feature.jpg","title":" Make the sauce:  ","desc":" While the squash roasts, in a medium pot, heat 2 teaspoons of olive oil on medium until hot. Add the onion, garlic and mushrooms; season with salt and pepper. Cook, stirring occasionally, 6 to 8 minutes, or until softened. Add the diced tomatoes; season with salt and pepper. Cook, stirring occasionally, 10 to 12 minutes, or until slightly thickened. Turn off the heat and stir in half the oregano. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2058\/20140723-2008-4902-4737\/step4_high_feature.jpg","title":" Break the squash into strands:  ","desc":" Once the roasted squash is cool enough to handle, using a large spoon, scrape out and discard the seeds and pulp. Gently scoop the flesh out of the skin in one large piece. Transfer to a large bowl. Using your hands, gently break the flesh into long, thin strands. (The result should resemble cooked spaghetti. )  "},{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2059\/20140723-2008-4908-1588\/step5_high_feature.jpg","title":" Finish the squash:  ","desc":" In a large pan, heat the butter and 3 tablespoons of water on medium heat until the butter has melted. Add the squash strands; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the water has evaporated. Stir in half the cheese and cook 30 seconds to 1 minute, or until thoroughly combined. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/345\/recipe_steps\/2060\/20140723-2008-3108-6712\/step6_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the finished squash between 2 dishes. Top with the sauce and olives. Garnish with the remaining cheese and oregano. Enjoy!  "}]}