{"category":"Fish","link":"salmon-burgers-with-creamy-english-pea-sauce-potato-salad","thumb":"\/\/media.blueapron.com\/recipes\/1191\/c_main_dish_images\/20150513-1801-68-8589\/2P_033115_5_20R051215_20Salmon_20Burger_20Potato_20Salad-5286_high_also_thumb.jpg","title":" Salmon Burgers ","subtitle":" with Crème Fraîche Sauce, Arugula &amp; Potato Salad  ","headbg":"\/\/media.blueapron.com\/recipes\/1191\/c_main_dish_images\/20150513-1810-324-5441\/2P_033115_5_20R051215_20Salmon_20Burger_20Potato_20Salad-5285_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" As summer approaches and the weather heats up, sometimes we prefer a lighter take on the burger. In this recipe for wholesome salmon burgers, you&rsquo;ll roast a salmon fillet, mix it with breadcrumbs and aromatics then sear the patties on the stove. We&rsquo;re also topping them with a unique take on classic tartar sauce (a mayonnaise-based condiment usually served with seafood). Instead of mayo, we&rsquo;re using cr&egrave;me fra&icirc;che as the base and adding shallot, mint and lemon juice to give these burgers a zesty kick. ","ingbg":"\/\/media.blueapron.com\/recipes\/1191\/ingredient_images\/20150602-1739-947-0509\/salmon-burgers-w-potato-salad-2p-w_large_feature.png","ingredients":[" 1  8-Ounce, Skin-On Salmon Fillet "," 2  Potato Buns "," 2  Cloves Garlic "," 1  Lemon "," ½  Pound Red Potatoes "," 1  Ounce Arugula "," 1  Bunch Mint ","  2  Tablespoons Capers   "," 1  Shallot ","  ⅓  Cup Crème Fraîche   "," ¼  Cup Breadcrumbs "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4824\/20150513-1804-113-1694\/2P_033115_5_20Salmon_20Burgers_20with_20Potato_20Salad_20-_202698_high_feature.jpg","title":" Roast &amp; flake the salmon:  ","desc":" Preheat the oven to 450&deg;F. Place a large piece of foil on a sheet pan. Place the salmon on the foil, skin side down; drizzle with olive oil and season with salt and pepper. Roast in the oven 12 to 14 minutes, or until lightly browned on top. Using a spatula, carefully lift the roasted salmon off its skin; transfer to a large bowl and discard the skin. Using a fork, flake the roasted salmon into small pieces. When the salmon has cooled, drain off and discard any liquid from the bowl.  "},{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4825\/20150513-1804-124-3629\/2P_033115_5_20R051215_20Salmon_20Burger_20Potato_20Salad-5280_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the salmon roasts, wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Halve the buns. Peel and mince the garlic. Cut the potatoes into bite-sized pieces. Pick the mint off the stems; discard the stems. Roughly chop the capers. Using a peeler, remove the rind of the lemon, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the juice of all 4 lemon wedges and season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4826\/20150513-1804-135-4231\/2P_033115_5_20R051215_20Salmon_20Burger_20Potato_20Salad-5281_high_feature.jpg","title":" Make the crème fraîche sauce:   ","desc":" While the salmon continues to roast, in a medium bowl, combine the cr&egrave;me fra&icirc;che, shallot-lemon juice mixture and half the mint (roughly chopping just before adding); season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4827\/20150513-1805-146-8705\/2P_033115_5_20Salmon_20Burgers_20with_20Potato_20Salad_20-_202702_high_feature.jpg","title":" Make the potato salad:  ","desc":" Add the potatoes to the pot of boiling water. Cook 11 to 13 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, add the capers and half the cr&egrave;me fra&icirc;che sauce; stir to combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4828\/20150513-1805-157-8560\/2P_033115_5_20Salmon_20Burgers_20with_20Potato_20Salad_20-_202703_high_feature.jpg","title":" Form &amp; cook the patties:  ","desc":" While the potatoes cook, to the bowl of flaked salmon, add the breadcrumbs, garlic, lemon zest and remaining mint (roughly chopping just before adding); season with salt and pepper. Gently mix to combine. Form the mixture into two &frac34;-inch-thick patties, squeezing firmly to ensure that the patties are tightly packed. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the patties and cook 2 to 3 minutes per side, or until golden brown and cooked through. Transfer to a paper towel-lined plate. Carefully wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1191\/recipe_steps\/4829\/20150513-1805-168-4258\/2P_033115_5_20Salmon_20Burgers_20with_20Potato_20Salad_20-_202704_high_feature.jpg","title":" Toast the buns &amp; plate your dish:  ","desc":" In the pan used to cook the patties, heat 2 teaspoons of olive oil on medium until hot. Add the buns, cut sides down, and toast 2 to 3 minutes, or until golden brown. Transfer to a clean, dry work surface. Place the arugula in a medium bowl; drizzle with olive oil and toss to coat. Season with salt and pepper to taste. Top each toasted bun bottom with a cooked patty, half the remaining cr&egrave;me fra&icirc;che sauce, a pinch of the dressed arugula and a toasted bun top. Serve with the potato salad and remaining dressed arugula on the side. Enjoy!  "}]}