{"category":"Beef","link":"seared-steaks-with-sauteed-radishes-snap-peas-and-mashed-potatoes","thumb":"\/\/media.blueapron.com\/recipes\/1195\/c_main_dish_images\/20150522-1639-13776-6627\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204585_high_also_thumb.jpg","title":" Seared Steaks &amp; Mashed Potatoes ","subtitle":" with Sautéed Radishes &amp; Snap Peas ","headbg":"\/\/media.blueapron.com\/recipes\/1195\/c_main_dish_images\/20150522-1638-13762-0811\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204583_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Radishes may be known best for their peppery bite, but there&rsquo;s another, gentler side to these incredible root vegetables. When cooked, they transform beautifully, mellowing in both flavor and texture. Here, we&rsquo;re saut&eacute;ing our radishes with snap peas, turning them crispy on the outside and tender within&mdash;and wonderfully, delicately sweet all over. With juicy steaks and creamy mashed potatoes, this dish is a hearty celebration of the season. ","ingbg":"\/\/media.blueapron.com\/recipes\/1195\/ingredient_images\/20150522-1640-13806-2607\/steak-with-mashed-potatoes-2p-w_large_feature.png","ingredients":[" 2  Sirloin Steaks "," ¾  Pound Yukon Gold Potatoes "," 6  Ounces Sugar Snap Peas "," 2  Cloves Garlic "," 1  Lemon "," 3  Ounces Radishes "," 1  Bunch Tarragon "," 4  Tablespoons Butter "," 1  Shallot "," 1  Teaspoon Coarsely Ground Black Pepper "," ¼  Cup Heavy Cream "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4873\/20150522-1646-13891-0229\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204553_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a small pot of salted water to boiling on high. Peel and thinly slice the garlic. Pick the tarragon off the stems; discard the stems and finely chop the leaves. Peel and mince the shallot. Large dice the potatoes. Cut the radishes into wedges. Trim off and discard the ends of the snap peas; pull off and discard the string that runs the length of each pod. Using a peeler, remove the rind of the lemon, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4874\/20150522-1646-13902-7257\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204557_high_feature.jpg","title":" Cook &amp; mash the potatoes:  ","desc":" Add the potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add the heavy cream and &frac14; of the butter; using a fork, mash to your desired consistency. Season with salt and pepper to taste and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4875\/20150522-1647-13917-7920\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204555_high_feature.jpg","title":" Cook the radishes &amp; snap peas:  ","desc":" While the potatoes cook, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the radishes and season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until browned and slightly softened. Add the snap peas and garlic. Cook, stirring occasionally, 1 to 3 minutes, or until the snap peas are bright green and the garlic is fragrant; season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4876\/20150522-1647-13928-3436\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204556_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the potatoes continue to cook, pat the steaks dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the radishes and snap peas, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned steaks and cook 3 to 5 minutes per side for medium-rare, or until cooked to your desired degree of doneness. Transfer to a plate or cutting board, leaving any browned bits (or fond) in the pan. Let the cooked steaks rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4877\/20150522-1647-13943-5283\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204558_high_feature.jpg","title":" Make the lemon-black pepper sauce:  ","desc":" Add the shallot to the pan of reserved fond. Cook on medium, stirring frequently, 1 to 2 minutes, or until softened. Add the lemon zest, remaining butter, half the tarragon, the juice of all 4 lemon wedges, 2 tablespoons of water and as much of the coarsely ground black pepper as you&rsquo;d like. Cook, stirring frequently, 1 to 2 minutes, or until thickened. Season with salt and pepper to taste and remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1195\/recipe_steps\/4878\/20150522-1647-13954-2346\/2P_112114_4_20Steak_20with_20Sauteed_20Radish_20__20Radish_20Greens_20-_204577_high_feature.jpg","title":" Plate your dish:  ","desc":" Find the lines of muscle (or grain) of the rested steaks; thinly slice crosswise against the grain. Add any juices from the sliced steaks to the cooked radishes and snap peas; stir to combine. Divide the sliced steaks, mashed potatoes and cooked radishes and snap peas between 2 plates. Serve each with a few spoonfuls of the lemon-black pepper sauce. Garnish with the remaining tarragon. Enjoy!  "}]}