{"category":"Beef","link":"seared-steaks-with-cheesy-mashed-potatoes-honey-glazed-carrots","thumb":"\/\/media.blueapron.com\/recipes\/1360\/c_main_dish_images\/20151007-1951-32-1619\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206642_high_also_thumb.jpg","title":" Beef Stew &amp; Cheesy Mashed Potatoes ","subtitle":" with Carrots &amp; Thyme  ","headbg":"\/\/media.blueapron.com\/recipes\/1360\/c_main_dish_images\/20151007-1950-18-7536\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206641_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Chefs, the cooler weather is upon us&mdash;so for dinner tonight, we&rsquo;re filling our bowls with deliciously hearty beef stew. Our flavorful broth (simmered with spices, tomato and beef demi-glace, for exquisite richness) is brimming with beef and carrots, one of our favorite seasonal vegetables. We&rsquo;re scooping savory, cheddar-infused mashed potatoes right on top, then finishing the stew with a garnish of fresh herbs. Classic comfort food doesn&rsquo;t get more satisfying than this. ","ingbg":"\/\/media.blueapron.com\/recipes\/1360\/ingredient_images\/20151007-1952-37-6854\/FM-Steak-Cheesey-Mashed-Potatoes-F-W_large_feature.png","ingredients":[" 4  Top Round Steaks "," 2  Ounces Cheddar Cheese "," 3  Carrots "," 1½  Pounds Yukon Gold Potatoes "," 1  Bunch Parsley "," 1  Bunch Thyme "," 4  Tablespoons Butter "," 3  Tablespoons Beef Demi-Glace "," 2  Tablespoons Tomato Paste ","  2  Tablespoons Crème Fraîche   "," 3  Tablespoons Beef Stew Spice Blend (All-Purpose Flour, Garlic Powder, Yellow Mustard Powder & Sweet Paprika) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5723\/20151007-1954-69-4863\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206629_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and small dice the carrots. Pick the thyme and parsley leaves off the stems; discard the stems and finely chop the leaves, keeping the thyme and parsley separate. Medium dice the potatoes. Grate the cheese. Pat the beef dry with paper towels; chop into small pieces and place in a medium bowl. Thoroughly wash your hands, knife and cutting board after handling the beef.  "},{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5724\/20151012-1550-35-6040\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206630_20EDIT_high_feature.jpg","title":" Brown the beef:   ","desc":" Season the chopped beef with salt, pepper and the spice blend; toss to thoroughly coat. In a large, high-sided pan (or pot), heat 1 tablespoon of oil on high until hot. Add the seasoned beef. Cook, stirring occasionally, 4 to 6 minutes, or until lightly browned. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5725\/20151007-1955-79-8932\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206631_high_feature.jpg","title":" Start the stew:   ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond and heat on medium-high until hot. Add the tomato paste, carrots and half the thyme; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until fragrant and the carrots are slightly softened. Add the browned beef. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined.  "},{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5726\/20151007-1955-84-2986\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206635_high_feature.jpg","title":" Finish the stew:   ","desc":" Add the demi-glace and 3 cups of water to the pan of carrots and beef; season with salt and pepper. Increase the heat to high and bring to a simmer, scraping up any fond from the bottom of the pan. Once simmering, reduce the heat to medium. Cook, tightly covering the pan with a lid or aluminum foil, 30 to 32 minutes, or until the liquid has reduced in volume by about half and the beef is tender and cooked through. Turn off the heat. Stir in half the butter until thoroughly combined; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5727\/20151007-1955-98-2095\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206632_high_feature.jpg","title":" Cook &amp; mash the potatoes:   ","desc":" While the stew cooks, add the potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, add the cheese, cr&egrave;me fra&icirc;che and remaining butter; season with salt and pepper to taste. Using a fork, mash the mixture to your desired consistency. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1360\/recipe_steps\/5728\/20151007-1955-93-5205\/FP_090915_2_R100615_4_SteakPotatoStew_20-_206637_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished stew between 4 bowls. Top with scoops of the mashed potatoes. Garnish with the parsley and remaining thyme. Enjoy!  "}]}