{"category":"Beef","link":"seared-steaks-roasted-potatoes-with-corn-tomatoes-herbed-creme-fraiche","thumb":"\/\/media.blueapron.com\/recipes\/1330\/c_main_dish_images\/20150820-1959-48-0580\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200765_high_also_thumb.jpg","title":" Seared Steaks &amp; Roasted Potatoes ","subtitle":" with Corn, Tomatoes &amp; Herbed Crème Fraîche  ","headbg":"\/\/media.blueapron.com\/recipes\/1330\/c_main_dish_images\/20150820-1959-31-2979\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200764_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  500    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Though fall is approaching, the fields are still alive and gorgeous with summer produce. We&rsquo;re reveling especially in sweet corn and cherry tomatoes in this gourmet dish. Saut&eacute;ed with garlic and scallions, they make a simply delicious side for juicy, seared steaks and roasted potatoes. To balance the richness of the steaks, we&rsquo;re also serving cr&egrave;me fra&icirc;che&mdash;a delicately flavored, French version of sour cream&mdash;infused with parsley and lemon juice. Let&rsquo;s celebrate summer while the sun shines, chefs! ","ingbg":"\/\/media.blueapron.com\/recipes\/1330\/ingredient_images\/20150914-2021-130-4080\/FP-steak-corn-baby-sweet-potatoes-F-W_large_feature.png","ingredients":[" 4  Bavette Steaks "," 4  Ounces Cherry Tomatoes "," 3  Cloves Garlic "," 2  Scallions "," 2  Ears Of Corn "," 1  Lemon "," 1  Pound Prince Of Orange Potatoes ","  1  Bunch Basil   "," 1  Bunch Parsley "," 2  Tablespoons Butter ","  ⅓  Cup Crème Fraîche   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5601\/20150820-2003-16-8633\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200754_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Halve the potatoes lengthwise. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cobs; discard the cobs. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Halve the tomatoes. Pick the basil leaves off the stems; discard the stems. Finely chop the parsley leaves and stems. Quarter and deseed the lemon.   "},{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5753\/20150820-2003-28-0717\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200758_20EDIT_high_feature.jpg","title":" Roast the potatoes:  ","desc":" Place the potatoes on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer, cut sides down. Roast 25 to 27 minutes, or until tender when pierced with a fork. Remove from the oven and transfer to a large bowl.  "},{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5754\/20150820-2003-40-0266\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200755_high_feature.jpg","title":" Cook the steaks:  ","desc":" While the potatoes roast, pat the steaks dry with paper towels; season with salt and pepper on both sides. In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steaks. Cook 3 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Transfer to a plate, leaving any browned bits (or fond) in the pan. Let the cooked steaks rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5755\/20150820-2004-52-7506\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200757_high_feature.jpg","title":" Cook the corn &amp; tomatoes:  ","desc":" While the steaks rest, add 2 teaspoons of olive oil to the pan of reserved fond. Heat on medium-high until hot. Add the corn, white bottoms of the scallions and half the garlic paste; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the tomatoes and butter; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until the tomatoes have softened. Remove from heat. Stir in the basil (tearing just before adding) and half the parsley; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5756\/20150820-2004-64-8736\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200759_high_feature.jpg","title":" Make the herbed crème fraîche &amp; finish the potatoes:   ","desc":" In a bowl, combine the cr&egrave;me fra&icirc;che, remaining garlic paste and parsley and the juice of 2 lemon wedges; season with salt and pepper to taste. To the bowl of roasted potatoes, add half the green tops of the scallions and the juice of the remaining lemon wedges. Toss to coat; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1330\/recipe_steps\/5757\/20150820-2004-81-3241\/FP_081115_1_SteakCornandBabySweetPotatoes_20-_200760_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the rested steaks and dressed potatoes between 4 plates. Top with the cooked corn and tomatoes. Garnish with the remaining green tops of the scallions. Serve with the seasoned cr&egrave;me fra&icirc;che on the side. Enjoy!  "}]}