{"category":"Pork","link":"seared-pork-chops-with-plum-tomato-salsa-kamut","thumb":"\/\/media.blueapron.com\/recipes\/1282\/c_main_dish_images\/20150715-1720-71-1106\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208318_high_also_thumb.jpg","title":" Seared Pork Chops &amp; Kamut ","subtitle":" with Corn, Spinach &amp; Stone Fruit-Cherry Tomato Salsa ","headbg":"\/\/media.blueapron.com\/recipes\/1282\/c_main_dish_images\/20150715-1719-55-8073\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208317_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  655    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Kamut is an ancient form of large, chewy wheat. It was brought to the U.S. from Egypt in the late 1940s and planted in Montana. After falling into and out of obscurity, the grain was rediscovered in the 1970s. It has increased in popularity ever since, with a new generation of chefs prizing it as a gourmet specialty ingredient. Here, we&rsquo;re mixing kamut with spinach and corn and serving it alongside crispy pork chops. And we&rsquo;re topping the dish with a rich balsamic pan sauce and a sweet-and-savory salsa made with cherry tomatoes and stone fruit. (Depending on what&rsquo;s freshest near you, you&rsquo;ll receive either a delicious plum or a pluot.) ","ingbg":"\/\/media.blueapron.com\/recipes\/1282\/ingredient_images\/20150811-1736-123-3148\/Seared-Pork-Chops-Plum-Salsa-2P-W_large_feature.png","ingredients":[" 2  Boneless, Center-Cut Pork Chops "," ½  Cup Semi-Pearled Kamut "," 4  Ounces Cherry Tomatoes ","  1  Ear Of Corn   "," 2  Scallions "," 1  Summer Stone Fruit "," ½  Pound Spinach "," 1  Bunch Basil "," 2  Tablespoons Balsamic Vinegar ","  1  Tablespoon Butter   "," 2  Teaspoons Seared Pork Spice Blend (Ground Fennel Seed, Dried Whole Thyme, Sweet Paprika & Ground Coriander) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5362\/20150713-2059-290-5664\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208309_high_feature.jpg","title":" Cook the kamut:  ","desc":" Heat a large pot of salted water to boiling on high. Add the kamut. Cook 16 to 18 minutes, or until tender. Turn off the heat. Drain thoroughly and return to the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5363\/20150713-2059-309-5460\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208306_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the kamut cooks, wash and dry the fresh produce. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Pit and small dice the stone fruit. Pick the basil leaves off the stems; discard the stems. Quarter the tomatoes. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Roughly chop the spinach.  "},{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5364\/20150713-2059-320-4297\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208308_high_feature.jpg","title":" Make the salsa:  ","desc":" While the kamut continues to cook, in a medium bowl, combine the stone fruit, tomatoes, basil (tearing the leaves just before adding) and half the green tops of the scallions. Drizzle with olive oil and stir to combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5365\/20150713-2100-331-2149\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208310_high_feature.jpg","title":" Cook the vegetables &amp; finish the kamut:  ","desc":" In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the corn; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until slightly tender. Add the spinach and white bottoms of the scallions; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the spinach is wilted. Transfer to the pot of cooked kamut. Stir in half the vinegar and a drizzle of olive oil; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5366\/20150713-2100-342-1909\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208311_high_feature.jpg","title":" Cook the pork chops:  ","desc":" Pat the pork chops dry with paper towels; season on both sides with salt, pepper and the spice blend. Wipe out the pan used to cook the vegetables; add 2 teaspoons of olive oil and heat on medium-high until hot. Add the seasoned pork chops. Cook 3 to 4 minutes per side, or until browned and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan. Set the cooked pork chops aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1282\/recipe_steps\/5367\/20150713-2100-353-1573\/2P_070715_5_SearedPorkChopsPlumSalsa_20-_208313_high_feature.jpg","title":" Make the pan sauce &amp; plate your dish:  ","desc":" Add the remaining vinegar and &frac14; cup of water to the pan of reserved fond; season with salt and pepper. Cook on medium-high, stirring frequently and scraping up any fond from the bottom of the pan, 1 to 2 minutes, or until the liquid has reduced in volume by half. Turn off the heat. Add the butter; stir to combine and season with salt and pepper to taste. Divide the finished kamut and cooked pork chops between 2 plates. Top with the pan sauce and salsa (you may have extra salsa). Garnish with the remaining green tops of the scallions. Serve with any remaining salsa on the side. Enjoy!  "}]}