{"category":"Fish","link":"seared-salmon-campanelle-pasta-with-roasted-broccoli-lemon-herb-butter","thumb":"\/\/media.blueapron.com\/recipes\/1341\/c_main_dish_images\/20150826-1623-90-5694\/FP_081815_4_SalmonwithCampanelle_20-_201045_high_also_thumb.jpg","title":" Seared Salmon &amp; Campanelle Pasta ","subtitle":" with Roasted Broccoli &amp; Lemon-Herb Butter ","headbg":"\/\/media.blueapron.com\/recipes\/1341\/c_main_dish_images\/20150826-1622-76-5620\/FP_081815_4_SalmonwithCampanelle_20-_201042_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  645    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this recipe, we&rsquo;re serving seared salmon over pasta and broccoli&mdash;with a few special touches. We&rsquo;re combining delightfully ruffled campanelle pasta (whose name means &ldquo;little bells&rdquo; in Italian) with roasted broccoli, which browns and turns lightly crunchy in the oven. Then we&rsquo;re mixing in sliced almonds, Parmesan cheese and lemon-herb butter. Lemon juice, chopped mint and parsley (along with garlic paste) add incredible, fresh flavor to the softened butter, which we&rsquo;re also spooning on top as a garnish. ","ingbg":"\/\/media.blueapron.com\/recipes\/1341\/ingredient_images\/20150917-1543-200-5680\/FF-Salmon-Campanelle-FP-W_large_feature.png","ingredients":[" 4  Skinless Salmon Fillets "," 10  Ounces Campanelle Pasta "," 2  Cloves Garlic "," 1  Lemon "," ¾  Pound Broccoli "," 1  Bunch Parsley "," 1  Bunch Mint ","  4  Tablespoons Butter   "," 2  Tablespoons Sliced Almonds "," ¼  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5910\/20150828-1859-21-1402\/FP_081815_4_SalmonwithCampanelle_20-_201033_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Remove the butter from the refrigerator to soften. Cut the broccoli into bite-sized florets. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Pick the mint and parsley leaves off the stems; discard the stems and finely chop the leaves. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5911\/20150828-1859-27-3014\/FP_081815_4_SalmonwithCampanelle_20-_201037_high_feature.jpg","title":" Roast the broccoli:   ","desc":" Place the broccoli on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer. Roast 20 to 22 minutes, or until browned and tender. Remove from the oven.   "},{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5912\/20150828-1900-38-8005\/FP_081815_4_SalmonwithCampanelle_20-_201035_high_feature.jpg","title":" Make the lemon-herb butter:   ","desc":" While the broccoli roasts, in a small bowl, combine the softened butter, garlic paste, mint, parsley and the juice of all 4 lemon wedges. Using a fork, mash and stir to thoroughly combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5913\/20150828-1900-44-7520\/FP_081815_4_SalmonwithCampanelle_20-_201036_high_feature.jpg","title":" Cook the pasta:  ","desc":" While the broccoli continues to roast, add the pasta to the pot of boiling water. Cook 7 to 9 minutes, or until al dente (still slightly firm to the bite). Turn off the heat. Reserving &frac12; cup of the pasta cooking water, thoroughly drain the cooked pasta. Return to the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5914\/20150828-1903-37-3719\/FP_081815_4_SalmonwithCampanelle_20-_201038_high_feature.jpg","title":" Cook the salmon:   ","desc":" While the pasta cooks, pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned fillets. Cook 3 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1341\/recipe_steps\/5915\/20150828-1900-50-3956\/FP_081815_4_SalmonwithCampanelle_20-_201039_high_feature.jpg","title":" Finish the pasta &amp; serve your dish:   ","desc":" To the pot of cooked pasta, add the roasted broccoli, almonds, cheese, half the lemon-herb butter and half the reserved pasta cooking water; season with salt and pepper. Cook on medium, stirring frequently, 1 to 2 minutes, or until thoroughly combined. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Season with salt and pepper to taste. Divide the finished pasta and cooked salmon fillets between 4 dishes. Garnish each with a spoonful of the remaining lemon-herb butter. Enjoy!   "}]}