{"category":"Fish","link":"seared-wild-king-salmon-with-preserved-lemon-quinoa","thumb":"\/\/media.blueapron.com\/recipes\/6\/c_main_dish_images\/20150528-1527-774-7689\/FINAL_high_also_thumb.jpg","title":" Seared Salmon &amp; Preserved Lemon ","subtitle":" with Red Quinoa &amp; Pea Shoots ","headbg":"\/\/media.blueapron.com\/recipes\/6\/c_main_dish_images\/20150528-1527-789-2985\/FINAL_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  590    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Many North African cuisines use a special ingredient to bring unique flavor to dishes: preserved lemon. It&rsquo;s created by marinating lemon in a briny mixture with sugar, which mellows the bitterness of the pith and accents the lemon&rsquo;s natural flavor. In this recipe, you&rsquo;ll make a quick version of the classic ingredient and serve it with spring vegetables and crispy-skinned salmon for a wholesome meal with bright, incredible flavor. ","ingbg":"\/\/media.blueapron.com\/recipes\/6\/ingredient_images\/20150529-1726-81-2848\/salmon-preserved-lemon-pea-shoots-2p-w_large_feature.png","ingredients":[" 2  Skin-On Salmon Fillets "," 1  Lemon "," 1  Ounce Pea Shoots "," 1  Persian Cucumber "," 1  Tablespoon Red Wine Vinegar "," 1  Shallot "," 1  Tablespoon Sugar "," ½  Cup Red Quinoa "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/6\/recipe_steps\/1306\/20140723-1917-3060-9074\/Step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Without peeling, halve and deseed the lemon; small dice the lemon. In a small bowl, combine the diced lemon with the sugar and 1 teaspoon of salt. Small dice the cucumber. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a small bowl with the vinegar.    "},{"img":"\/\/media.blueapron.com\/recipes\/6\/recipe_steps\/1302\/20140723-1917-3054-4166\/Step2_high_feature.jpg","title":" Cook the quinoa:  ","desc":" Rinse the quinoa under cold water and drain thoroughly. Add the rinsed quinoa to the pot of boiling water and cook 14 to 16 minutes, or until tender. Thoroughly drain the cooked quinoa and transfer to a large bowl.   "},{"img":"\/\/media.blueapron.com\/recipes\/6\/recipe_steps\/1303\/20140723-1917-2001-7413\/Step3_high_feature.jpg","title":" Cook the salmon:  ","desc":" While the quinoa cooks, pat the salmon fillets dry with paper towels; season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned fillets, skin sides down, and cook 4 to 5 minutes on the first side, or until the skin is crispy and browned. Flip the fillets and cook 2 to 3 minutes, or until cooked to your desired degree of doneness. Remove from heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/6\/recipe_steps\/1304\/20140723-1917-3195-4039\/Step4_high_feature.jpg","title":" Make the salad:  ","desc":" While the salmon cooks, to make the vinaigrette, season the shallot-vinegar mixture with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. To the bowl of cooked quinoa, add the cucumber and pea shoots. Season with salt and pepper. Add enough of the vinaigrette to coat the salad (you may have extra vinaigrette). Gently toss to coat; season with salt and pepper to taste.   "},{"img":"\/\/media.blueapron.com\/recipes\/6\/recipe_steps\/1301\/20140723-1917-3189-8956\/Step5_high_feature.jpg","title":" Plate your dish:  ","desc":" Stir the diced lemon mixture to thoroughly mix. Divide the salad and cooked salmon fillets between 2 plates. Garnish each plate with the diced lemon and a few spoonfuls of the juices from the bowl. Enjoy!    "}]}