{"category":"Fish","link":"seared-cod-pickled-grapes-with-butternut-squash-farro-salad","thumb":"\/\/media.blueapron.com\/recipes\/1365\/c_main_dish_images\/20150901-1920-107-0793\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204609_high_also_thumb.jpg","title":" Seared Cod &amp; Pickled Grapes ","subtitle":" with Butternut Squash &amp; Farro Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1365\/c_main_dish_images\/20150901-1919-98-4789\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204608_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  515    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We love adding sweet ingredients to savory entr&eacute;es for delicious complexity. Here, we&rsquo;re going a step further to amp up our flavors. As a topping for crispy cod, we&rsquo;re quick-pickling red grapes with red wine vinegar and sugar. The pickled grapes add bright sweetness and a bit of tartness to the dish, which includes a warm salad of farro and butternut squash&mdash;a true prize of autumn. Saut&eacute;ed spinach and fresh thyme complete the salad, dressed simply with a splash of lemon juice. ","ingbg":"\/\/media.blueapron.com\/recipes\/1365\/ingredient_images\/20150929-1615-26-9565\/FF-Roasted-Cod-Pickled-Grapes-F-W_large_feature.png","ingredients":[" 4  Cod Fillets "," ⅔  Cup Semi-Pearled Farro "," 4  Ounces Red Grapes ","  1  Butternut Squash   "," 1  Lemon "," 1  Red Onion "," ½  Pound Spinach "," 1  Bunch Thyme "," 2  Tablespoons Red Wine Vinegar "," 2  Tablespoons Sugar "," ¼  Cup All-Purpose Flour "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5862\/20150904-1919-141-8245\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204600_high_feature.jpg","title":" Cook the farro:  ","desc":" Heat a large pot of salted water to boiling on high. Once boiling, add the farro. Cook 16 to 18 minutes, or until tender. Drain thoroughly and return to the pot. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5863\/20150904-1919-146-5704\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204597_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the farro cooks, wash and dry the fresh produce. Halve the grapes; place in a heatproof bowl. Cut off and discard both ends of the squash. Peel the squash; halve crosswise, then halve the rounded bottom lengthwise. Scoop out and discard the seeds and pulp; small dice the squash. Peel and small dice the onion. Pick the thyme leaves off the stems; discard the stems and roughly chop the leaves. Roughly chop the spinach. Quarter and deseed the lemon.  "},{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5864\/20150904-1919-151-8761\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204598_high_feature.jpg","title":" Pickle the grapes:  ","desc":" In a large pan (nonstick, if you have one), combine the vinegar, sugar and &frac14; cup of water. Heat to boiling on high. Once boiling, carefully pour the pickling liquid into the heatproof bowl of grapes; season with salt and pepper. Set aside to pickle for at least 15 minutes. Carefully wipe out the pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5865\/20150904-1919-161-3975\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204601_high_feature.jpg","title":" Start the vegetables:  ","desc":" In the pan used to make the pickling liquid, heat 1 tablespoon of olive oil on medium-high until hot. Add the squash; season with salt and pepper. Cook, stirring occasionally, 9 to 11 minutes, or until browned and tender.   "},{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5866\/20150904-1919-166-9486\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204602_high_feature.jpg","title":" Finish the vegetables &amp; make the farro salad:  ","desc":" Add the onion and half the thyme to the pan of squash; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until softened and fragrant. Add the spinach; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the spinach has wilted. Transfer to the pot of cooked farro. Add the juice of all 4 lemon wedges. Stir to thoroughly combine; season with salt and pepper to taste. Set aside in a warm place. Wipe out the pan.   "},{"img":"\/\/media.blueapron.com\/recipes\/1365\/recipe_steps\/5867\/20150904-1919-171-6557\/FP_082615_4_RoastedCodwithPickledGrapes_20-_204603_high_feature.jpg","title":" Cook the cod &amp; serve your dish:  ","desc":" Place the flour on a large plate. Pat the cod fillets dry with paper towels; season with salt and pepper on both sides. Coat 1 side of each seasoned fillet in the flour (tapping off any excess). In the pan used to cook the vegetables, heat a thin layer of oil on medium-high until hot. Add the fillets, coated sides down. Cook 3 to 5 minutes on the first side, or until browned and crispy. Flip and cook 1 to 2 minutes, or until cooked through. Remove from heat. Divide the farro salad between 4 dishes. Top with the cooked cod fillets. Garnish with the pickled grapes (draining just before adding) and remaining thyme. Enjoy!   "}]}