{"category":"Fish","link":"seared-rockfish-fregola-sarda-with-braised-romano-beans-tomato","thumb":"\/\/media.blueapron.com\/recipes\/1284\/c_main_dish_images\/20150715-1722-142-4464\/2P_070715_6_SearedCod_FregolaSarda_20-_208335_high_also_thumb.jpg","title":" Seared Cod &amp; Fregola Sarda ","subtitle":" with Braised Summer Vegetables ","headbg":"\/\/media.blueapron.com\/recipes\/1284\/c_main_dish_images\/20150715-1721-127-0328\/2P_070715_6_SearedCod_FregolaSarda_20-_208334_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  645    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, as a side for flaky, golden cod, we&rsquo;re serving up a summer vegetable braise. Braising&mdash;or cooking ingredients in oil, then simmering them in a flavorful liquid&mdash;is an incredibly delicious cooking technique. As they simmer, the ingredients break down and start to combine, resulting in unique texture and flavor. Here, we&rsquo;re applying the technique to seasonal green beans and tomato simmered in a sauce of red wine vinegar, olives and spices. The result, served over a bed of fregola sarda pasta, is a perfect, light summer dinner. ","ingbg":"\/\/media.blueapron.com\/recipes\/1284\/ingredient_images\/20150811-1737-30-7950\/SearedCod-FregolaSarda-2P-W_large_feature.png","ingredients":[" 2  Cod Fillets "," ⅓  Cup Fregola Sarda Pasta "," 4  Ounces Green Beans "," 1  Tomato ","  1  Red Onion   "," 1  Large Bunch Parsley "," 2  Tablespoons Red Wine Vinegar ","  2  Tablespoons Tomato Paste   "," 1  Ounce Castelvetrano Olives "," 2  Teaspoons Braised Vegetable Spice Blend (Herbes De Provence, Garlic Powder & Crushed Red Pepper Flakes) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5356\/20150713-2101-406-4425\/2P_070715_6_SearedCod_FregolaSarda_20-_208326_high_feature.jpg","title":" Cook the fregola sarda:  ","desc":" Heat a large pot of salted water to boiling on high. Once boiling, add the fregola sarda pasta. Cook 14 to 17 minutes, or until tender. Remove from heat. Drain thoroughly and return to the pot. Stir in a drizzle of olive oil and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5357\/20150713-2101-395-7306\/2P_070715_6_SearedCod_FregolaSarda_20-_208323_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the fregola sarda pasta cooks, wash and dry the fresh produce. Cut off and discard the stem ends of the green beans; halve the green beans. Medium dice the tomato. Peel and medium dice the onion. Pick the parsley leaves off the stems; discard the stems. Using the flat side of your knife, smash the olives; remove and discard the pits, then roughly chop.  "},{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5358\/20150713-2101-417-9173\/2P_070715_6_SearedCod_FregolaSarda_20-_208324_high_feature.jpg","title":" Start the vegetables:  ","desc":" While the fregola sarda pasta continues to cook, in a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the green beans and onion; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the green beans are slightly tender and the onion is softened and fragrant. Add the tomato paste; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the tomato paste is dark red.  "},{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5359\/20150713-2102-428-8309\/2P_070715_6_SearedCod_FregolaSarda_20-_208327_high_feature.jpg","title":" Finish the vegetables:  ","desc":" Add the tomato, olives, vinegar, spice blend and &frac12; cup of water to the pan of vegetables; season with salt and pepper. Cook, stirring occasionally, 8 to 10 minutes, or until the green beans are tender and the tomatoes are saucy and thickened. Season with salt and pepper to taste. Transfer to a bowl and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5360\/20150713-2102-439-1154\/2P_070715_6_SearedCod_FregolaSarda_20-_208328_high_feature.jpg","title":" Cook the cod:  ","desc":" Pat the cod fillets dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the vegetables, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned fillets and cook 2 to 4 minutes per side, or until golden brown and cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1284\/recipe_steps\/5361\/20150713-2102-450-1356\/2P_070715_6_SearedCod_FregolaSarda_20-_208329_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cooked fregola sarda pasta between 2 dishes. Top each with a cooked cod fillet and the finished vegetables. Garnish with the parsley. Enjoy!  "}]}