{"category":"Pork","link":"smoky-pork-roast-spiced-rice-with-green-tomato-peach-salsa","thumb":"\/\/media.blueapron.com\/recipes\/1268\/c_main_dish_images\/20150731-2010-53-8626\/FP_070115_2_20R_073115_2_20spiced_20pork_20peach_20salsa-0424_high_also_thumb.jpg","title":" Pork Chops &amp; Summer Vegetable Rice ","subtitle":" with Heirloom Tomato &amp; Peach Salsa ","headbg":"\/\/media.blueapron.com\/recipes\/1268\/c_main_dish_images\/20150731-2009-37-0779\/FP_070115_2_20R_073115_2_20spiced_20pork_20peach_20salsa-0422_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  660    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the summer, &ldquo;salsa&rdquo; takes on a mouthwatering new meaning. Here, we&rsquo;re making a fresh, seasonally-inspired salsa featuring heirloom tomato&mdash;alongside sweet peach. (Since heirloom tomatoes grow in a gorgeous array of colors, yours may look different from the one pictured&mdash;but the flavor will be just as robust!) We&rsquo;re serving our salsa over succulent pork chops, rubbed with spices and seared on the stove. To complete the dish, we&rsquo;re also simmering rice together with saut&eacute;ed corn and green beans, infusing the fluffy grains with the bright flavors of the summer vegetables. ","ingbg":"\/\/media.blueapron.com\/recipes\/1268\/ingredient_images\/20150804-1516-21-8524\/Pork-Roast-Peach-Corn-2P-W_large_feature.png","ingredients":[" 4  Boneless, Center-Cut Pork Chops "," 1  Cup Long Grain White Rice "," 6  Ounces Green Beans "," 3  Cloves Garlic ","  1  Ear Of Corn   "," 1  Peach "," 1  Red Onion "," ¾  Pound Heirloom Tomato "," 1  Large Bunch Cilantro "," 2  Ounces Queso Fresco "," 2  Tablespoons White Vinegar ","  1  Tablespoon Pork & Rice Spice Blend (Chipotle Powder, Ground Cumin, Dried Mexican Oregano & Dried Thyme)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5529\/20150731-2213-169-4359\/FP_070115_2_20Pork_20Roast_20Peach_20Corn-8157_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Trim off and discard the stem ends of the green beans; cut the green beans into &frac14;-inch pieces. Peel and mince the garlic. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Peel and small dice the onion. Crumble the queso fresco. Core and medium dice the tomato. Pit and medium dice the peach. Pick the cilantro leaves off the stems; discard the stems and finely chop the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5530\/20150731-2213-184-3030\/FP_070115_2_20Pork_20Roast_20Peach_20Corn-8159_high_feature.jpg","title":" Start the vegetables:  ","desc":" In a large pot, heat 1 tablespoon of olive oil on medium-high until hot. Add the green beans, garlic, corn, half the onion and half the spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until slightly softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5531\/20150731-2213-195-8300\/FP_070115_2_20Pork_20Roast_20Peach_20Corn-8161_high_feature.jpg","title":" Make the summer vegetable rice:  ","desc":" Stir the rice, a big pinch of salt and 2 cups of water into the pot of vegetables. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 14 to 16 minutes, or until the water has been absorbed and the rice is tender. Remove from heat. Add the queso fresco and half the vinegar; stir to thoroughly combine. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5532\/20150731-2214-210-4291\/FP_070115_2_20R_073115_2_20spiced_20pork_20peach_20salsa-0404_high_feature.jpg","title":" Cook the pork chops:  ","desc":" While the rice cooks, pat the pork chops dry with paper towels; season on both sides with salt, pepper and the remaining spice blend. In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned pork chops. Cook 2 to 4 minutes per side, or until browned and cooked through. Transfer to a serving dish and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5533\/20150731-2214-232-4511\/FP_070115_2_20Pork_20Roast_20Peach_20Corn-8160_high_feature.jpg","title":" Make the salsa:  ","desc":" While the pork chops cook, in a medium bowl, combine the tomato, peach, remaining vinegar, ⅔ of the cilantro and as much of the remaining onion as you&rsquo;d like. Stir to thoroughly combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1268\/recipe_steps\/5534\/20150731-2214-221-5799\/FP_070115_2_20R_073115_2_20spiced_20pork_20peach_20salsa-0405_high_feature.jpg","title":" Serve your dish:   ","desc":" Top the cooked pork chops with a few spoonfuls of the salsa. Garnish the pork chops and summer vegetable rice with the remaining cilantro. Serve with the remaining salsa on the side. Enjoy!  "}]}