{"category":"Shellfish","link":"southern-style-shrimp-and-grits-with-zucchini-corn-cherry-tomatoes","thumb":"\/\/media.blueapron.com\/recipes\/436\/c_main_dish_images\/20140828-2307-7622-6155\/Shrimp_20__20Grits-0663_high_also_thumb.jpg","title":" Southern-Style Shrimp &amp; Grits  ","subtitle":" with Corn, Zucchini &amp; Cherry Tomatoes ","headbg":"\/\/media.blueapron.com\/recipes\/436\/c_main_dish_images\/20140828-2307-7346-6563\/Shrimp_20__20Grits-0664_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Shrimp and grits are a classic Southern pairing. In this recipe, we&rsquo;re making the dish deliciously seasonal by finishing the paprika-spiced shrimp in a saut&eacute; of summer vegetables, which reduces to create a tasty sauce. The mixture is perfect served right atop the grits, which we&rsquo;re cooking with sweet corn kernels and lemon zest, for amazing texture and brightness. Stir the shrimp and vegetables into the grits for creamy, cheesy bites full of complex, tangy richness. ","ingbg":"\/\/media.blueapron.com\/recipes\/436\/ingredient_images\/20150818-1502-91-9655\/shrimp-n-grits-W_large_feature.png","ingredients":[" 10  Ounces Shrimp "," ¾  Cup Yellow Grits "," 3  Scallions "," 1  Clove Garlic "," 1  Ear Of Corn "," 1  Lemon "," 1  Zucchini "," 2  Ounces Cherry Tomatoes "," 3  Tablespoons Butter "," 2  Ounces Cheddar Cheese "," 1  Teaspoon Smoked Paprika "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2945\/20140828-2313-7656-6117\/Shrimp_20__20Grits-0647_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut off and discard the root ends of the scallions; thinly slice the scallions, separating the white bottoms and green tops. Peel and mince the garlic. Remove and discard the husks and silks of the corn. Cut the corn kernels off the cob; discard the cob. Using a peeler, remove the lemon rind, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Medium dice the zucchini. Halve the tomatoes. Grate the cheese. Pat the shrimp dry with paper towels and place in a medium bowl; toss with the smoked paprika.  "},{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2946\/20140828-2314-7692-2318\/Shrimp_20__20Grits-0653_high_feature.jpg","title":" Cook the grits:  ","desc":" In a medium pot, heat 3 cups of water and a big pinch of salt to boiling on high. Once boiling, stir in the grits, lemon zest and corn; reduce the heat to low. Cook, stirring frequently to break up any clumps, 10 to 12 minutes, or until the water has been absorbed and the grits have thickened. Remove from heat. Stir in the cheese and half the butter; season with salt and pepper to taste. Cover and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2947\/20140828-2314-7686-6206\/Shrimp_20__20Grits-0656_high_feature.jpg","title":" Cook the shrimp:  ","desc":" While the grits cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the spiced shrimp; season with salt and pepper. Cook, flipping occasionally, 2 to 4 minutes, or until browned and cooked through. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2948\/20140828-2314-7845-9816\/Shrimp_20__20Grits-0658_high_feature.jpg","title":" Start the vegetables:  ","desc":" In the pan used to cook the shrimp, heat 2 teaspoons of olive oil on medium until hot. Add the garlic and white bottoms of the scallions; season with salt. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2949\/20150818-1453-16-4544\/Shrimp_20__20Grits-0659_20EDIT_high_feature.jpg","title":" Finish the vegetables &amp; shrimp:  ","desc":" Add the zucchini to the pan of vegetables; season with salt. Cook, stirring occasionally, 1 to 2 minutes, or until slightly softened. Add the cooked shrimp, tomatoes, remaining butter, the juice of all 4 lemon wedges and all but a pinch of the green tops of the scallions. Cook, stirring occasionally, 30 seconds to 1 minute, or until thoroughly combined and the tomatoes have softened slightly. Remove from heat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/436\/recipe_steps\/2950\/20140828-2314-7857-8999\/Shrimp_20__20Grits-0660_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cooked grits between 2 dishes. Top with the finished vegetables and shrimp. Garnish with the remaining green tops of the scallions. Enjoy!  "}]}