{"category":"Shellfish","link":"southern-style-shrimp-boil-with-corn-potatoes-green-bean-salad","thumb":"\/\/media.blueapron.com\/recipes\/1323\/c_main_dish_images\/20150811-1930-45-6717\/FP_071715_1_Shrimp_22Boil_22_20-_209679_high_also_thumb.jpg","title":" Southern-Style Shrimp &quot;Boil&quot; ","subtitle":" with Corn, Potatoes &amp; Green Bean Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1323\/c_main_dish_images\/20150811-1914-58-3608\/FP_071715_1_Shrimp_22Boil_22_20-_209678_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  510    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In the coastal regions of the Southern U.S., seafood boils are a way of life. Families gather to enjoy the delicious bounty of shellfish and hearty vegetables, typically boiled all together. In this inspired recipe, to build their individual flavors, we&rsquo;re boiling our potatoes separately from our corn on the cob. Then we&rsquo;re finishing them together&mdash;along with seasoned shrimp, lemon juice and butter&mdash;in one big pan. (If your pan isn&rsquo;t big enough, feel free to use a pot!) A condiment of creamy aioli completes this late-summer feast. ","ingbg":"\/\/media.blueapron.com\/recipes\/1323\/ingredient_images\/20150902-1603-99-7084\/FF-Shrimp-Boil-F-W_large_feature.png","ingredients":[" 1  Pound Shrimp "," 3  Ounces Cherry Tomatoes "," 3  Cloves Garlic ","  2  Ears Of Corn   "," 1  Lemon "," 1  Pound Prince Of Orange Potatoes "," ½  Pound Green Beans "," 1  Bunch Thyme "," 2  Tablespoons Butter "," ⅓  Cup Mayonnaise "," 1  Tablespoon Shrimp Boil Spice Blend (Bay Leaves, Celery Salt, Sweet Paprika, Celery Seeds, Mustard Powder, Black Pepper, Nutmeg, Cayenne Pepper & Cinnamon) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5625\/20150812-2111-366-3973\/FP_071715_1_Shrimp_22Boil_22_20-_209664_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Remove and discard the husks and silks of the corn; cut each cob into quarters. Trim off and discard the stem ends of the green beans. Cut the potatoes into bite-sized pieces. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste (or use a zester). Quarter and deseed the lemon. Halve the tomatoes. Pick the thyme leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5626\/20150812-2111-98-7223\/FP_071715_1_Shrimp_22Boil_22_20-_209666_high_feature.jpg","title":" Cook the corn &amp; green beans:  ","desc":" Add the corn and green beans to the pot of boiling water. Cook 3 to 4 minutes, or until the corn is slightly tender and the green beans are bright green. Using tongs, transfer the cooked corn to a large bowl. Using a slotted spoon or strainer, remove the cooked green beans, leaving the pot of water boiling. Rinse the green beans under cold water for 30 seconds to 1 minute to stop the cooking process. Pat dry with paper towels; transfer to a separate large bowl.   "},{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5627\/20150812-2111-381-0488\/FP_071715_1_Shrimp_22Boil_22_20-_209668_high_feature.jpg","title":" Cook the potatoes:  ","desc":" Add the potatoes to the pot of boiling water used to cook the corn and green beans. Cook 10 to 12 minutes, or until tender when pierced with a fork. Drain thoroughly. Transfer to the bowl of cooked corn.  "},{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5628\/20150812-2111-109-1534\/FP_071715_1_Shrimp_22Boil_22_20-_209667_high_feature.jpg","title":" Make the aioli &amp; salad:  ","desc":" While the potatoes cook, in a small bowl, combine the mayonnaise, half the garlic paste and the juice of 2 lemon wedges. Stir to thoroughly combine; season with salt and pepper to taste. To the bowl of cooked green beans, add the tomatoes and &frac14; of the aioli. Toss to coat; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5629\/20150812-2111-392-1833\/FP_071715_1_Shrimp_22Boil_22_20-_209669_high_feature.jpg","title":" Finish the boil:  ","desc":" Pat the shrimp dry with paper towels; place in a bowl. Season with salt, pepper, half the thyme and &frac34; of the spice blend. Toss to thoroughly coat. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned shrimp and remaining garlic paste. Cook, stirring occasionally, 2 to 4 minutes, or until the shrimp are slightly opaque. Add the cooked corn and potatoes, butter and the juice of the remaining lemon wedges; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until thoroughly combined and the shrimp are opaque and cooked through. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1323\/recipe_steps\/5630\/20150812-2112-403-7594\/FP_071715_1_Shrimp_22Boil_22_20-_209673_high_feature.jpg","title":" Serve your dish:   ","desc":" Transfer the finished boil to a serving dish. Garnish with the remaining thyme and spice blend. Transfer the remaining aioli to a serving dish. Serve with the salad and remaining aioli on the side. Enjoy!  "}]}