{"category":"Poultry","link":"southern-style-chicken-cacciatore-with-creamy-grits-basil","thumb":"\/\/media.blueapron.com\/recipes\/1336\/c_main_dish_images\/20150819-1542-33-0764\/2P_P_081015_SouthernStyleChickenCacciatore_2_20-_203336_high_also_thumb.jpg","title":" Southern-Style Chicken Cacciatore ","subtitle":" with Creamy Grits &amp; Basil ","headbg":"\/\/media.blueapron.com\/recipes\/1336\/c_main_dish_images\/20150819-1541-21-8959\/2P_P_081015_SouthernStyleChickenCacciatore_20-_203336_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  680    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" For this edition of our Guest Chef Series, we traveled to Texas to cook with Matt McCallister, head chef of Dallas&rsquo; FT33 and the upcoming Filament, set to open in October. Matt&rsquo;s cuisine is rooted in local food communities. He relies on farmers and artisans he trusts, and on the natural flavors of his ingredients. His take on farm-to-table cooking celebrates new flavor combinations without forgetting the classics, as in this Southern spin on an Italian favorite. Special thanks to Chef McCallister and FT33 for their impeccable take on seasonal cuisine! ","ingbg":"\/\/media.blueapron.com\/recipes\/1336\/ingredient_images\/20150914-2020-71-5084\/P_southern-style-chicken-cacciatore-2P-W_large_feature.png","ingredients":[" 3  Boneless, Skinless Chicken Thighs "," ¾  Cup Yellow Grits "," 1  Red Bell Pepper ","  1  Tomato   "," 1  Yellow Onion "," 1  Bunch Basil "," 2  Tablespoons All-Purpose Flour "," 2  Tablespoons Butter ","  2  Tablespoons Capers   "," 2  Tablespoons Tomato Paste "," 1  Tablespoon Molasses "," 1  Tablespoon Southern Cacciatore Spice Blend (Smoked Sweet Paprika, Dried Parsley, Dried Oregano, Ancho Chile Powder, Garlic Powder, Apple Cider Vinegar Powder & Cayenne Pepper) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5717\/20150819-1556-80-9760\/P_080415_SouthernStyleChickenCacciatore_20-_200439_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Core and medium dice the tomato. Cut out and discard the stem, ribs and seeds of the bell pepper; medium dice. Peel and small dice the onion. Pick the basil leaves off the stems; discard the stems. Roughly chop the capers.  "},{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5718\/20150911-2112-26-0473\/P_081015_SouthernStyleChickenCacciatore_20-_203265-CROP_high_feature.jpg","title":" Cook the grits:  ","desc":" In a large pot, heat 3 cups of water and a big pinch of salt to boiling on high. Once boiling, slowly whisk in the grits; reduce the heat to low. Cook, whisking frequently to break up any lumps, 10 to 12 minutes, or until the water has been absorbed and the grits are tender. (If the grits seem dry, gradually add up to &frac14; cup of water to achieve your desired consistency.) Remove from heat. Whisk in the butter until thoroughly combined; season with salt and pepper to taste. Cover and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5719\/20150819-1556-106-2297\/P_081015_SouthernStyleChickenCacciatore_20-_203276_high_feature.jpg","title":" Cook the chicken:  ","desc":" While the grits cook, in a large bowl, combine the flour and half the spice blend; season with salt and pepper. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Thoroughly coat the seasoned chicken in the flour-spice blend mixture (shaking off any excess). In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the coated chicken. Cook 4 to 6 minutes per side, or until golden brown and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5720\/20150819-1602-135-8801\/P_081015_SouthernStyleChickenCacciatore_20-_203279_high_feature.jpg","title":" Make the sauce:  ","desc":" Add 2 teaspoons of olive oil to the pan of reserved fond; heat on medium-high until hot. Add the onion, tomato and bell pepper; season with salt and pepper. Cook, stirring occasionally, 3 to 4 minutes, or until softened and fragrant. Add the tomato paste and remaining spice blend; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the tomato paste is dark red. Add the molasses, capers and 1 cup of water. Cook, stirring occasionally, 6 to 8 minutes, or until thickened and saucy.  "},{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5721\/20150819-1602-151-3805\/P_081015_SouthernStyleChickenCacciatore_20-_203287_high_feature.jpg","title":" Finish the chicken &amp; sauce:  ","desc":" To the pan of sauce, add the cooked chicken (along with any juices from the plate), ⅔ of the basil (tearing just before adding) and &frac14; cup of water. Cook, stirring occasionally and spooning the sauce over the chicken, 1 to 2 minutes, or until the chicken is thoroughly coated. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1336\/recipe_steps\/5722\/20150911-2114-16-0194\/2P_P_081015_SouthernStyleChickenCacciatore_20-_203302_high_feature.jpg","title":" Plate your dish:  ","desc":" Cut 1 of the chicken thighs in half. Divide the cooked grits between 2 bowls. Top with the finished chicken and sauce. Garnish with the remaining basil. Enjoy!  "}]}