{"category":"Beef","link":"spaghetti-bolognese-with-brussels-sprouts-rosemary","thumb":"\/\/media.blueapron.com\/recipes\/1356\/c_main_dish_images\/20150908-2001-72-5131\/FP_090215_2_FallBolognesePasta-0240_high_also_thumb.jpg","title":" Spaghetti Bolognese  ","subtitle":" with Brussels Sprouts &amp; Rosemary ","headbg":"\/\/media.blueapron.com\/recipes\/1356\/c_main_dish_images\/20150908-2000-62-3591\/FP_090215_2_FallBolognesePasta-0239_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Bolognese, a hearty meat sauce named for the Italian city of Bologna, traditionally uses cool-weather carrots as part of its aromatic base. But why stop there, when a wealth of incredible fall produce is just getting into full swing? In this recipe, we&rsquo;re serving up classic spaghetti bolognese with a special, simple touch: Brussels sprouts. To use them as leafy greens, just pick the leaves off the cores, trimming more from the bottom of each sprout as necessary. Their crisp texture and flavor deliciously reflect the season in every bite. ","ingbg":"\/\/media.blueapron.com\/recipes\/1356\/ingredient_images\/20151006-1705-18-1507\/Fall-Bolognese-Pasta-F-W_large_feature.png","ingredients":[" 1⅛  Pounds Ground Beef "," 10  Ounces Spaghetti "," 1  8-Ounce Can Tomato Sauce "," 6  Ounces Brussels Sprouts "," 4  Cloves Garlic "," 2  Carrots "," 1  Yellow Onion "," 1  Bunch Parsley ","  1  Bunch Rosemary   "," 2  Tablespoons Butter ","  ¼  Cup Grated Pecorino Cheese   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5673\/20150910-2004-50-2328\/FP_090215_2_FallBolognesePasta-0232_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel and mince the garlic. Peel and small dice the carrots and onion. Pick the rosemary leaves off the stems; discard the stems and roughly chop the leaves. Cut off and discard the stem ends of the Brussels sprouts. Pick off and reserve the Brussels sprout leaves until you reach the lighter cores; discard the cores. Thinly slice the parsley leaves and stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5674\/20150910-2004-61-2625\/FP_090215_2_FallBolognesePasta-0233_high_feature.jpg","title":" Start the sauce:  ","desc":" In a large pan (or pot), heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic, carrots, onion and rosemary; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant. Add the ground beef; season with salt and pepper. Cook, frequently breaking the meat apart with a spoon, 4 to 6 minutes, or until browned and cooked through. Carefully drain off and discard any drippings from the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5675\/20150910-2005-73-6597\/FP_090215_2_FallBolognesePasta-0234_high_feature.jpg","title":" Finish the sauce:  ","desc":" Add the tomato sauce and 1 cup of water to the pan of vegetables and ground beef; season with salt and pepper. Heat to boiling on high. Once boiling, reduce the heat to medium-high. Simmer, stirring occasionally and scraping up any browned bits from the bottom of the pan, 7 to 9 minutes, or until the sauce has thickened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5676\/20150910-2005-78-3226\/FP_090215_2_FallBolognesePasta-0235_high_feature.jpg","title":" Cook the pasta:  ","desc":" While the sauce cooks, add the pasta to the pot of boiling water. Cook 8 to 10 minutes, or until al dente (still slightly firm to the bite). Reserving &frac34; cup of the pasta cooking water, thoroughly drain the cooked pasta.  "},{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5677\/20150910-2005-83-2551\/FP_090215_2_FallBolognesePasta-0236_high_feature.jpg","title":" Finish the pasta:  ","desc":" To the pan of sauce, add the cooked pasta, butter, Brussels sprouts and &frac12; cup of the reserved pasta cooking water; season with salt and pepper. Cook on medium-high, stirring frequently to coat the pasta, 2 to 3 minutes, or until thoroughly combined and the Brussels sprouts are bright green. (If the sauce seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency.) Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1356\/recipe_steps\/5678\/20150910-2012-108-9865\/FP_090215_2_FallBolognesePasta-0237_high_feature.jpg","title":" Serve your dish:  ","desc":" Divide the finished pasta between 4 dishes. Garnish with the parsley and cheese. Enjoy!  "}]}