{"category":"Pork","link":"spice-rubbed-pork-medallions-with-peach-salsa-cilantro-green-bean-rice","thumb":"\/\/media.blueapron.com\/recipes\/271\/c_main_dish_images\/20140808-2020-156-2735\/IMG_5556_20Edit_high_also_thumb.jpg","title":" Spice-Rubbed Pork Medallions with Peach Salsa  ","subtitle":" &amp; Cilantro-Green Bean Rice ","headbg":"\/\/media.blueapron.com\/recipes\/271\/c_main_dish_images\/20140808-2020-156-2735\/IMG_5556_20Edit_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Meats and fruits have long been paired together, with delicious results—that’s why so many marinades have a fruit base. In this dish, you’ll prepare tender pork medallions with a fresh peach salsa. (In summer, it’s simply wrong not to eat as many peaches as possible.) The savory-sweet combination you’ll create is round and complex. And you’ll even take it a step further. By seasoning the pork with our rub, you’ll complete the classic flavor trifecta: sweet, savory and spiced.","desc":" Meats and fruits have long been paired together, with delicious results—that’s why so many marinades have a fruit base. In this dish, you’ll prepare tender pork medallions with a fresh peach salsa. (In summer, it’s simply wrong not to eat as many peaches as possible.) The savory-sweet combination you’ll create is round and complex. And you’ll even take it a step further. By seasoning the pork with our rub, you’ll complete the classic flavor trifecta: sweet, savory and spiced. ","ingbg":"\/\/media.blueapron.com\/recipes\/271\/ingredient_images\/20140807-2204-996-3166\/IMG_5445-Edit_large_feature.png","ingredients":[" ¾  Cup Jasmine Rice "," 6  Ounces Green Beans "," 2  Peaches "," 1  Bunch Basil "," 1  Bunch Cilantro "," 1  Clove Garlic "," 1  Lime "," 1  Red Onion "," 10  Ounces Pork Tenderloin "," 1½  Tablespoons Pork Spice Rub (Brown Sugar, Spanish Paprika, Ground Fennel & Curry Powder) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1534\/167f6ceb-ccbc-43d1-9628-604b7e8e393d\/Step1%20Edit_high_feature.jpg","title":" Cook the rice:  ","desc":" In a small pot, combine the rice, 1&frac12; cups of water and a pinch of salt. Heat to boiling on high. Once boiling, cover, reduce the heat to low and cook 15 to 18 minutes, or until the rice is cooked through and the water is absorbed.  "},{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1535\/2c3c3458-8ae8-4381-baa6-610789b5e5b2\/Step2%20Edit-4_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the rice cooks, wash and dry the fresh produce. Remove the pork from the refrigerator to bring to room temperature. Trim off the stems of the green beans; cut the beans into &frac12;-inch pieces. Pit and small dice the peaches. Pick the basil and cilantro leaves off the stems; discard the stems. Finely chop the cilantro. Roughly chop the basil. Peel and mince the garlic; using the flat side of your knife, smash until it resembles a paste.  Using a peeler, remove the rind of the lime, avoiding the pith; mince the rind to get 2 teaspoons of zest. Halve the lime. Peel and mince the red onion.   "},{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1536\/21c32232-779e-4d7f-b21f-33b00f4b229a\/Step3%20Edit_high_feature.jpg","title":" Make the salsa:  ","desc":" In a medium bowl, combine the peaches, the juice of the whole lime, 3 to 4 tablespoons of the minced red onion (save the rest for the rice), the basil and lime zest. Stir in a drizzle of olive oil and season with salt and pepper to taste. Set aside as you continue cooking.  "},{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1537\/c0646318-f69c-4f10-aea2-ccf5da53e1bb\/Step4%20Edit_high_feature.jpg","title":" Cook the pork:  ","desc":" Place the pork spice rub in a shallow dish. Season each pork medallion with salt and pepper, then completely coat in the spice rub, tapping off any excess. In a large pan, heat 2 teaspoons of olive oil on medium until hot. Add the coated pork medallions and cook, loosely covering the pan with aluminum foil, 3 to 4 minutes per side, or until cooked through. Transfer the cooked pork to a plate, leaving any browned bits (or fond) in the pan. Loosely cover the pork with aluminum foil to keep warm. Let rest for at least 5 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1538\/53eb180b-a7dc-4271-a320-ad07c351d881\/Step5%20Edit_high_feature.jpg","title":" Make the cilantro-green bean rice:  ","desc":" Add 1 to 2 teaspoons of olive oil to the pan of fond and heat on medium until hot. Add the garlic, green beans, and remaining red onion; season with salt and pepper. Cook, stirring frequently, 3 to 4 minutes, or until the green beans are tender, but still crisp. Stir in the cooked rice and cilantro and cook, stirring occasionally, 1 to 2 minutes, or until well combined and heated through. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/271\/recipe_steps\/1539\/28708bf2-12c0-42e5-aca2-54aab37f0e5c\/Step6%20Edit_high_feature.jpg","title":" Plate your dish:  ","desc":" Divide the cilantro-green bean rice between 2 plates. Place the rested pork medallions on top of each serving of rice. (Drizzle the pork with any accumulated juices from the plate it was resting on.) Spoon the peach salsa over the pork. Enjoy!   "}]}