{"category":"Poultry","link":"spiced-chicken-pitas-couscous-with-carrots-dates-cucumber-yogurt-sauce","thumb":"\/\/media.blueapron.com\/recipes\/1354\/c_main_dish_images\/20151002-1836-22-5080\/FP_090115_3_ChickenPitasWithCouscous_20-_200043_20EDIT_high_also_thumb.jpg","title":" Spiced Chicken Pitas &amp; Couscous ","subtitle":" with Carrots, Dates &amp; Cucumber-Yogurt Sauce ","headbg":"\/\/media.blueapron.com\/recipes\/1354\/c_main_dish_images\/20151002-1835-14-7387\/FP_090115_3_ChickenPitasWithCouscous_20-_200040_20EDIT_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  650    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this Middle Eastern-inspired recipe, we&rsquo;re filling pitas with succulent chicken and cooling yogurt sauce, and serving deliciously hearty couscous on the side. Couscous is made from semolina wheat, ground coarsely and rolled into grain-sized balls. To take advantage of its incredible absorbency, we&rsquo;re cooking ours with cardamom, turmeric, sumac and more. The couscous soaks up the authentic flavors from the boiling water&mdash;and plumps up to a delightful fluffiness. For added complexity, we&rsquo;re mixing in almonds, carrots and dates (the uniquely sweet fruits of a palm tree). ","ingbg":"\/\/media.blueapron.com\/recipes\/1354\/ingredient_images\/20151002-1837-40-0594\/FP-Chicken-Pitas-Couscous-F-W_large_feature.png","ingredients":[" 4  Boneless, Skinless Chicken Breasts "," 4  Pocketless Pitas "," 1  Cup Couscous ","  ½  Cup Plain Greek Yogurt   "," 2  Carrots "," 1  Cucumber "," 1  Lemon "," 1  Bunch Mint "," 2  Ounces Medjool Dates "," ¼  Cup Sliced Almonds ","  2  Tablespoons Chicken Pita Spice Blend (Ground Sumac, Ground Cardamom, Dried Thyme, Ground Turmeric & Smoked Sweet Paprika)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5655\/20150910-2012-134-0707\/FP_090115_3_ChickenPitasWithCouscous_20-_200032_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Wash and dry the fresh produce. In a large pot, heat 2 cups of water and a big pinch of salt to boiling on high. Peel the carrots; thinly slice into rounds. Pit and finely chop the dates. Quarter and deseed the lemon. Grate the cucumber and place in a medium bowl. Pick the mint leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5656\/20150910-2013-159-8955\/FP_090115_3_ChickenPitasWithCouscous_20-_200033_high_feature.jpg","title":" Cook the couscous:  ","desc":" Add the couscous and half the spice blend to the pot of boiling water; season with salt and pepper. Stir to thoroughly combine. Remove from heat. Cover and let stand 4 to 6 minutes, or until the water has been absorbed completely. Fluff the cooked couscous with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5657\/20150910-2013-164-2188\/FP_090115_3_ChickenPitasWithCouscous_20-_200034_high_feature.jpg","title":" Cook the carrots &amp; finish the couscous:   ","desc":" While the couscous cooks, in a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the carrots; season with salt and pepper. Cook, stirring occasionally, 6 to 8 minutes, or until browned and tender. Add the dates, almonds and the juice of 2 lemon wedges; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until thoroughly combined. Transfer to the pot of cooked couscous. Stir to thoroughly combine; season with salt and pepper to taste. Set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5658\/20150910-2013-169-3663\/FP_090115_3_ChickenPitasWithCouscous_20-_200035_high_feature.jpg","title":" Make the sauce:   ","desc":" While the carrots cook, drain off and discard any excess liquid from the grated cucumber. To the bowl of drained cucumber, add the yogurt, half the mint (finely chopping just before adding) and the juice of the remaining lemon wedges. Stir to thoroughly combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5659\/20151002-1831-22-1473\/FP_090115_3_20_R100115_1_ChickenPitas_20-_206514_high_feature.jpg","title":" Cook the chicken:   ","desc":" Pat the chicken dry with paper towels; season on both sides with salt, pepper and the remaining spice blend. In the pan used to cook the carrots, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned chicken. Cook, loosely covering the pan with aluminum foil, 4 to 6 minutes per side, or until browned and cooked through. Transfer to a cutting board. Carefully rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1354\/recipe_steps\/5660\/20150910-2014-187-1554\/FP_090115_3_ChickenPitasWithCouscous_20-_200037_high_feature.jpg","title":" Finish &amp; serve your dish:   ","desc":" Heat the pan used to cook the chicken on medium until hot. Working 1 at a time, add the pitas. Toast 30 seconds to 1 minute per side, or until warmed through. Transfer to a clean, dry work surface. While the pitas toast, slice the cooked chicken crosswise on an angle. Divide the sliced chicken between the toasted pitas. Top with a few spoonfuls of the sauce (you will have extra). Garnish the finished pitas and finished couscous with the remaining mint. Serve with the remaining sauce on the side. Enjoy!  "}]}