{"category":"Vegetarian","link":"spiced-eggplant-tomato-bake-with-fregola-sarda-mozzarella-cheese","thumb":"\/\/media.blueapron.com\/recipes\/1337\/c_main_dish_images\/20150824-1515-215-9421\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_201005_high_also_thumb.jpg","title":" Spiced Eggplant &amp; Tomato Bake ","subtitle":" with Fregola Sarda &amp; Mozzarella Cheese ","headbg":"\/\/media.blueapron.com\/recipes\/1337\/c_main_dish_images\/20150824-1516-220-2490\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_201004_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  605    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Sardinia, a beautiful island off Italy&rsquo;s west coast, is famous for its diverse culinary influences. In Sardinian hands, the couscous of North Africa likely became fregola sarda, a miniature pasta made by rubbing semolina flour with water until beads form. The pasta is slow-dried, then toasted, giving it varying brown hues and bringing out its nutty flavor. Here, we&rsquo;re featuring it in a Mediterranean-inspired bake (or casserole). After tossing the pasta with mozzarella, aromatics, lemon juice and fresh oregano, we&rsquo;re topping it with sliced late-summer vegetables, breadcrumbs and Parmesan, then crisping the dish up in the oven. ","ingbg":"\/\/media.blueapron.com\/recipes\/1337\/ingredient_images\/20150826-1711-97-6386\/V2-Heirloom-Eggplant-Tomato-Bake-Fregola-Sarda-2P-W_large_feature.png","ingredients":[" 1  Cup Fregola Sarda Pasta "," 8  Ounces Fresh Mozzarella Cheese "," 1  Eggplant "," 1  Lemon "," 1  Red Bell Pepper "," 1  Red Onion "," 1  Tomato "," 1  Bunch Oregano "," ¼  Cup Grated Parmesan Cheese "," ¼  Cup Panko Breadcrumbs "," 2  Teaspoons Eggplant Bake Spice Blend (Garlic Powder, Crushed Aleppo Pepper, Dried Oregano & Dried Thyme) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5788\/20150824-1537-508-3048\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_200996_high_feature.jpg","title":" Cook the pasta:  ","desc":" Preheat the oven to 450&deg;F. Heat a large pot of salted water to boiling on high. Once boiling, add the pasta. Cook 14 to 16 minutes, or until tender. Turn off the heat. Drain thoroughly and return to the pot.  "},{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5789\/20150824-1537-521-0719\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_200995_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the pasta cooks, wash and dry the fresh produce. Cut off and discard the stem end of the eggplant; slice into &frac12;-inch-thick rounds. Remove and discard the stem, ribs and seeds of the bell pepper; medium dice the bell pepper. Peel and small dice the onion. Tear the mozzarella cheese into bite-sized pieces. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Core and halve the tomato; slice into &frac14;-inch-thick pieces. Pick the oregano leaves off the stems; discard the stems and roughly chop the leaves.  "},{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5790\/20150824-1538-526-6138\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_200997_high_feature.jpg","title":" Cook the eggplant:  ","desc":" In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the eggplant in a single layer and season with salt and pepper. (If necessary, work in batches.) Cook, flipping occasionally, 6 to 8 minutes, or until browned and tender. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5791\/20150824-1538-531-2093\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_200998_high_feature.jpg","title":" Cook the aromatics:  ","desc":" In the pan used to cook the eggplant, heat 2 teaspoons of olive oil on medium-high until hot. Add the onion, bell pepper and spice blend; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5792\/20150824-1539-604-0952\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_200999_high_feature.jpg","title":" Finish the pasta:  ","desc":" To the pot of cooked pasta, add the oregano, cooked aromatics, mozzarella cheese, the juice of all 4 lemon wedges and a drizzle of olive oil; toss to thoroughly combine and season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1337\/recipe_steps\/5793\/20150824-1539-613-1914\/2P_081815_1_HeirloomEggplant_TomatoBakewithFregolaSarda_20-_201000_high_feature.jpg","title":" Bake &amp; serve your dish:  ","desc":" Transfer the finished pasta to a baking dish. Top with the cooked eggplant and tomato in alternating, overlapping layers; season with salt and pepper. In a bowl, combine the Parmesan cheese, breadcrumbs, lemon zest and a drizzle of olive oil; season with salt and pepper. Sprinkle over the layers of eggplant and tomato. Place the baking dish on a sheet pan and bake 8 to 10 minutes, or until lightly browned on top. Remove from the oven and let stand for 2 minutes before serving. Enjoy!  "}]}