{"category":"Pork","link":"spiced-pork-chops-with-cheesy-mashed-potatoes-garlic-chopped-spinach","thumb":"\/\/media.blueapron.com\/recipes\/1122\/c_main_dish_images\/20150327-1734-2842-7157\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209865_high_also_thumb.jpg","title":" Spiced Pork Chops ","subtitle":" with Cheesy Mashed Potatoes &amp; Garlic Spinach ","headbg":"\/\/media.blueapron.com\/recipes\/1122\/c_main_dish_images\/20150327-1734-3617-3814\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209864_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" To accompany crispy, pan-seared pork chops coated in a delicious blend of spices, we&rsquo;re serving up cheesy mashed potatoes, known in France as &ldquo;pommes aligot.&rdquo; Our version of this classic side dish combines Yukon gold potatoes, melty Monterey Jack, piquant Parmesan and butter for simple, creamy goodness. The result&mdash;drizzled with a little of the pan sauce infused with the flavors of the pork chops, if you&rsquo;d like!&mdash;completes this perfect family dinner. ","ingbg":"\/\/media.blueapron.com\/recipes\/1122\/ingredient_images\/20150421-1547-2515-0883\/pork-chops-pommes-aligote-asparagus-fp-W_large_feature.png","ingredients":[" 4  Boneless, Center-Cut Pork Chops "," 1½  Pounds Yukon Gold Potatoes "," 3  Ounces Monterey Jack Cheese "," 3  Cloves Garlic "," 1  Pound Spinach ","  3  Tablespoons Butter   "," 3  Tablespoons Pork Demi-Glace "," ½  Cup Grated Parmesan Cheese "," ¼  Cup Heavy Cream "," 1  Tablespoon Pork Chop Spice Blend (Smoked Paprika, Mustard Powder, Dried Thyme, Instant Flour & Ground Nutmeg) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4332\/20150327-1738-5005-4731\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209851_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Remove the pork chops from the refrigerator to bring to room temperature. Large dice the potatoes. Peel and mince the garlic. Grate the Monterey Jack cheese.  "},{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4333\/20150327-1738-3148-4811\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209854_high_feature.jpg","title":" Cook &amp; mash the potatoes:  ","desc":" Add the potatoes to the pot of boiling water. Cook 18 to 20 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add the heavy cream, Monterey Jack cheese, half the Parmesan cheese and half the butter. Using a fork, mash the mixture to your desired consistency; season with salt and pepper to taste. Transfer to a serving dish and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4334\/20150327-1738-2348-2601\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209852_high_feature.jpg","title":" Cook &amp; drain the spinach:  ","desc":" While the potatoes cook, in a large pan, heat 1 tablespoon of olive oil on medium until hot. Add the spinach and season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until completely wilted. (If necessary, work in batches.) Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Finely chop the drained spinach. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4335\/20150327-1738-5052-5960\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209857_high_feature.jpg","title":" Cook the pork chops:  ","desc":" While the potatoes continue to cook, pat the pork chops dry with paper towels; season on both sides with salt, pepper and the spice blend. In the same pan used to cook the spinach, heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned pork chops. Cook 3 to 4 minutes per side, or until browned and cooked through. Transfer to a serving dish and set aside in a warm place. Leaving any browned bits (or fond) in the pan, carefully drain off and discard the drippings.  "},{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4336\/20150327-1739-8065-2900\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209858_high_feature.jpg","title":" Make the pan sauce:  ","desc":" Heat the pan of reserved fond on medium until hot. Add the pork demi-glace and &frac12; cup of water. Cook, stirring constantly, 1 to 2 minutes, or until thoroughly combined; season with salt and pepper to taste. Turn off the heat and stir in the remaining butter until combined. Transfer to a serving dish and set aside in a warm place. Rinse and dry the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1122\/recipe_steps\/4337\/20150327-1739-3682-2196\/FP_021815_1_20Pork_20Chops_20with_20Pommes_20Aligote_20and_20Asparagus_20-_209859_high_feature.jpg","title":" Finish the spinach &amp; serve your dish:  ","desc":" In the same pan used to make the sauce, heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic. Cook, stirring constantly, 30 seconds to 1 minute, or until golden brown and fragrant. Add the chopped spinach. Cook, stirring frequently, 30 seconds to 1 minute, or until well combined and heated through. Turn off the heat. Stir in the remaining Parmesan cheese; season with salt and pepper to taste. Transfer to a serving dish. Serve with the cooked pork chops, mashed potatoes and pan sauce. Enjoy!  "}]}