{"category":"Vegetarian","link":"spinach-ricotta-stuffed-shells-with-tomato-sauce-romaine-chopped-salad","thumb":"\/\/media.blueapron.com\/recipes\/1367\/c_main_dish_images\/20150901-1922-126-3029\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204535_high_also_thumb.jpg","title":" Spinach &amp; Ricotta-Stuffed Shells ","subtitle":" with Tomato Sauce &amp; Romaine Chopped Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1367\/c_main_dish_images\/20150901-1921-121-7685\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204534_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  550    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Warming, wholesome stuffed shells are a fixture in many Italian-American homes. They&rsquo;re the perfect dinner to prepare together: everyone can join in stuffing the shell-shaped pasta with its traditional cheesy filling (ours is made with ricotta and saut&eacute;ed spinach). To ensure the most delicious results possible, we&rsquo;re draining the spinach before making the filling, a technique that enhances its texture and green flavor. A simple, savory tomato sauce and basil garnish complete this classic. ","ingbg":"\/\/media.blueapron.com\/recipes\/1367\/ingredient_images\/20150929-1618-26-7971\/FV-Spinach-Ricotta-Stuffed-Shells-F-W_large_feature.png","ingredients":[" 10  Ounces Jumbo Pasta Shells "," 1  28-Ounce Can Crushed Tomatoes "," 2  Cups Part-Skim Ricotta Cheese "," 4  Cloves Garlic "," 1  Cucumber "," 1  Lemon "," 1  Romaine Heart "," 1  Pound Spinach "," 1  Yellow Onion ","  1  Bunch Basil   "," 1  Shallot "," ⅔  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5836\/20150904-1927-36-2764\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204518_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 450&deg;F. Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Peel and small dice the onion. Peel and mince the garlic. Cut off and discard the lettuce root; roughly chop. Halve the cucumber lengthwise; scoop out and discard the seeds, then thinly slice crosswise. Pick the basil off the stems; discard the stems. Quarter and deseed the lemon. Peel and mince the shallot to get 2 tablespoons of minced shallot (you may have extra); place in a bowl with the juice of all 4 lemon wedges.  "},{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5837\/20150904-1927-47-0910\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204519_high_feature.jpg","title":" Cook &amp; drain the spinach:  ","desc":" In a large pan, heat 1 tablespoon of olive oil on medium-high until hot. Add the spinach; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until the spinach has wilted. (If necessary, work in batches.) Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Transfer to a cutting board to cool slightly. When cool enough to handle, finely chop. Transfer to a large bowl. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5838\/20150904-1928-58-0218\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204523_high_feature.jpg","title":" Make the sauce:  ","desc":" In the pan used to cook the spinach, heat 1 tablespoon of olive oil on medium-high until hot. Add the onion and ⅔ of the garlic; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Reduce the heat to medium. Add the crushed tomatoes; season with salt and pepper. Simmer, stirring occasionally, 6 to 8 minutes, or until slightly reduced in volume. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5839\/20150904-1928-69-6918\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204521_high_feature.jpg","title":" Cook the shells &amp; make the filling:  ","desc":" While the sauce simmers, add the pasta shells to the pot of boiling water. Cook 8 to 10 minutes, or until almost tender. (The shells should still be slightly firm.) Drain thoroughly and set aside to cool slightly. To the bowl of chopped spinach, add the ricotta cheese, half the Parmesan cheese and the remaining garlic. Stir to thoroughly combine; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5840\/20150904-1928-79-3613\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204524_high_feature.jpg","title":" Stuff &amp; bake the shells:  ","desc":" Spread a layer of the sauce into the bottom of a baking dish. When cool enough to handle, working 1 at a time, fill each cooked pasta shell with a large spoonful of the filling. Place the stuffed shells, opening sides down, into the baking dish. Evenly top with the remaining sauce and Parmesan cheese. Bake 11 to 13 minutes, or until the sauce is bubbling and the cheese is lightly browned. Remove from the oven and let stand for 2 minutes.  "},{"img":"\/\/media.blueapron.com\/recipes\/1367\/recipe_steps\/5841\/20150904-1928-86-7239\/FP_082615_1_Spinach_RicottaStuffedShells_20-_204527_high_feature.jpg","title":" Make the salad and serve your dish:  ","desc":" While the shells bake, season the shallot-lemon juice mixture with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Just before serving, in a large bowl, combine the lettuce, cucumber and half the basil (tearing just before adding). Add as much of the dressing as you&rsquo;d like (you may have extra). Toss to combine; season with salt and pepper to taste. Transfer to a serving dish. Garnish the baked pasta shells with the remaining basil (tearing just before adding). Enjoy!  "}]}