{"category":"Beef","link":"steak-gyros-corn-on-the-cob-with-tzatziki-sauce-spiced-butter","thumb":"\/\/media.blueapron.com\/recipes\/1277\/c_main_dish_images\/20150817-1931-134-3174\/FP_071515_6_SteakGyro_CornontheCob_20-_209848_20Crop_high_also_thumb.jpg","title":" Steak Gyros &amp; Corn on the Cob ","subtitle":" with Tzatziki Sauce &amp; Spiced Butter ","headbg":"\/\/media.blueapron.com\/recipes\/1277\/c_main_dish_images\/20150817-1930-119-8248\/FP_071515_6_SteakGyro_CornontheCob_20-_209848_20Crop_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  595    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" We&rsquo;re bringing traditional Greek street food right into your kitchen with this recipe for tasty gyros. Our pita wraps are brimming with authentically-spiced steak, seasonal tomato, tzatziki sauce (a cooling, yogurt-based condiment) and more. And we&rsquo;re using the same spices&mdash;along with garlic paste and lemon juice&mdash;to season the butter for our corn on the cob, a deliciously summery side. Just let your butter soften enough that you can stir in the seasonings: it&rsquo;ll melt onto the freshly-boiled corn, lightly coating the sweet kernels with extra, complex flavor. ","ingbg":"\/\/media.blueapron.com\/recipes\/1277\/ingredient_images\/20150811-1427-44-2415\/fm-steak-gyro-corn-2P-W_large_feature.png","ingredients":[" 4  Sirloin Steaks "," 4  Pocketless Pitas "," ½  Cup Low-Fat, Plain Greek Yogurt ","  2  Ears Of Corn   "," 2  Cloves Garlic "," 1  Tomato "," 1  Romaine Heart "," 1  Lemon "," 1  Red Onion "," 1  Large Bunch Mint "," 2  Tablespoons Butter "," 1  Tablespoon Steak Gyro Spice Blend (Dried Oregano, Sweet Paprika, Za'atar & Ground Sumac) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5448\/20150817-1929-62-6266\/FP_071515_6_R080415_2_SteakGyro_CornontheCob_20-_204_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Remove the butter from the refrigerator to soften. Peel and mince the garlic; smash with the flat side of your knife until it resembles a paste (or use a zester). Pick the mint leaves off the stems; discard the stems. Quarter and deseed the lemon. Peel, halve and thinly slice the onion. Remove and discard the husks and silks of the corn; cut each cob into thirds. Cut off and discard the root end of the lettuce; thinly slice the leaves. Core and medium dice the tomato. Find the lines of muscle (or grain) of the steaks; thinly slice against the grain.  "},{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5449\/20150724-1704-60-8150\/FP_071515_6_SteakGyro_CornontheCob_20-_209828_high_feature.jpg","title":" Make the tzatziki sauce &amp; spiced butter:  ","desc":" In a small bowl, combine the yogurt, half the garlic paste, half the mint (finely chopping just before adding) and the juice of 2 lemon wedges; season with salt and pepper to taste. Set aside. In a separate small bowl, combine the softened butter, remaining garlic paste, ⅓ of the spice blend and the juice of the remaining lemon wedges; stir to thoroughly combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5450\/20150724-1704-71-3182\/FP_071515_6_SteakGyro_CornontheCob_20-_209829_high_feature.jpg","title":" Cook the steak &amp; onion:  ","desc":" Transfer the sliced steak to a medium bowl; season with salt, pepper and the remaining spice blend. Toss to coat. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steak and onion; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until the steak is cooked through. Transfer to a plate and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5451\/20150817-1929-78-0278\/FP_071515_6_R080415_2_SteakGyro_CornontheCob_20-_200919_high_feature.jpg","title":" Cook &amp; dress the corn:  ","desc":" While the steak and onion cook, add the corn to the pot of boiling water. Cook 2 to 3 minutes, or until bright yellow and slightly tender. Drain thoroughly and return to the pot. Off the heat, add the spiced butter; season with salt and pepper. Toss to thoroughly coat. Transfer to a serving dish and set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5452\/20150724-1705-98-9038\/FP_071515_6_SteakGyro_CornontheCob_20-_209831_high_feature.jpg","title":" Toast the pitas:  ","desc":" Heat the pan used to cook the steak and onion on medium until hot. Working 1 at a time, add the pitas. Toast 30 seconds to 1 minute per side, or until lightly toasted and warmed through. Transfer to a serving dish.  "},{"img":"\/\/media.blueapron.com\/recipes\/1277\/recipe_steps\/5453\/20150724-1705-113-4112\/FP_071515_6_SteakGyro_CornontheCob_20-_209833_high_feature.jpg","title":" Finish &amp; serve your dish:  ","desc":" Divide the lettuce, cooked steak and onion and tomato between the toasted pitas. Garnish with the remaining mint (thinly slicing just before adding). Serve with the dressed corn and tzatziki sauce on the side. Enjoy!  "}]}