{"category":"Poultry","link":"sweet-chili-basil-chicken-with-coconut-jasmine-rice","thumb":"\/\/media.blueapron.com\/recipes\/1314\/c_main_dish_images\/20150901-1821-32-0785\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209968_high_also_thumb.jpg","title":" Sweet Chili &amp; Basil Chicken ","subtitle":" with Peppers, Eggplant &amp; Coconut Jasmine Rice ","headbg":"\/\/media.blueapron.com\/recipes\/1314\/c_main_dish_images\/20150901-1820-21-5127\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209965_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  590    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" Sweet chili and basil chicken is one of the most beloved options on Thai restaurant menus. This recipe adapts the classic for your kitchen, using the best of late summer&rsquo;s produce. Along with sweet chili sauce, sweet peppers&mdash;a pleasantly mild variety&shy;&mdash;give our stir-fry its brightness of flavor. And absorbent eggplant soaks up all the flavors of the saucy stir-fry. For another touch of sweetness, we&rsquo;re serving a side of jasmine rice infused with coconut milk. ","ingbg":"\/\/media.blueapron.com\/recipes\/1314\/ingredient_images\/20150901-1822-37-9619\/FP-sweet-chili-chicken-coconut-rice-2P-W_large_feature.png","ingredients":[" 4  Boneless, Skinless Chicken Breasts "," 1¼  Cups Jasmine Rice "," 1¾  Cups Light Coconut Milk "," ⅓  Cup Sweet Chili Sauce "," 6  Ounces Sweet Peppers "," 4  Cloves Garlic "," 3  Scallions ","  ¾  Pound Eggplant   "," 1  Bunch Thai Basil "," 1  2-Inch Piece Ginger ","  ¼  Cup Ponzu Sauce   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5582\/20150901-1822-63-6223\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209957_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut off and discard the stem ends of the eggplant; slice the eggplant into &frac12;-inch-thick rounds. Peel and mince the garlic and ginger. Cut off and discard the root ends of the scallions; thinly slice the white bottoms and cut the green tops into &frac12;-inch pieces. Trim off and discard the stem ends of the sweet peppers; using a spoon, scrape out and discard any seeds. Cut the sweet peppers into &frac14;-inch-thick rings. Pick the basil leaves off the stems; discard the stems. Thinly slice the chicken crosswise; thoroughly wash your hands, knife and cutting board afterwards.   "},{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5583\/20150901-1822-72-4601\/FP_072815_5_20Sweet_20Chili_20Chicken_20Coconut_20Jasmine_20Rice-0180_high_feature.jpg","title":" Make the coconut rice:  ","desc":" In a large pot, combine the rice, coconut milk (shaking the can before opening), a big pinch of salt and &frac34; cup of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 12 to 14 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and fluff the cooked coconut rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5584\/20150901-1822-77-7764\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209959_high_feature.jpg","title":" Cook the eggplant:  ","desc":" While the coconut rice cooks, in a large pan (nonstick, if you have one), heat 1 tablespoon of oil on medium-high until hot. Add the eggplant in a single layer; season with salt and pepper. (If necessary, work in batches.) Cook, flipping occasionally, 7 to 9 minutes, or until browned and tender. Transfer to a plate. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5585\/20150901-1824-21-5005\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209960_high_feature.jpg","title":" Start the chicken &amp; vegetables:  ","desc":" While the coconut rice continues to cook, pat the sliced chicken dry with paper towels; season with salt and pepper. In the pan used to cook the eggplant, heat 1 tablespoon of oil on medium-high until hot. Add the seasoned chicken. Cook, stirring occasionally, 5 to 7 minutes, or until lightly browned and cooked through. Add the garlic, ginger, white bottoms of the scallions and sweet peppers; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until the peppers have softened.  "},{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5586\/20150901-1824-27-5699\/FP_072815_5_R_082815_6_BasilSweetChiliChicken_20-_209961_high_feature.jpg","title":" Finish the chicken &amp; vegetables:  ","desc":" To the pan of chicken and vegetables, add the cooked eggplant, sweet chili sauce, ponzu sauce and half the basil (tearing just before adding). Cook, stirring occasionally, 2 to 3 minutes, or until thoroughly combined and the sauce has thickened slightly. Remove from heat and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1314\/recipe_steps\/5587\/20150807-1456-62-9489\/FP_072815_5_20Sweet_20Chili_20Chicken_20Coconut_20Jasmine_20Rice-0182_high_feature.jpg","title":" Finish &amp; serve your dish:   ","desc":" Transfer the coconut rice and finished chicken and vegetables to serving dishes. Garnish with the green tops of the scallions and remaining basil. Enjoy!  "}]}