{"category":"Vegetarian","link":"sweet-potato-fontina-pizza-with-apple-celeriac-arugula-salad","thumb":"\/\/media.blueapron.com\/recipes\/1342\/c_main_dish_images\/20150826-1625-113-8663\/FP_081915_1_SweetPotato_FontinaPizza_20-_201116_high_also_thumb.jpg","title":" Sweet Potato &amp; Fontina Pizza ","subtitle":" with Apple, Celeriac &amp; Arugula Salad ","headbg":"\/\/media.blueapron.com\/recipes\/1342\/c_main_dish_images\/20150826-1624-104-6831\/FP_081915_1_SweetPotato_FontinaPizza_20-_201115_splash_feature.jpg","portions":" Makes:  4 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this autumn-inspired recipe, we&rsquo;re topping our gourmet pizza with b&eacute;chamel&shy;, a traditional French white sauce&mdash;with mild Fontina cheese melted in. Then we&rsquo;re layering on sweet potato, red onion and arugula. For a seasonal side, we&rsquo;re tossing arugula with refreshing, crunchy apple and celeriac (or celery root). When peeling the celeriac, be sure to use your sturdiest, sharpest knife. &ldquo;Squaring off&rdquo; the root (or cutting off the sides to turn it into a square) both peels it and makes it easier to cut into matchsticks. Celeriac&rsquo;s uniquely delicate and crisp flavor is worth the effort! ","ingbg":"\/\/media.blueapron.com\/recipes\/1342\/ingredient_images\/20150828-1921-26-8702\/FV-Sweet-Potato-Fontina-Pizza-FP-W_large_feature.png","ingredients":[" 1½  Pounds Plain Pizza Dough ","  6  Ounces Fontina Cheese   "," ¾  Cup Low-Fat Milk "," 4  Ounces Arugula "," 1  Apple "," 1  Lemon "," 1  Pound Sweet Potatoes "," 1  Red Onion ","  1  Celeriac Root   "," 3  Tablespoons All-Purpose Flour "," ¼  Cup Grated Parmesan Cheese "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5916\/20150828-1914-55-0737\/FP_081915_1_SweetPotato_FontinaPizza_20-_201106_high_feature.jpg","title":" Prepare the ingredients:   ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Peel the sweet potatoes; slice into &frac14;-inch-thick rounds. Cut off and discard the rind of the Fontina cheese; small dice. Peel, halve and thinly slice the onion. Quarter and deseed the lemon. Core the apple; cut into matchsticks. Peel the celeriac; cut into matchsticks. In a bowl, toss the apple and celeriac with the juice of 1 lemon wedge.  "},{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5917\/20150828-1914-65-6310\/FP_081915_1_SweetPotato_FontinaPizza_20-_201108_high_feature.jpg","title":" Cook the sweet potatoes:   ","desc":" Add the sweet potatoes to the pot of boiling water. Cook 6 to 8 minutes, or until just tender when pierced with a fork. Drain thoroughly.  "},{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5918\/20150828-1914-70-5248\/FP_081915_1_SweetPotato_FontinaPizza_20-_201109_high_feature.jpg","title":" Make the béchamel sauce:  ","desc":" While the potatoes cook, in a large pot, heat 2 tablespoons of olive oil on medium-high until hot. Whisk in the flour. Cook, whisking frequently, 1 to 2 minutes, or until golden brown. Slowly whisk in the milk and &frac12; cup of water. Cook, whisking frequently, 3 to 5 minutes, or until slightly thickened. (If the sauce seems dry, add up to &frac14; cup of water.) Add half the Fontina cheese; whisk to combine. Season with salt and pepper to taste. Remove from heat.  "},{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5919\/20150828-1914-79-8129\/FP_081915_1_SweetPotato_FontinaPizza_20-_201110_high_feature.jpg","title":" Assemble the pizza:  ","desc":" Lightly oil a large sheet pan. On a clean, dry work surface, using your hands, gently stretch out the dough to a &frac14;-inch thickness. Transfer to the prepared sheet pan; gently rub into the pan to coat the bottom of the dough in oil. Spread the b&eacute;chamel sauce onto the dough. Top with the cooked sweet potatoes, as much of the onion as you&rsquo;d like, half the Parmesan cheese and the remaining Fontina cheese; season with salt and pepper.  "},{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5920\/20150828-1915-89-4426\/FP_081915_1_SweetPotato_FontinaPizza_20-_201111_high_feature.jpg","title":" Bake the pizza:  ","desc":" Place the pizza in the oven and bake, turning halfway through, 16 to 18 minutes, or until the cheese has browned and the crust is crispy and cooked through. Remove from the oven. Let cool for 2 minutes before serving.  "},{"img":"\/\/media.blueapron.com\/recipes\/1342\/recipe_steps\/5921\/20150828-1915-84-1188\/FP_081915_1_SweetPotato_FontinaPizza_20-_201112_high_feature.jpg","title":" Make the salad &amp; serve your dish:   ","desc":" While the pizza bakes, in a small bowl, combine the remaining Parmesan cheese and the juice of the remaining lemon wedges; season with salt and pepper to taste. Slowly whisk in 2 tablespoons of olive oil until well combined. Just before serving, in a large bowl, combine the apple, celeriac, arugula and as much of the dressing as you&rsquo;d like (you may have extra). Toss to combine; season with salt and pepper to taste. Transfer to a serving dish. Garnish the baked pizza with some of the dressed arugula. Serve with the salad on the side. Enjoy!  "}]}