{"category":"Poultry","link":"tandoori-spiced-chicken-with-raja-eggplant-lentils-cucumber-mint-yogurt","thumb":"\/\/media.blueapron.com\/recipes\/1283\/c_main_dish_images\/20150713-2100-376-1354\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208434_high_also_thumb.jpg","title":" Tandoori-Spiced Chicken ","subtitle":" with Green Lentils, Heirloom Eggplant &amp; Cucumber-Mint Yogurt ","headbg":"\/\/media.blueapron.com\/recipes\/1283\/c_main_dish_images\/20150713-2050-96-8259\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208433_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  575    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" This delicious, Indian-inspired meal is a celebration of spices. Tandoori chicken is a popular Indian dish, in which chicken is typically marinated in yogurt and coated in masala (a classic Indian spice mix). Here, we&rsquo;re turning the yogurt into a sauce by combining it with mint and grated Persian cucumber. And we&rsquo;re searing the coated chicken to lightly char the spices, bringing out their complex flavors. As a hearty, creamy side, we&rsquo;re making green lentils, mixed with a second blend of spices and simmered with onion and heirloom eggplant. (Depending on what&rsquo;s best in your area, your eggplant may be either slender and purple or round and white.) ","ingbg":"\/\/media.blueapron.com\/recipes\/1283\/ingredient_images\/20150811-1736-138-9384\/Tandoori-Spiced-Chicken-Lentils-2P-W_large_feature.png","ingredients":[" 2  Boneless, Skinless Chicken Breasts "," ½  Cup Green Lentils "," ½  Cup Low-Fat, Plain Greek Yogurt "," 1  Heirloom Eggplant ","  1  Persian Cucumber   "," 1  Yellow Onion "," 1  Large Bunch Mint "," 2  Teaspoons Tandoori Spice Blend (Sweet Paprika, Ground Coriander, Ground Ginger, Garlic Powder & Ground Cayenne Pepper) "," 1  Tablespoon Lentil Spice Blend (Garam Masala, Ground Turmeric & Whole Black Mustard Seeds) "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5368\/20150713-2111-30-7213\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208413_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Cut off and discard the stem end of the eggplant; medium dice. Peel and small dice the onion. Using a box grater, grate the cucumber into a medium bowl. Pick the mint leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5369\/20150713-2112-49-6754\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208414_high_feature.jpg","title":" Cook the eggplant &amp; onion:  ","desc":" In a large pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the eggplant and onion; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until softened. Add the lentil spice blend. Cook, stirring frequently, 30 seconds to 1 minute, or until the spices are toasted and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5370\/20150713-2112-67-7408\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208417_high_feature.jpg","title":" Add the lentils:  ","desc":" Add the lentils and 3 cups of water to the pan of eggplant and onion; season with salt and pepper. Cook, stirring occasionally, 24 to 26 minutes, or until the lentils are tender. Remove from heat. Season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5371\/20150713-2114-23-9597\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208415_high_feature.jpg","title":" Make the cucumber-mint yogurt:  ","desc":" While the lentils cook, using a spoon, press down on the grated cucumber to release any excess liquid; discard the liquid. To the bowl of drained cucumber, add the yogurt and half the mint (finely chopping just before adding); stir to combine and season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5372\/20150713-2115-35-3540\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208416_high_feature.jpg","title":" Cook the chicken:  ","desc":" While the lentils continue to cook, pat the chicken dry with paper towels. Season on both sides with salt, pepper and the tandoori spice blend. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the seasoned chicken and cook, loosely covering the pan with aluminum foil, 3 to 5 minutes per side, or until browned and cooked through. Remove from heat. Transfer the cooked chicken to a cutting board.  "},{"img":"\/\/media.blueapron.com\/recipes\/1283\/recipe_steps\/5373\/20150713-2115-47-9970\/2P_070815_3_TandooriSpicedChickenwithGreenLentils_20-_208419_high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" Stir half the cucumber-mint yogurt into the pan of cooked lentils; season with salt and pepper to taste. Thinly slice the cooked chicken. Divide the cooked lentils between 2 dishes. Top with the sliced chicken. Garnish with the remaining mint (finely chopping just before adding). Serve with the remaining cucumber-mint yogurt on the side. Enjoy!  "}]}