{"category":"Poultry","link":"thai-chicken-burgers-with-hoisin-mayo-potato-wedges","thumb":"\/\/media.blueapron.com\/recipes\/7\/c_main_dish_images\/20150728-1550-59-8891\/2P_072115_1_ThaiChickenBurgers_20-_209710_high_also_thumb.jpg","title":" Thai Chicken Burgers ","subtitle":" with Hoisin Mayo &amp; Roasted Potato Wedges ","headbg":"\/\/media.blueapron.com\/recipes\/7\/c_main_dish_images\/20140808-1610-60-9417\/MainDishImage_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, inspired by the cuisine of Thailand, we&rsquo;re putting a uniquely delicious spin on chicken burgers. For incredible, authentic flavor, we&rsquo;re saut&eacute;ing aromatics&mdash;including citrusy lemongrass, an essential Thai ingredient&mdash;and mixing them into the patties. We&rsquo;re also adding sesame oil, soy sauce and sriracha (a spicy, chile-based condiment) to complete the flavor profile. Slathered onto the toasted potato buns, a spread of hoisin sauce and mayonnaise adds creamy sweetness and richness. For a light, crispy side, we&rsquo;re making homemade &ldquo;fries&rdquo; with long, hearty potato wedges, roasted in the oven. ","ingbg":"\/\/media.blueapron.com\/recipes\/7\/ingredient_images\/20150825-1806-53-2142\/P-thai-chicken-burgers-2P-W_large_feature.png","ingredients":[" 10  Ounces Ground Chicken "," 2  Potato Buns "," 2  Cloves Garlic "," 1  Tomato "," 1  Pound Russet Potatoes "," 1  Stalk Lemongrass "," 1  Large Bunch Cilantro "," 2  Tablespoons Hoisin Sauce "," 2  Teaspoons Sesame Oil "," 2  Teaspoons Sriracha ","  1  1-Inch Piece Ginger   "," 1  Tablespoon Soy Sauce "," ½  Cup Panko Breadcrumbs "," ¼  Cup Mayonnaise "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1307\/20150728-1618-130-0897\/2P_072115_1_ThaiChickenBurgers_20-_209693_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Preheat the oven to 475&deg;F. Wash and dry the fresh produce. Cut the potatoes lengthwise into 1-inch-wide wedges. Peel and mince the garlic and ginger. Cut off and discard both ends of the lemongrass; peel away and discard the fibrous, outer layers until you reach the white, pliable core. Mince the lemongrass core. Halve the buns. Thinly slice the tomato into rounds. Pick the cilantro leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1308\/20150728-1618-149-6306\/2P_072115_1_ThaiChickenBurgers_20-_209696_high_feature.jpg","title":" Roast the potato wedges:  ","desc":" Place the potato wedges on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer, skin sides down, and roast 24 to 26 minutes, or until browned and tender when pierced with a fork. Remove from the oven.  "},{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1309\/20150728-1620-179-9562\/2P_072115_1_ThaiChickenBurgers_20-_209694_high_feature.jpg","title":" Cook the aromatics &amp; make the hoisin mayo:  ","desc":" While the potatoes roast, in a medium pan (nonstick, if you have one), heat 2 teaspoons of oil on medium-high until hot. Add the garlic, lemongrass and ginger. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Transfer to a large bowl and set aside to cool slightly. Wipe out the pan. While the aromatics cool, in a small bowl, combine the mayonnaise and hoisin sauce; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1310\/20150728-1620-168-6522\/2P_072115_1_ThaiChickenBurgers_20-_209695_high_feature.jpg","title":" Form &amp; cook the burgers:  ","desc":" To the bowl of cooled aromatics, add the ground chicken, breadcrumbs, sesame oil, soy sauce and as much of the sriracha as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be; season with salt and pepper. Stir to combine. Using your hands, form the mixture into two &frac12;-inch-thick burgers. In the pan used to cook the aromatics, heat 2 teaspoons of oil on medium-high until hot. Add the burgers; loosely cover the pan with aluminum foil. Cook 3 to 5 minutes per side, or until browned and cooked through. Transfer to a plate, leaving any browned bits (or fond) in the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1311\/20150728-1620-194-3213\/2P_072115_1_ThaiChickenBurgers_20-_209697_high_feature.jpg","title":" Toast the buns:  ","desc":" Heat the pan of reserved fond on medium until hot. (If the pan seems dry, add 1 teaspoon of olive oil.) Add the buns, cut sides down. Toast 30 seconds to 1 minute, or until lightly browned. Transfer to a clean, dry work surface.  "},{"img":"\/\/media.blueapron.com\/recipes\/7\/recipe_steps\/1312\/20150728-1620-210-5687\/2P_072115_1_ThaiChickenBurgers_20-_209698_high_feature.jpg","title":" Assemble the burgers &amp; plate your dish:  ","desc":" Spread a layer of the hoisin mayo onto the bottom of each toasted bun. Place a cooked burger and as much of the tomato as you&rsquo;d like on the bun bottoms; season with salt and pepper. Top with the cilantro and the bun tops. Serve with the roasted potato wedges and any remaining hoisin mayo on the side. Enjoy!  "}]}