{"category":"Pork","link":"triple-pork-ramen-with-roasted-garlic-pea-tips","thumb":"\/\/media.blueapron.com\/recipes\/1114\/c_main_dish_images\/20150408-1430-29318-3522\/2P_121614_4_20Spring_20Pork_20Ramen_20-_200067_high_also_thumb.jpg","title":" Triple Pork Mazemen ","subtitle":" with Roasted Garlic &amp; Pea Tips ","headbg":"\/\/media.blueapron.com\/recipes\/1114\/c_main_dish_images\/20150408-1430-1248-3443\/2P_121614_4_20Spring_20Pork_20Ramen_20-_200066_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" It seems almost impossible to exhaust the possibilities of ramen. Here, we&rsquo;re making a special version called mazeman. Unlike most ramen dishes, mazeman is &ldquo;dry&rdquo;&mdash;meaning that instead of a broth, the noodles are coated in a thin sauce. This allows the toppings to take center stage. We&rsquo;re using spring vegetables, roasted garlic and three forms of pork (bacon, ground pork and a little pork demi-glace in the sauce). It&rsquo;s a hearty, seasonal take on traditional Japanese cuisine. ","ingbg":"\/\/media.blueapron.com\/recipes\/1114\/ingredient_images\/20150410-1337-933-4115\/spring-pork-ramen-2p-w_large_feature.png","ingredients":[" 5  Ounces Ground Pork "," 1  Slice Bacon "," 12  Ounces Fresh Ramen Noodles ","  2  Ounces Pea Tips   ","  1  Bunch Garlic Chives   "," 1  Head Garlic "," 3  Tablespoons Pork Demi-Glace "," 2  Tablespoons Soy Sauce ","  2  Tablespoons Mirin   "," 1  1-Inch Piece Ginger ","  1  Teaspoon Pork Mazeman Spice Blend (Black Sesame Seeds, White Sesame Seeds, Kibbled Nori & Sansho Pepper)   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4471\/20150408-1432-27324-9913\/2P_121614_3_20Spring_20Pork_20Ramen_20-_206730_high_feature.jpg","title":" Prepare &amp; roast the garlic:  ","desc":" Preheat the oven to 475&deg;F. Cut off and discard just enough of the top of the head of garlic to expose the cloves, keeping the rest of the head as intact as possible. Place on a piece of aluminum foil; drizzle with olive oil and season with salt and pepper. Tightly wrap the foil around the prepared garlic head and place on a sheet pan. Roast in the oven 28 to 30 minutes, or until browned and very soft. Remove from the oven and carefully unwrap. Set aside to cool.  "},{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4472\/20150408-1432-27331-1356\/2P_121614_3_20Spring_20Pork_20Ramen_20-_206726_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" While the garlic roasts, wash and dry the fresh produce. Heat a large pot of salted water to boiling on high. Small dice the bacon. Mince the garlic chives. Cut the pea tips into 1-inch pieces. Peel and mince the ginger.   "},{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4473\/20150408-1432-1105-1971\/2P_121614_3_20Spring_20Pork_20Ramen_20-_206727_high_feature.jpg","title":" Cook the bacon:  ","desc":" While the garlic continues to roast, in a medium pot, heat 1 teaspoon of oil on medium until hot. Add the bacon and cook, stirring occasionally, 3 to 4 minutes, or until browned and crispy.   "},{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4474\/20150408-1432-32438-1971\/2P_121614_3_20Spring_20Pork_20Ramen_20-_206732_high_feature.jpg","title":" Add the aromatics &amp; pork:  ","desc":" Add the ginger and all but a pinch of the garlic chives to the pot of bacon. Cook, stirring frequently, 2 to 3 minutes, or until softened and fragrant. Add the ground pork and cook, frequently breaking the meat apart with a spoon, 4 to 5 minutes, or until cooked through; season with salt and pepper. Remove from heat.   "},{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4475\/20150408-1432-27345-7123\/2P_121614_3_20Spring_20Pork_20Ramen_20-_206734_high_feature.jpg","title":" Make the sauce:  ","desc":" When cool enough to handle, using your hands, gently squeeze the individual cloves out of the head of roasted garlic; discard the head. To the pot of aromatics and pork, add the soy sauce, mirin, pork demi-glace, roasted garlic cloves and 1 cup of water; stir to thoroughly combine. Heat to boiling on high. Once boiling, reduce the heat to medium and simmer, stirring occasionally, 2 to 3 minutes, or until slightly reduced in volume.    "},{"img":"\/\/media.blueapron.com\/recipes\/1114\/recipe_steps\/4476\/20150408-1432-27338-1557\/2P_121614_4_20Spring_20Pork_20Ramen_20-_200057_20_from_20reshoot__high_feature.jpg","title":" Finish &amp; plate your dish:  ","desc":" While the sauce simmers, add the noodles to the pot of boiling water. Cook, stirring occasionally, for exactly 90 seconds. Drain thoroughly and immediately transfer to the pot of sauce. Cook, stirring constantly, 1 to 2 minutes, or until thoroughly coated. Turn off the heat. Stir in the pea tips; season with salt and pepper to taste. Divide the finished mazeman between 2 bowls. Garnish with the spice blend and remaining garlic chives. Enjoy!  "}]}