{"category":"Lamb","link":"vadouvan-spiced-lamb-burger-with-crispy-curried-zucchini-rounds","thumb":"\/\/media.blueapron.com\/recipes\/1252\/c_main_dish_images\/20150619-1643-72-6999\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207396_high_also_thumb.jpg","title":" Vadouvan-Spiced Lamb Burgers ","subtitle":" with Crispy Curried Zucchini Rounds ","headbg":"\/\/media.blueapron.com\/recipes\/1252\/c_main_dish_images\/20150619-1642-59-0494\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207395_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  700    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this dish, we&rsquo;re putting a French and Indian spin on the traditional burger. Vadouvan curry powder, a French spice inspired by Indian masala, is full of powerful, savory flavor. We&rsquo;re using it here to season patties featuring lamb (a meat popular in Indian cuisine) and pairing the burgers with lightly fried, vadouvan-spiced zucchini rounds. And to perfectly balance the dish, we&rsquo;re topping the burgers with a creamy yogurt sauce, which also makes the perfect crispy zucchini dip. ","ingbg":"\/\/media.blueapron.com\/recipes\/1252\/ingredient_images\/20150626-1843-2123-5457\/Vadouvan-Spiced-Lamb-Burger-with-Crispy-Curried-Zucchini-Rounds-2P-W_large_feature.png","ingredients":[" 8  Ounces Ground Lamb & Beef Blend "," 2  Hamburger Buns "," ¾  Cup Panko Breadcrumbs "," ½  Cup Plain Low-Fat Greek Yogurt "," 1  Romaine Heart "," 1  Lemon "," 1  Red Onion "," 1  Zucchini "," 1  Bunch Mint "," 3  Tablespoons All-Purpose Flour ","  1  Tablespoon Vadouvan Curry Powder   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5170\/20150619-1658-273-0747\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207383_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Using a peeler, remove the lemon rind, avoiding the pith; mince to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon. Pick the mint off the stems; discard the stems. Trim off and discard the root end of the lettuce. Halve the buns. Cut the zucchini into 1-inch-thick rounds on angle. Peel and halve the onion. Thinly slice 1 half; small dice the other.  "},{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5171\/20150619-1659-284-3505\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207385_high_feature.jpg","title":" Make the coating mixture &amp; yogurt sauce:  ","desc":" In a medium bowl, combine ⅓ of the Greek yogurt and 3 tablespoons of water; season with salt and pepper. Set aside. In a small bowl, combine the remaining Greek yogurt, half the mint (roughly chopping before adding) and the juice of 2 lemon wedges; season with salt and pepper to taste.  "},{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5173\/20150619-1659-295-6225\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207386_high_feature.jpg","title":" Bread the zucchini:  ","desc":" Place the zucchini in a bowl; season with salt, pepper and half the vadouvan curry powder. Toss to coat. Place the flour and breadcrumbs in 2 separate medium bowls. Working 1 at a time, completely coat each seasoned zucchini round in the flour (tapping off any excess), then dip in the coating mixture (letting the excess drip off), then coat in the breadcrumbs (pressing down firmly). Transfer to a sheet pan (or plate).  "},{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5172\/20150619-1659-306-9195\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207387_high_feature.jpg","title":" Form &amp; cook the burgers:  ","desc":" Place the ground lamb and beef blend, lemon zest, diced onion and remaining vadouvan curry powder in a large bowl; season with salt and pepper. Gently mix to combine. Using your hands, form into two &frac12;-inch-thick burgers. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the burgers and cook 2 to 4 minutes per side, or until browned and cooked to your desired degree of doneness. Transfer to a plate; cover with foil and set aside in a warm place. Wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5174\/20150619-1659-333-5440\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207388_high_feature.jpg","title":" Cook the zucchini:  ","desc":" In the pan used to cook the burgers, heat a thin layer of oil on medium-high until hot. Add the breaded zucchini rounds in a single layer. Cook 3 to 4 minutes per side, or until golden brown and crispy. Transfer to a paper towel-lined plate; season immediately with salt and pepper. Carefully wipe out the pan.  "},{"img":"\/\/media.blueapron.com\/recipes\/1252\/recipe_steps\/5175\/20150619-1659-344-9673\/2P_061615_1_Vadouvan_20Spiced_20Lamb_20Burger_20with_20Crispy_20Curried_20Zucchini_20Rounds_20-_207389_high_feature.jpg","title":" Toast the buns &amp; plate your dish:  ","desc":" In the same pan, heat 2 teaspoons of olive oil on medium until hot. Add the buns, cut sides down; toast 1 to 3 minutes, or until lightly browned. Transfer to a clean, dry work surface. Place as much of the lettuce and sliced onion as you&rsquo;d like (you may have extra) onto the bun bottoms. Top each with a cooked burger, a few spoonfuls of the yogurt sauce (you will have extra), some of the remaining mint and a bun top. Divide between 2 plates. Serve with the cooked zucchini rounds and remaining yogurt sauce on the side. Garnish with the remaining lemon wedges. Enjoy!  "}]}