{"category":"Vegetarian","link":"vegetarian-green-coconut-curry-with-jasmine-rice","thumb":"\/\/media.blueapron.com\/recipes\/365\/c_main_dish_images\/20150911-2043-26-4456\/R_091115_2_CoconutVegGreenCurry_20-_200623_high_also_thumb.jpg","title":" Thai Green Coconut Curry ","subtitle":" with Sweet Potato, Green Beans &amp;  Jasmine Rice ","headbg":"\/\/media.blueapron.com\/recipes\/365\/c_main_dish_images\/20150911-1952-59-7622\/R_091115_2_CoconutVegGreenCurry_20-_200622_splash_feature.jpg","portions":" Makes:  2 Servings  ","calories":" Calories:  About  640    Per Serving ","time":"Cooking Time: so fast as you can!","desc":" In this incredibly satisfying, Thai-inspired dish, we&rsquo;re making a green coconut curry with sweet potato and crisp, late-summer green beans. Green curry paste&mdash;made with ground green chile peppers, herbs and spices&mdash;provides amazing layers of flavor and heat. It pairs perfectly with creamy coconut milk, fresh lime juice and a little zest. And to soak up the dish&rsquo;s flavors, we&rsquo;re serving fragrant jasmine rice right on top, to stir into the rich broth, along with cilantro and chopped cashews. ","ingbg":"\/\/media.blueapron.com\/recipes\/365\/ingredient_images\/20150914-2020-102-4177\/v2-veg-green-curry-2P-W_large_feature.png","ingredients":[" 1¾  Cups Unsweetened Coconut Milk "," ¾  Cup Jasmine Rice "," 4  Ounces Green Beans "," 2  Cloves Garlic "," 1  Lime "," 1  Yellow Onion "," 1  Sweet Potato "," 1  Bunch Cilantro "," 3  Tablespoons Cashews "," 2  Tablespoons Green Curry Paste ","  1  1-Inch Piece Ginger   "],"steps":[{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2228\/20140723-2018-3396-5037\/step1_high_feature.jpg","title":" Prepare the ingredients:  ","desc":" Wash and dry the fresh produce. Peel and mince the garlic and ginger. Peel and thinly slice the onion. Peel and medium dice the sweet potato. Using a peeler, remove the green rind of the lime, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter the lime. Roughly chop the cashews. Trim off and discard the stem ends of the green beans; halve crosswise. Pick the cilantro leaves off the stems; discard the stems.  "},{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2229\/20140723-2018-5442-5469\/step2_high_feature.jpg","title":" Cook the rice:  ","desc":" In a small pot, combine the rice, a big pinch of salt and 1&frac14; cups of water. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Simmer 11 to 13 minutes, or until the liquid has been absorbed and the rice is tender. Remove from heat and fluff the cooked rice with a fork. Set aside in a warm place.  "},{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2230\/20140723-2018-4638-9910\/step3_high_feature.jpg","title":" Start the curry:  ","desc":" While the rice cooks, in a large pot, heat 2 teaspoons of oil on medium until hot. Add the garlic and ginger; season with salt and pepper. Cook, stirring frequently, 30 seconds to 1 minute, or until softened and fragrant. Add as much of the curry paste as you&rsquo;d like, depending on how spicy you&rsquo;d like the dish to be. Cook, stirring frequently, 30 seconds to 1 minute, or until the curry paste is toasted and fragrant.  "},{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2231\/20140723-2018-3402-6229\/step4_high_feature.jpg","title":" Add the vegetables &amp; make the broth:  ","desc":" Add the onion and sweet potato to the pot; season with salt. (If the pot seems dry, add 1 teaspoon of oil.) Cook, stirring frequently, 4 to 6 minutes, or until the onion has softened. Stir in the lime zest, coconut milk (shaking the can before opening) and &frac34; cup of water. Simmer, stirring occasionally, 6 to 8 minutes, or until the sweet potato is tender when pierced with a fork.  "},{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2232\/20140723-2018-5448-7856\/step5_high_feature.jpg","title":" Toast the cashews:   ","desc":" While the curry simmers, heat a small, dry pan on medium until hot. Add the cashews and toast, stirring frequently, 1 to 2 minutes, or until lightly browned and fragrant. Transfer to a small bowl.  "},{"img":"\/\/media.blueapron.com\/recipes\/365\/recipe_steps\/2233\/20140723-2019-5454-6033\/step6_high_feature.jpg","title":" Finish the curry &amp; serve your dish:  ","desc":" Add the green beans to the pot of curry. Simmer 1 to 3 minutes, or until the green beans are slightly tender. Remove from heat and stir in the juice of 2 lime wedges; season with salt and pepper to taste. Divide the finished curry between 2 bowls; top with the cooked rice. Garnish with the toasted cashews, cilantro and remaining lime wedges. Enjoy!  "}]}